zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t SLEN6      : 1;            /*!< This bit enables slot 6 for ADC conversions.                              */
      __IOM uint32_t WCEN6      : 1;            /*!< This bit enables the window compare function for slot 6.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL6     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE6    : 2;            /*!< Set the Precision Mode For Slot 6.                                        */
      __IOM uint32_t TRKCYC6    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL6     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL6CFG_b;
  } ;

  union {
    __IOM uint32_t SL7CFG;                      /*!< Slot 7 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN7      : 1;            /*!< This bit enables slot 7 for ADC conversions.                              */
      __IOM uint32_t WCEN7      : 1;            /*!< This bit enables the window compare function for slot 7.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL7     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE7    : 2;            /*!< Set the Precision Mode For Slot 7.                                        */
      __IOM uint32_t TRKCYC7    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL7     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL7CFG_b;
  } ;

  union {
    __IOM uint32_t WULIM;                       /*!< Sets the window comparator upper limit                                    */

    struct {
      __IOM uint32_t ULIM       : 20;           /*!< Sets the upper limit for the window comparator.                           */
            uint32_t            : 12;
    } WULIM_b;
  } ;

  union {
    __IOM uint32_t WLLIM;                       /*!< Sets the window comparator lower limit                                    */

    struct {
      __IOM uint32_t LLIM       : 20;           /*!< Sets the lower limit for the window comparator.                           */
            uint32_t            : 12;
    } WLLIM_b;
  } ;

  union {
    __IOM uint32_t SCWLIM;                      /*!< Sets the scaling limits for the window comparator                         */

    struct {
      __IOM uint32_t SCWLIMEN   : 1;            /*!< Scale the window limits compare values per precision mode. When
                                                     set to 0x0 (default), the values in the 20-bit limits registers
                                                     will compare directly with the FIFO values regardless of
                                                     the precision mode the slot is configured to. When set
                                                     to 0x1, the compare values will be divided by the difference
                                                     in precision bits while performing the window limit comparisons.          */
            uint32_t            : 31;
    } SCWLIM_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< The ADC FIFO Register contains up to 2 samples for a single
                                                     channel (high and low gain PGA samples), each sample up
                                                     to 12-bits. It also contains meta data in the form of which
                                                     audio channel the sample(s) are from along with the PGA
                                                     gain code for that sample pair. When no data is present,
                                                     FIFO entry reads back as all 1s (0xFFFFFFFF).                             */

    struct {
      __IOM uint32_t METALO     : 4;            /*!< Meta data about this sample which represents the lower 4 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t LGDATA     : 12;           /*!< Low-gain PGA sample data                                                  */
      __IOM uint32_t METAHI     : 3;            /*!< Meta data about this sample which represents the upper 3 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t MIC        : 1;            /*!< Which audio channel this data is from encoded as int(slot number/2).
                                                     In other words, this is 1 if data is from slots 2 or 3,
                                                     or 0 if from slots 0 or 1.                                                */
      __IOM uint32_t HGDATA     : 12;           /*!< High-gain PGA sample data                                                 */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< This is a pop-on-read mirrored copy of the ADCFIFO register
                                                     with the only difference being that reading this register
                                                     will result in a simultaneous FIFO POP which is also achieved
                                                     by writing to the ADCFIFO Register. Note: The DFIFORDEN
                                                     bit must be set in the CFG register for the the destructive
                                                     read to be enabled.                                                       */

