zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< ADC conversion complete interrupt.                                        */
      __IOM uint32_t SCNCMP     : 1;            /*!< ADC scan complete interrupt.                                              */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< FIFO 75 percent full interrupt.                                           */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< FIFO 100 percent full interrupt.                                          */
      __IOM uint32_t WCEXC      : 1;            /*!< Window comparator voltage excursion interrupt.                            */
      __IOM uint32_t WCINC      : 1;            /*!< Window comparator voltage incursion interrupt.                            */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Condition                                                       */
      __IOM uint32_t ZXCA       : 1;            /*!< Zero Crossing - Channel A (Slots 0 or 1)                                  */
      __IOM uint32_t ZXCB       : 1;            /*!< Zero Crossing - Channel B (Slots 2 or 3)                                  */
      __IOM uint32_t SATCA      : 1;            /*!< Saturation - Channel A (Slots 0 or 1)                                     */
      __IOM uint32_t SATCB      : 1;            /*!< Saturation - Channel B (Slots 2 or 3)                                     */
            uint32_t            : 20;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< ADC conversion complete interrupt.                                        */
      __IOM uint32_t SCNCMP     : 1;            /*!< ADC scan complete interrupt.                                              */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< FIFO 75 percent full interrupt.                                           */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< FIFO 100 percent full interrupt.                                          */
      __IOM uint32_t WCEXC      : 1;            /*!< Window comparator voltage excursion interrupt.                            */
      __IOM uint32_t WCINC      : 1;            /*!< Window comparator voltage incursion interrupt.                            */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Condition                                                       */
      __IOM uint32_t ZXCA       : 1;            /*!< Zero Crossing - Channel A (Slots 0 or 1)                                  */
      __IOM uint32_t ZXCB       : 1;            /*!< Zero Crossing - Channel B (Slots 2 or 3)                                  */
      __IOM uint32_t SATCA      : 1;            /*!< Saturation - Channel A (Slots 0 or 1)                                     */
      __IOM uint32_t SATCB      : 1;            /*!< Saturation - Channel B (Slots 2 or 3)                                     */
            uint32_t            : 20;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< ADC conversion complete interrupt.                                        */
      __IOM uint32_t SCNCMP     : 1;            /*!< ADC scan complete interrupt.                                              */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< FIFO 75 percent full interrupt.                                           */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< FIFO 100 percent full interrupt.                                          */
      __IOM uint32_t WCEXC      : 1;            /*!< Window comparator voltage excursion interrupt.                            */
      __IOM uint32_t WCINC      : 1;            /*!< Window comparator voltage incursion interrupt.                            */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Condition                                                       */
      __IOM uint32_t ZXCA       : 1;            /*!< Zero Crossing - Channel A (Slots 0 or 1)                                  */
      __IOM uint32_t ZXCB       : 1;            /*!< Zero Crossing - Channel B (Slots 2 or 3)                                  */
      __IOM uint32_t SATCA      : 1;            /*!< Saturation - Channel A (Slots 0 or 1)                                     */
      __IOM uint32_t SATCB      : 1;            /*!< Saturation - Channel B (Slots 2 or 3)                                     */
            uint32_t            : 20;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< ADC conversion complete interrupt.                                        */
      __IOM uint32_t SCNCMP     : 1;            /*!< ADC scan complete interrupt.                                              */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< FIFO 75 percent full interrupt.                                           */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< FIFO 100 percent full interrupt.                                          */
      __IOM uint32_t WCEXC      : 1;            /*!< Window comparator voltage excursion interrupt.                            */
      __IOM uint32_t WCINC      : 1;            /*!< Window comparator voltage incursion interrupt.                            */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Condition                                                       */
      __IOM uint32_t ZXCA       : 1;            /*!< Zero Crossing - Channel A (Slots 0 or 1)                                  */
      __IOM uint32_t ZXCB       : 1;            /*!< Zero Crossing - Channel B (Slots 2 or 3)                                  */
      __IOM uint32_t SATCA      : 1;            /*!< Saturation - Channel A (Slots 0 or 1)                                     */
      __IOM uint32_t SATCB      : 1;            /*!< Saturation - Channel B (Slots 2 or 3)                                     */
            uint32_t            : 20;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED3[12];

  union {
    __IOM uint32_t DMATRIGEN;                   /*!< Configures the ADC DMA trigger                                            */

