zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t IOM1CLKEN  : 1;            /*!< IOM 1 clock is on                                                         */
      __IOM uint32_t IOM2CLKEN  : 1;            /*!< IOM 2 clock is on                                                         */
      __IOM uint32_t IOM3CLKEN  : 1;            /*!< IOM 3 clock is on                                                         */
      __IOM uint32_t IOM4CLKEN  : 1;            /*!< IOM 4 clock is on                                                         */
      __IOM uint32_t IOM5CLKEN  : 1;            /*!< IOM 5 clock is on                                                         */
      __IOM uint32_t IOM6CLKEN  : 1;            /*!< IOM 6 clock is on                                                         */
      __IOM uint32_t IOM7CLKEN  : 1;            /*!< IOM 7 clock is on                                                         */
      __IOM uint32_t MSPI0CLKEN : 1;            /*!< MSPI 0 clock is on                                                        */
      __IOM uint32_t MSPI1CLKEN : 1;            /*!< MSPI 1 clock is on                                                        */
      __IOM uint32_t MSPI2CLKEN : 1;            /*!< MSPI 2 clock is on                                                        */
      __IOM uint32_t MSPI3CLKEN : 1;            /*!< MSPI 3 clock is on                                                        */
      __IOM uint32_t OTPXTLCLKEN : 1;           /*!< OTP XTL clock is on                                                       */
      __IOM uint32_t RSTGENCLKEN : 1;           /*!< Reset generator POR clock is on                                           */
      __IOM uint32_t RSTGENPOSCLKEN : 1;        /*!< Reset generator POR clock is on                                           */
      __IOM uint32_t RTCCLKEN   : 1;            /*!< Real Time Clock clock is on                                               */
      __IOM uint32_t SDIO0CLKEN : 1;            /*!< SDIO 0 clock is on                                                        */
      __IOM uint32_t SDIO1CLKEN : 1;            /*!< SDIO 1 clock is on                                                        */
      __IOM uint32_t UART0CLKEN : 1;            /*!< UART 0 clock is on                                                        */
      __IOM uint32_t UART1CLKEN : 1;            /*!< UART 1 clock is on                                                        */
      __IOM uint32_t UART2CLKEN : 1;            /*!< UART 2 clock is on                                                        */
      __IOM uint32_t UART3CLKEN : 1;            /*!< UART 3 clock is on                                                        */
      __IOM uint32_t USBREFCLKEN : 1;           /*!< USB reference clock is on                                                 */
      __IOM uint32_t WDTCLKEN   : 1;            /*!< WDT clock is on                                                           */
      __IOM uint32_t XTALENABLED : 1;           /*!< XTAL oscillator enable                                                    */
            uint32_t            : 8;
    } CLOCKEN3STAT_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t MISC;                        /*!< This register controls a 'safe' mode for burst, which disables
                                                     the clock when burst transition is happening. It also includes
                                                     a register to force the HFRC during deep sleep. It is mainly
                                                     used for debug and testing.                                               */

    struct {
      __IOM uint32_t FRCHFRC    : 1;            /*!< Force HFRC On .                                                           */
      __IOM uint32_t FRCBURSTOFF : 1;           /*!< Force fclk, hclk, fclk_wic and fclk_pmu to be turned off during
                                                     burst transition.                                                         */
            uint32_t            : 3;
      __IOM uint32_t FRCHFRC2   : 1;            /*!< Force HFRC2 On.When changing a module's clock source to HFRC2,
                                                     this bit must be set before changing the MUX select to
                                                     HFRC2 and then cleared after setting the MUX select to
                                                     HFRC2.                                                                    */
      __IOM uint32_t PWRONCLKENDISP : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENDISPPHY : 1;     /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENGFX : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSB : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENSDIO : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENCRYPTO : 1;      /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S0 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t AXIXACLKENOVRRIDE : 1;     /*!< Chicken bit to disable Rev B added clock gating                           */
      __IOM uint32_t PWRONCLKENI2S0REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSBREFCLK : 1;   /*!< Chicken bit to disable Rev B clock enable during reset                    */
            uint32_t            : 1;
      __IOM uint32_t GFXCLKCLKGATEEN : 1;       /*!< Clock gate enable for GFX clock                                           */
      __IOM uint32_t GFXAXICLKCLKGATEEN : 1;    /*!< Clock gate enable for GFX AXI clock                                       */
      __IOM uint32_t APBDMACPUCLKCLKGATEEN : 1; /*!< Clock gate enable for APB DMA clock                                       */
      __IOM uint32_t ETMTRACECLKCLKGATEEN : 1;  /*!< Chicken bit to enable clock gating on ETM TRACE CLK                       */
      __IOM uint32_t HFRCFUNCCLKGATEEN : 1;     /*!< Chicken bit to enable clock gating on HFRC_FUNC_CLK                       */
      __IOM uint32_t HFRC96TRUNKGATE : 1;       /*!< DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0,
                                                     will kill HFRC root clock.                                                */
      __IOM uint32_t CLKGENMISCSPARE : 1;       /*!< Spare/Unused Chicken Bit                                                  */
            uint32_t            : 6;
    } MISC_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ0;                     /*!< This register controls hf2adj enable, fast_start enable, fast_start_delay
                                                     setting and counter input offset.                                         */

