zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP31 : 10;        /*!< Contains the physical address in memory to map the R31 register.          */
            uint32_t            : 21;
    } MEMORYMAP31_b;
  } ;

  union {
    __IOM uint32_t OPCODE;                      /*!< This register holds the PKAs OPCODE.                                      */

    struct {
      __IOM uint32_t TAG        : 6;            /*!< Holds the operations tag or the operand C virtual address.                */
      __IOM uint32_t REGR       : 6;            /*!< Result register virtual address 0-15.                                     */
      __IOM uint32_t REGB       : 6;            /*!< Operand B virtual address 0-15.                                           */
      __IOM uint32_t REGA       : 6;            /*!< Operand A virtual address 0-15.                                           */
      __IOM uint32_t LEN        : 3;            /*!< The length of the operation. The value serves as a pointer to
                                                     PKA length register, for example, if the value is 0, PKA_L0
                                                     holds the size of the operation.                                          */
      __IOM uint32_t OPCODE     : 5;            /*!< Defines the PKA operation:                                                */
    } OPCODE_b;
  } ;

  union {
    __IOM uint32_t NNPT0T1ADDR;                 /*!< This register maps N_NP_T0_T1 to a virtual address.                       */

    struct {
      __IOM uint32_t NVIRTUALADDR : 5;          /*!< Virtual address of register N.                                            */
      __IOM uint32_t NPVIRTUALADDR : 5;         /*!< Virtual address of register NP.                                           */
      __IOM uint32_t T0VIRTUALADDR : 5;         /*!< Virtual address of temporary register number 0                            */
      __IOM uint32_t T1VIRTUALADDR : 5;         /*!< Virtual address of temporary register number 1                            */
            uint32_t            : 12;
    } NNPT0T1ADDR_b;
  } ;

  union {
    __IOM uint32_t PKASTATUS;                   /*!< This register holds the PKA pipe status.                                  */

    struct {
      __IOM uint32_t ALUMSB4BITS : 4;           /*!< The most significant 4-bits of the operand updated in shift
                                                     operation.                                                                */
      __IOM uint32_t ALULSB4BITS : 4;           /*!< The least significant 4-bits of the operand updated in shift
                                                     operation.                                                                */
      __IOM uint32_t ALUSIGNOUT : 1;            /*!< Indicates the last operations sign (MSB).                                 */
      __IOM uint32_t ALUCARRY   : 1;            /*!< Holds the carry of the last ALU operation.                                */
      __IOM uint32_t ALUCARRYMOD : 1;           /*!< holds the carry of the last Modular operation.                            */
      __IOM uint32_t ALUSUBISZERO : 1;          /*!< Indicates the last subtraction operations sign .                          */
      __IOM uint32_t ALUOUTZERO : 1;            /*!< Indicates if the result of ALU OUT is zero.                               */
      __IOM uint32_t ALUMODOVRFLW : 1;          /*!< Modular overflow flag.                                                    */
      __IOM uint32_t DIVBYZERO  : 1;            /*!< Indication if the division is done by zero.                               */
      __IOM uint32_t MODINVOFZERO : 1;          /*!< Indicates the Modular inverse of zero.                                    */
      __IOM uint32_t OPCODE     : 5;            /*!< Opcode of the last operation                                              */
            uint32_t            : 11;
    } PKASTATUS_b;
  } ;

  union {
    __IOM uint32_t PKASWRESET;                  /*!< Writing to this register triggers a software reset of the PKA.            */

    struct {
      __IOM uint32_t PKASWRESET : 1;            /*!< The reset mechanism takes about four PKA clock cycles until
                                                     the reset line is deasserted                                              */
            uint32_t            : 31;
    } PKASWRESET_b;
  } ;

  union {
    __IOM uint32_t PKAL0;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL0      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL0_b;
  } ;

  union {
    __IOM uint32_t PKAL1;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL1      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL1_b;
  } ;

  union {
    __IOM uint32_t PKAL2;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL2      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL2_b;
  } ;

  union {
    __IOM uint32_t PKAL3;                       /*!< This register holds one of the optional size of the operation.            */

    struct {
      __IOM uint32_t PKAL3      : 13;           /*!< Size of the operation in bytes.                                           */
            uint32_t            : 19;
    } PKAL3_b;
  } ;

  union {
    __IOM uint32_t PKAL4;                       /*!< This register holds one of the optional size of the operation.            */

