zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t AUTOCORRTRYS : 14;         /*!< Count each time an autocorrelation test starts. Any write to
                                                     the register resets the counter. Stops collecting statistics
                                                     if one of the counters has reached the limit.                             */
      __IOM uint32_t AUTOCORRFAILS : 8;         /*!< Count each time an autocorrelation test fails. Any write to
                                                     the register resets the counter. Stops collecting statistics
                                                     if one of the counters has reached the limit.                             */
            uint32_t            : 10;
    } AUTOCORRSTATISTIC_b;
  } ;

  union {
    __IOM uint32_t TRNGDEBUGCONTROL;            /*!< This register is used to debug the TRNG                                   */

    struct {
            uint32_t            : 1;
      __IOM uint32_t VNCBYPASS  : 1;            /*!< When this bit is set, the Von-Neumann balancer is bypassed (including
                                                     the 32 consecutive bits test). Note: Can only be set while
                                                     in debug mode. If TRNG_TESTS_BYPASS_EN HW flag is defined,
                                                     this bit can be set while not in debug mode.                              */
      __IOM uint32_t TRNGCRNGTBYPASS : 1;       /*!< When this bit is set, the CRNGT test in the TRNG is bypassed.
                                                     Note: Can only be set while in debug mode. If TRNG_TESTS_BYPASS_EN
                                                     HW flag is defined, this bit can be set while not in debug
                                                     mode.                                                                     */
      __IOM uint32_t AUTOCORRELATEBYPASS : 1;   /*!< When this bit is set, the autocorrelation test in the TRNG module
                                                     is bypassed. Note: Can only be set while in debug mode.
                                                     If TRNG_TESTS_BYPASS_EN HW flag is defined, this bit can
                                                     be set while not in debug mode.                                           */
            uint32_t            : 28;
    } TRNGDEBUGCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t RNGSWRESET;                  /*!< Generate SW reset solely to RNG block.                                    */

    struct {
      __IOM uint32_t RNGSWRESET : 1;            /*!< Any value written (0x0 or 0x1) causes a reset cycle to the TRNG
                                                     block.                                                                    */
            uint32_t            : 31;
    } RNGSWRESET_b;
  } ;
  __IM  uint32_t  RESERVED6[28];

  union {
    __IOM uint32_t RNGDEBUGENINPUT;             /*!< Defines the RNG in debug mode                                             */

    struct {
      __IOM uint32_t RNGDEBUGEN : 1;            /*!< Reflects the rng_debug_enable input port                                  */
            uint32_t            : 31;
    } RNGDEBUGENINPUT_b;
  } ;

  union {
    __IOM uint32_t RNGBUSY;                     /*!< RNG busy indication                                                       */

    struct {
      __IOM uint32_t RNGBUSY    : 1;            /*!< Reflects rng_busy output port which Consists of trng_busy and
                                                     prng_busy.                                                                */
      __IOM uint32_t TRNGBUSY   : 1;            /*!< Reflects trng_busy.                                                       */
      __IOM uint32_t PRNGBUSY   : 1;            /*!< Reflects prng_busy.                                                       */
            uint32_t            : 29;
    } RNGBUSY_b;
  } ;

  union {
    __IOM uint32_t RSTBITSCOUNTER;              /*!< Resets the counter of collected bits in the TRNG                          */

    struct {
      __IOM uint32_t RSTBITSCOUNTER : 1;        /*!< Writing any value to this address resets the bits counter and
                                                     trng valid registers.                                                     */
            uint32_t            : 31;
    } RSTBITSCOUNTER_b;
  } ;

  union {
    __IOM uint32_t RNGVERSION;                  /*!< This register holds the RNG version                                       */

    struct {
      __IOM uint32_t EHRWIDTH192 : 1;           /*!< EHR width selection.                                                      */
      __IOM uint32_t CRNGTEXISTS : 1;           /*!< CRNGT exists.                                                             */
      __IOM uint32_t AUTOCORREXISTS : 1;        /*!< Auto correct exists.                                                      */
      __IOM uint32_t TRNGTESTSBYPASSEN : 1;     /*!< TRNG tests bypass enable.                                                 */
      __IOM uint32_t PRNGEXISTS : 1;            /*!< PRNG Exists.                                                              */
      __IOM uint32_t KATEXISTS  : 1;            /*!< KAT exists.                                                               */
      __IOM uint32_t RESEEDINGEXISTS : 1;       /*!< Reseeding exists.                                                         */
      __IOM uint32_t RNGUSE5SBOXES : 1;         /*!< RNG use 5 (or 20) SBOX AES                                                */
            uint32_t            : 24;
    } RNGVERSION_b;
  } ;

  union {
    __IOM uint32_t RNGCLKENABLE;                /*!< Writing to this register enables_disables the RNG clock.                  */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Writing value 0x1 enables RNG clock.                                      */
            uint32_t            : 31;
    } RNGCLKENABLE_b;
  } ;

  union {
    __IOM uint32_t RNGDMAENABLE;                /*!< Writing to this register enables_disables the RNG DMA.                    */

