zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< Writing value 0x1 enables RNG DMA to SRAM. The Value is cleared
                                                     when DMA completes its operation.                                         */
            uint32_t            : 31;
    } RNGDMAENABLE_b;
  } ;

  union {
    __IOM uint32_t RNGDMASRCMASK;               /*!< This register defines which ring-oscillator length should be
                                                     used when using the RNG DMA.                                              */

    struct {
      __IOM uint32_t ENSRCSEL0  : 1;            /*!< Writing value 0x1 enables SRC_SEL 0.                                      */
      __IOM uint32_t ENSRCSEL1  : 1;            /*!< Writing value 0x1 enables SRC_SEL 1.                                      */
      __IOM uint32_t ENSRCSEL2  : 1;            /*!< Writing value 0x1 enables SRC_SEL 2.                                      */
      __IOM uint32_t ENSRCSEL3  : 1;            /*!< Writing value 0x1 enables SRC_SEL 3.                                      */
            uint32_t            : 28;
    } RNGDMASRCMASK_b;
  } ;

  union {
    __IOM uint32_t RNGDMASRAMADDR;              /*!< This register defines the start address of the DMA for the TRNG
                                                     data.                                                                     */

    struct {
      __IOM uint32_t RNGSRAMDMAADDR : 11;       /*!< Defines the start address of the DMA for the TRNG data.                   */
            uint32_t            : 21;
    } RNGDMASRAMADDR_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t RNGWATCHDOGVAL;              /*!< This register defines the number of 192-bits samples that the
                                                     DMA collects per RNG configuration.bitfield 7:0 RNG_SAMPLES_NUM
                                                     rw 0x0 Defines the number of 192-bits samples that the
                                                     DMA collects per RNG configuration.bitfield 31:8 RESERVED
                                                     rw 0x0 RESERVEDThis register defines the maximum number
                                                     of clock cycles per TRNG collection of 192 samples. If
                                                     the number of cycles for a collection exceeds this threshold,
                                                     TRNG signals an interrupt.                                                */

    struct {
      __IOM uint32_t RNGWATCHDOGVAL : 32;       /*!< Defines the maximum number of clock cycles per TRNG collection
                                                     of 192 samples. If the number of cycles for a collection
                                                     exceeds this threshold, TRNG signals an interrupt.                        */
    } RNGWATCHDOGVAL_b;
  } ;

  union {
    __IOM uint32_t RNGDMASTATUS;                /*!< This register holds the RNG DMA status.                                   */

    struct {
      __IOM uint32_t RNGDMABUSY : 1;            /*!< Indicates whether DMA is busy.                                            */
      __IOM uint32_t DMASRCSEL  : 2;            /*!< The active ring oscillator length using by DMA                            */
      __IOM uint32_t NUMOFSAMPLES : 8;          /*!< Number of samples already collected in the current ring oscillator
                                                     chain length.                                                             */
            uint32_t            : 21;
    } RNGDMASTATUS_b;
  } ;
  __IM  uint32_t  RESERVED8[104];

  union {
    __IOM uint32_t CHACHACONTROLREG;            /*!< CHACHA general configuration.                                             */

    struct {
      __IOM uint32_t CHACHAORSALSA : 1;         /*!< Core:                                                                     */
      __IOM uint32_t INITFROMHOST : 1;          /*!< Start init for new Message:                                               */
      __IOM uint32_t CALCKEYFORPOLY1305 : 1;    /*!< Only if ChaCha core:                                                      */
      __IOM uint32_t KEYLEN     : 1;            /*!< For All Core:                                                             */
      __IOM uint32_t NUMOFROUNDS : 2;           /*!< The core of ChaCha is a hash function which based on rotation
                                                     operations. The hash function consist in application of
                                                     20 rounds (default value). In additional, ChaCha have two
                                                     variants (they work exactly as the original algorithm):
                                                     ChaCha20_8 and ChaCha20_12 (using 8 and 12 rounds).                       */
            uint32_t            : 3;
      __IOM uint32_t RESETBLOCKCNT : 1;         /*!< For new message                                                           */
      __IOM uint32_t USEIV96BIT : 1;            /*!< If use 96bit IV                                                           */
            uint32_t            : 21;
    } CHACHACONTROLREG_b;
  } ;

  union {
    __IOM uint32_t CHACHAVERSION;               /*!< CHACHA Version                                                            */

    struct {
      __IOM uint32_t CHACHAVERSION : 32;        /*!< CHACHA version.                                                           */
    } CHACHAVERSION_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY0;                  /*!< bits 255:224 of CHACHA Key                                                */

    struct {
      __IOM uint32_t CHACHAKEY0 : 32;           /*!< bits 255:224 of CHACHA Key                                                */
    } CHACHAKEY0_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY1;                  /*!< bits 223:192 of CHACHA Key                                                */

