zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t AESKEY04   : 32;           /*!< bits 159:128 of AES Key0 .                                                */
    } AESKEY04_b;
  } ;

  union {
    __IOM uint32_t AESKEY05;                    /*!< bits 191:160 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY05   : 32;           /*!< bits 191:160 of AES Key0.                                                 */
    } AESKEY05_b;
  } ;

  union {
    __IOM uint32_t AESKEY06;                    /*!< bits 223:192 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY06   : 32;           /*!< bits 223:192 of AES Key0.                                                 */
    } AESKEY06_b;
  } ;

  union {
    __IOM uint32_t AESKEY07;                    /*!< bits 255:224 of AES Key0 (used as the AES key in non-tunneling
                                                     operations, and as the first tunnel stage key in tunneling
                                                     operations).                                                              */

    struct {
      __IOM uint32_t AESKEY07   : 32;           /*!< bits 255:224 of AES Key0.                                                 */
    } AESKEY07_b;
  } ;

  union {
    __IOM uint32_t AESKEY10;                    /*!< bits 31:0 of AES Key1 (used as the second AES tunnel stage key
                                                     in tunneling operations).                                                 */

    struct {
      __IOM uint32_t AESKEY10   : 32;           /*!< bits 31:0 of AES Key1.                                                    */
    } AESKEY10_b;
  } ;

  union {
    __IOM uint32_t AESKEY11;                    /*!< bits 63:32 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY11   : 32;           /*!< bits 63:32 of AES Key1.                                                   */
    } AESKEY11_b;
  } ;

  union {
    __IOM uint32_t AESKEY12;                    /*!< bits 95:64 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY12   : 32;           /*!< bits 95:64 of AES Key1.                                                   */
    } AESKEY12_b;
  } ;

  union {
    __IOM uint32_t AESKEY13;                    /*!< bits 127:96 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY13   : 32;           /*!< bits 127:96 of AES Key1.                                                  */
    } AESKEY13_b;
  } ;

  union {
    __IOM uint32_t AESKEY14;                    /*!< bits 159:128 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY14   : 32;           /*!< bits 159:128 of AES Key1.                                                 */
    } AESKEY14_b;
  } ;

  union {
    __IOM uint32_t AESKEY15;                    /*!< bits 191:160 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY15   : 32;           /*!< bits 191:160 of AES Key1.                                                 */
    } AESKEY15_b;
  } ;

  union {
    __IOM uint32_t AESKEY16;                    /*!< bits 223:192 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY16   : 32;           /*!< bits 223:192 of AES Key1.                                                 */
    } AESKEY16_b;
  } ;

  union {
    __IOM uint32_t AESKEY17;                    /*!< bits 255:224 of AES Key1 (used as the second AES tunnel stage
                                                     key in tunneling operations).                                             */

    struct {
      __IOM uint32_t AESKEY17   : 32;           /*!< bits 255:224 of AES Key1.                                                 */
    } AESKEY17_b;
  } ;

  union {
    __IOM uint32_t AESIV00;                     /*!< bits 31:0 of AES_IV0 register. AES IV0 is used as the AES IV
                                                     (Initialization Value) register in non-tunneling operations,and
                                                     as the first tunnel stage IV register in tunneling operations.The
                                                     IV register should be loaded according to the AES mode:in
                                                     AES CBC_CBC-MAC - the AES IV register should be loaded
                                                     with the IV (initialization vector).in XTS-AES - the AES
                                                     IV register should be loaded with the T value (unless the
                                                     HW T calculation mode is active, in which the T value is
                                                     calculated by the HW).                                                    */

