zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the PKA clock.                                                     */
            uint32_t            : 31;
    } PKACLKENABLE_b;
  } ;

  union {
    __IOM uint32_t DMACLKENABLE;                /*!< DMA_CLK enable register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the DMA clock.                                                     */
            uint32_t            : 31;
    } DMACLKENABLE_b;
  } ;

  union {
    __IOM uint32_t CLKSTATUS;                   /*!< The CryptoCell clocks status register. Note: This is a special
                                                     register, affected by internal logic. Test result of this
                                                     register is NA.                                                           */

    struct {
      __IOM uint32_t AESCLKSTATUS : 1;          /*!< Status of AES clock enable.                                               */
            uint32_t            : 1;
      __IOM uint32_t HASHCLKSTATUS : 1;         /*!< Status of HASH clock clock enable.                                        */
      __IOM uint32_t PKACLKSTATUS : 1;          /*!< Status of PKA clock enable.                                               */
            uint32_t            : 3;
      __IOM uint32_t CHACHACLKSTATUS : 1;       /*!< Status of CHACHA clock enable.                                            */
      __IOM uint32_t DMACLKSTATUS : 1;          /*!< Status of DMA clock enable.                                               */
            uint32_t            : 23;
    } CLKSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED28[12];

  union {
    __IOM uint32_t CHACHACLKENABLE;             /*!< CHACHA _SALSA clock enable register. Note: This is a special
                                                     register, affected by internal logic. Test result of this
                                                     register is NA.                                                           */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the CHACHA SALSA clock enable.                                     */
            uint32_t            : 31;
    } CHACHACLKENABLE_b;
  } ;
  __IM  uint32_t  RESERVED29[41];

  union {
    __IOM uint32_t CRYPTOCTL;                   /*!< Defines the cryptographic flow.                                           */

    struct {
      __IOM uint32_t MODE       : 5;            /*!< Determines the active cryptographic engine:                               */
      __IOM uint32_t standard   : 27;           /*!< This field is reserved, do not modify.                                    */
    } CRYPTOCTL_b;
  } ;
  __IM  uint32_t  RESERVED30[3];

  union {
    __IOM uint32_t CRYPTOBUSY;                  /*!< This register is set when the cryptographic core is busy.                 */

    struct {
      __IOM uint32_t CRYPTOBUSY : 1;            /*!< Crypto busy status.                                                       */
            uint32_t            : 31;
    } CRYPTOBUSY_b;
  } ;
  __IM  uint32_t  RESERVED31[2];

  union {
    __IOM uint32_t HASHBUSY;                    /*!< This register is set when the Hash engine is busy.                        */

    struct {
      __IOM uint32_t HASHBUSY   : 1;            /*!< Hash busy status.                                                         */
            uint32_t            : 31;
    } HASHBUSY_b;
  } ;
  __IM  uint32_t  RESERVED32[4];

  union {
    __IOM uint32_t CONTEXTID;                   /*!< A general RD_WR register. For Firmware use.                               */

    struct {
      __IOM uint32_t CONTEXTID  : 8;            /*!< Context ID                                                                */
            uint32_t            : 24;
    } CONTEXTID_b;
  } ;
  __IM  uint32_t  RESERVED33[11];

  union {
    __IOM uint32_t GHASHSUBKEY00;               /*!< Bits 31:0 of GHASH Key0 (used as the GHASH module key).                   */

    struct {
      __IOM uint32_t GHASHSUBKEY00 : 32;        /*!< Bits 31:0 of GHASH Key0.                                                  */
    } GHASHSUBKEY00_b;
  } ;

  union {
    __IOM uint32_t GHASHSUBKEY01;               /*!< Bits 63:32 of GHASH Key0 (used as the GHASH module key).                  */

    struct {
      __IOM uint32_t GHASHSUBKEY01 : 32;        /*!< Bits 63:32 of GHASH Key0.                                                 */
    } GHASHSUBKEY01_b;
  } ;

  union {
    __IOM uint32_t GHASHSUBKEY02;               /*!< Bits 95:64 of GHASH Key0 (used as the GHASH module key).                  */

    struct {
      __IOM uint32_t GHASHSUBKEY02 : 32;        /*!< Bits 95:64 of GHASH Key0.                                                 */
    } GHASHSUBKEY02_b;
  } ;

  union {
    __IOM uint32_t GHASHSUBKEY03;               /*!< Bits 127:96 of GHASH Key0 (used as the GHASH module key).                 */

    struct {
      __IOM uint32_t GHASHSUBKEY03 : 32;        /*!< Bits 127:96 of GHASH Key0.                                                */
    } GHASHSUBKEY03_b;
  } ;

  union {
    __IOM uint32_t GHASHIV00;                   /*!< Bits 31:0 of GHASH_IV0 register. GHASH IV0 is used as the GHASH
                                                     IV (Initialization Value) register.                                       */

    struct {
      __IOM uint32_t GHASHIV00  : 32;           /*!< Bits 31:0 of GHASH_IV0 register of the GHASH module. For the
                                                     description of GHASH_IV0, see the GHASH_0_0 register description          */
    } GHASHIV00_b;
  } ;

  union {
    __IOM uint32_t GHASHIV01;                   /*!< Bits 63:32 of GHASH_IV0 register. GHASH IV0 is used as the GHASH
                                                     IV (Initialization Value) register.                                       */

