zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t DCID       : 32;           /*!< Fixed value for DC ID                                                     */
    } IDREG_b;
  } ;

  union {
    __IOM uint32_t INTERRUPT;                   /*!< Register interrupts enabled, level or edge enabled.                       */

    struct {
      __IOM uint32_t INTVSYNCEN : 1;            /*!< When set to 1, VSYNC interrupt enabled                                    */
      __IOM uint32_t INTHSYNCEN : 1;            /*!< When set to 1, HSYNC interrupt enabled                                    */
      __IOM uint32_t INTMMUERR  : 1;            /*!< When set to 1, MMU error interrupt enabled                                */
      __IOM uint32_t INTTEEN    : 1;            /*!< When set to 1, TE interrupt enabled                                       */
            uint32_t            : 27;
      __IOM uint32_t INTTRIGGER : 1;            /*!< Interrupt request trigger control                                         */
    } INTERRUPT_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< DSI Status register (interrupt and pending activity)                      */

    struct {
      __IOM uint32_t STATNOTBLANK : 1;          /*!< Indicates that the controller is not in active vertical blanking          */
      __IOM uint32_t STATDE     : 1;            /*!< Indicates the DE signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATHSYNC  : 1;            /*!< Indicates the HSYNC signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATVSYNC  : 1;            /*!< Indicates the VSYNC signal status and the tearing e?ect signal
                                                     status (0 or 1) at the current time of reading                            */
      __IOM uint32_t STATCSYNC  : 1;            /*!< Indicates the CSYNC signal status (0 or 1) at the current time
                                                     of reading                                                                */
      __IOM uint32_t STATLAST   : 1;            /*!< Indicates that the last row is currently displayed                        */
      __IOM uint32_t STATUF     : 1;            /*!< Indicates current underflow                                               */
      __IOM uint32_t STATSTICKY : 1;            /*!< Indicates sticky underflow. This bit clears when interrupt register
                                                     is written                                                                */
      __IOM uint32_t STATTEAR   : 1;            /*!< Indicates DBI Type-B tearing effect                                       */
      __IOM uint32_t RSVD09     : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t STATDBIRGB : 1;            /*!< Indicates pending RGB data in DBI interface                               */
      __IOM uint32_t STATDBIPENDCOM : 1;        /*!< Indicates pending commands in DBI interface                               */
      __IOM uint32_t STATDBIPENDTRANS : 1;      /*!< Indicates pending output transaction in DBI interface                     */
      __IOM uint32_t FRAMEEND   : 1;            /*!< Indicates Frame end                                                       */
      __IOM uint32_t DBISPICS   : 1;            /*!< Indicates the DBI/SPI CS status                                           */
      __IOM uint32_t CMDFIFOACK : 1;            /*!< Indicates the DBI/SPI Command fifo ack                                    */
      __IOM uint32_t SPIRDWR    : 1;            /*!< Indicates read/write operation on SPI                                     */
      __IOM uint32_t CRCREADY   : 1;            /*!< Indicates CRC Register read ready                                         */
      __IOM uint32_t GPISTACK   : 1;            /*!< Indicates GPI got stack durring packet transaction                        */
      __IOM uint32_t RSVD19     : 13;           /*!< This field is reserved.                                                   */
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t COLMOD;                      /*!< Color mode status register indicating formats/back pressure
                                                     are enabled.                                                              */

    struct {
      __IOM uint32_t RSVD0017   : 17;           /*!< This field is reserved.                                                   */
      __IOM uint32_t TSC4       : 1;            /*!< Indicates that TSC4 is enabled                                            */
      __IOM uint32_t TSC6       : 1;            /*!< Indicates that TS6 is enabled                                             */
      __IOM uint32_t DBIBEXTERNAL : 1;          /*!< Indicate DBIB external control is enabled                                 */
      __IOM uint32_t RSVD20     : 3;            /*!< This field is reserved                                                    */
      __IOM uint32_t LAYER0FLIPX : 1;           /*!< Indicate that FlipX is equiped for layer0                                 */
      __IOM uint32_t LAYER1FLIPX : 1;           /*!< Indicate that FlipX is equiped for layer1                                 */
      __IOM uint32_t LAYER2FLIPX : 1;           /*!< Indicate that FlipX is equiped for layer2                                 */
      __IOM uint32_t LAYER3FLIPX : 1;           /*!< Indicate that FlipX is equiped for layer3                                 */
      __IOM uint32_t FLIPY      : 1;            /*!< Indicate that FlipY is equiped                                            */
      __IOM uint32_t RSVD28     : 1;            /*!< This field is reserved                                                    */
      __IOM uint32_t JDI        : 1;            /*!< Indicates that NemaDC is equiped JDI                                      */
      __IOM uint32_t RSVD30     : 2;            /*!< This field is reserved                                                    */
    } COLMOD_b;
  } ;

  union {
    __IOM uint32_t LAYER0COLORDECSTARTXY;       /*!< X and Y stat of dimensions of colordec in layer0                          */

