zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t WT6        : 32;           /*!< GPIO223-192 Reads or writes pin state. Writes of 1 bits set
                                                     output pad signal if the GPIO is enabled for output. Reads
                                                     return status, including sets/clears through the WTS and
                                                     WTC registers.                                                            */
    } WT6_b;
  } ;

  union {
    __IOM uint32_t WTS0;                        /*!< GPIO Output Set 0 (31-0)                                                  */

    struct {
      __IOM uint32_t WTS0       : 32;           /*!< GPIO31-0 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS0_b;
  } ;

  union {
    __IOM uint32_t WTS1;                        /*!< GPIO Output Set 1 (63-32)                                                 */

    struct {
      __IOM uint32_t WTS1       : 32;           /*!< GPIO63-32 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS1_b;
  } ;

  union {
    __IOM uint32_t WTS2;                        /*!< GPIO Output Set 2 (95-64)                                                 */

    struct {
      __IOM uint32_t WTS2       : 32;           /*!< GPIO95-64 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS2_b;
  } ;

  union {
    __IOM uint32_t WTS3;                        /*!< GPIO Output Set 3 (127-96)                                                */

    struct {
      __IOM uint32_t WTS3       : 32;           /*!< GPIO127-96 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS3_b;
  } ;

  union {
    __IOM uint32_t WTS4;                        /*!< GPIO Output Set 4 (159-128)                                               */

    struct {
      __IOM uint32_t WTS4       : 32;           /*!< GPIO159-128 Sets pin state. Writing a 1 to any bit sets the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS4_b;
  } ;

  union {
    __IOM uint32_t WTS5;                        /*!< GPIO Output Set 5 (191-160)                                               */

    struct {
      __IOM uint32_t WTS5       : 32;           /*!< GPIO191-160 Sets pin state. Writing a 1 to any bit sets the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS5_b;
  } ;

  union {
    __IOM uint32_t WTS6;                        /*!< GPIO Output Set 6 (223-192)                                               */

    struct {
      __IOM uint32_t WTS6       : 32;           /*!< GPIO223-192 Sets pin state. Writing a 1 to any bit sets the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS6_b;
  } ;

  union {
    __IOM uint32_t WTC0;                        /*!< GPIO Output Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t WTC0       : 32;           /*!< GPIO31-0 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTC0_b;
  } ;

  union {
    __IOM uint32_t WTC1;                        /*!< GPIO Output Clear 1 (63-32)                                               */

