zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL27   : 4;            /*!< Function select for GPIO pin 27                                           */
      __IOM uint32_t INPEN27    : 1;            /*!< Input enable for GPIO 27                                                  */
      __IOM uint32_t RDZERO27   : 1;            /*!< Return 0 for read data on GPIO 27                                         */
      __IOM uint32_t IRPTEN27   : 2;            /*!< Interrupt enable for GPIO 27                                              */
      __IOM uint32_t OUTCFG27   : 2;            /*!< Pin IO mode selection for GPIO pin 27                                     */
      __IOM uint32_t DS27       : 2;            /*!< Drive strength selection for GPIO 27                                      */
      __IOM uint32_t SR27       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG27  : 3;            /*!< Pullup/Pulldown configuration for GPIO 27                                 */
      __IOM uint32_t NCESRC27   : 6;            /*!< IOMSTR/MSPI N Chip Select 27, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL27   : 1;            /*!< Polarity select for NCE for GPIO 27                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN27     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN27     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG27_b;
  } ;

  union {
    __IOM uint32_t PINCFG28;                    /*!< Controls the operation of GPIO pin 28.                                    */

    struct {
      __IOM uint32_t FNCSEL28   : 4;            /*!< Function select for GPIO pin 28                                           */
      __IOM uint32_t INPEN28    : 1;            /*!< Input enable for GPIO 28                                                  */
      __IOM uint32_t RDZERO28   : 1;            /*!< Return 0 for read data on GPIO 28                                         */
      __IOM uint32_t IRPTEN28   : 2;            /*!< Interrupt enable for GPIO 28                                              */
      __IOM uint32_t OUTCFG28   : 2;            /*!< Pin IO mode selection for GPIO pin 28                                     */
      __IOM uint32_t DS28       : 2;            /*!< Drive strength selection for GPIO 28                                      */
      __IOM uint32_t SR28       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG28  : 3;            /*!< Pullup/Pulldown configuration for GPIO 28                                 */
      __IOM uint32_t NCESRC28   : 6;            /*!< IOMSTR/MSPI N Chip Select 28, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL28   : 1;            /*!< Polarity select for NCE for GPIO 28                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN28     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN28     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG28_b;
  } ;

  union {
    __IOM uint32_t PINCFG29;                    /*!< Controls the operation of GPIO pin 29.                                    */

    struct {
      __IOM uint32_t FNCSEL29   : 4;            /*!< Function select for GPIO pin 29                                           */
      __IOM uint32_t INPEN29    : 1;            /*!< Input enable for GPIO 29                                                  */
      __IOM uint32_t RDZERO29   : 1;            /*!< Return 0 for read data on GPIO 29                                         */
      __IOM uint32_t IRPTEN29   : 2;            /*!< Interrupt enable for GPIO 29                                              */
      __IOM uint32_t OUTCFG29   : 2;            /*!< Pin IO mode selection for GPIO pin 29                                     */
      __IOM uint32_t DS29       : 2;            /*!< Drive strength selection for GPIO 29                                      */
      __IOM uint32_t SR29       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG29  : 3;            /*!< Pullup/Pulldown configuration for GPIO 29                                 */
      __IOM uint32_t NCESRC29   : 6;            /*!< IOMSTR/MSPI N Chip Select 29, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL29   : 1;            /*!< Polarity select for NCE for GPIO 29                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN29     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN29     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG29_b;
  } ;

  union {
    __IOM uint32_t PINCFG30;                    /*!< Controls the operation of GPIO pin 30.                                    */

