zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL30   : 4;            /*!< Function select for GPIO pin 30                                           */
      __IOM uint32_t INPEN30    : 1;            /*!< Input enable for GPIO 30                                                  */
      __IOM uint32_t RDZERO30   : 1;            /*!< Return 0 for read data on GPIO 30                                         */
      __IOM uint32_t IRPTEN30   : 2;            /*!< Interrupt enable for GPIO 30                                              */
      __IOM uint32_t OUTCFG30   : 2;            /*!< Pin IO mode selection for GPIO pin 30                                     */
      __IOM uint32_t DS30       : 2;            /*!< Drive strength selection for GPIO 30                                      */
      __IOM uint32_t SR30       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG30  : 3;            /*!< Pullup/Pulldown configuration for GPIO 30                                 */
      __IOM uint32_t NCESRC30   : 6;            /*!< IOMSTR/MSPI N Chip Select 30, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL30   : 1;            /*!< Polarity select for NCE for GPIO 30                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN30     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN30     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG30_b;
  } ;

  union {
    __IOM uint32_t PINCFG31;                    /*!< Controls the operation of GPIO pin 31.                                    */

    struct {
      __IOM uint32_t FNCSEL31   : 4;            /*!< Function select for GPIO pin 31                                           */
      __IOM uint32_t INPEN31    : 1;            /*!< Input enable for GPIO 31                                                  */
      __IOM uint32_t RDZERO31   : 1;            /*!< Return 0 for read data on GPIO 31                                         */
      __IOM uint32_t IRPTEN31   : 2;            /*!< Interrupt enable for GPIO 31                                              */
      __IOM uint32_t OUTCFG31   : 2;            /*!< Pin IO mode selection for GPIO pin 31                                     */
      __IOM uint32_t DS31       : 2;            /*!< Drive strength selection for GPIO 31                                      */
      __IOM uint32_t SR31       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG31  : 3;            /*!< Pullup/Pulldown configuration for GPIO 31                                 */
      __IOM uint32_t NCESRC31   : 6;            /*!< IOMSTR/MSPI N Chip Select 31, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL31   : 1;            /*!< Polarity select for NCE for GPIO 31                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN31     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN31     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG31_b;
  } ;

  union {
    __IOM uint32_t PINCFG32;                    /*!< Controls the operation of GPIO pin 32.                                    */

    struct {
      __IOM uint32_t FNCSEL32   : 4;            /*!< Function select for GPIO pin 32                                           */
      __IOM uint32_t INPEN32    : 1;            /*!< Input enable for GPIO 32                                                  */
      __IOM uint32_t RDZERO32   : 1;            /*!< Return 0 for read data on GPIO 32                                         */
      __IOM uint32_t IRPTEN32   : 2;            /*!< Interrupt enable for GPIO 32                                              */
      __IOM uint32_t OUTCFG32   : 2;            /*!< Pin IO mode selection for GPIO pin 32                                     */
      __IOM uint32_t DS32       : 2;            /*!< Drive strength selection for GPIO 32                                      */
      __IOM uint32_t SR32       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG32  : 3;            /*!< Pullup/Pulldown configuration for GPIO 32                                 */
      __IOM uint32_t NCESRC32   : 6;            /*!< IOMSTR/MSPI N Chip Select 32, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL32   : 1;            /*!< Polarity select for NCE for GPIO 32                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN32     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN32     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG32_b;
  } ;

  union {
    __IOM uint32_t PINCFG33;                    /*!< Controls the operation of GPIO pin 33.                                    */

