zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL42   : 4;            /*!< Function select for GPIO pin 42                                           */
      __IOM uint32_t INPEN42    : 1;            /*!< Input enable for GPIO 42                                                  */
      __IOM uint32_t RDZERO42   : 1;            /*!< Return 0 for read data on GPIO 42                                         */
      __IOM uint32_t IRPTEN42   : 2;            /*!< Interrupt enable for GPIO 42                                              */
      __IOM uint32_t OUTCFG42   : 2;            /*!< Pin IO mode selection for GPIO pin 42                                     */
      __IOM uint32_t DS42       : 2;            /*!< Drive strength selection for High Speed GPIO 42                           */
      __IOM uint32_t SR42       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG42  : 3;            /*!< Pullup/Pulldown configuration for GPIO 42                                 */
      __IOM uint32_t NCESRC42   : 6;            /*!< IOMSTR/MSPI N Chip Select 42, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL42   : 1;            /*!< Polarity select for NCE for GPIO 42                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN42     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN42     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG42_b;
  } ;

  union {
    __IOM uint32_t PINCFG43;                    /*!< Controls the operation of GPIO pin 43.                                    */

    struct {
      __IOM uint32_t FNCSEL43   : 4;            /*!< Function select for GPIO pin 43                                           */
      __IOM uint32_t INPEN43    : 1;            /*!< Input enable for GPIO 43                                                  */
      __IOM uint32_t RDZERO43   : 1;            /*!< Return 0 for read data on GPIO 43                                         */
      __IOM uint32_t IRPTEN43   : 2;            /*!< Interrupt enable for GPIO 43                                              */
      __IOM uint32_t OUTCFG43   : 2;            /*!< Pin IO mode selection for GPIO pin 43                                     */
      __IOM uint32_t DS43       : 2;            /*!< Drive strength selection for High Speed GPIO 43                           */
      __IOM uint32_t SR43       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG43  : 3;            /*!< Pullup/Pulldown configuration for GPIO 43                                 */
      __IOM uint32_t NCESRC43   : 6;            /*!< IOMSTR/MSPI N Chip Select 43, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL43   : 1;            /*!< Polarity select for NCE for GPIO 43                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN43     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN43     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG43_b;
  } ;

  union {
    __IOM uint32_t PINCFG44;                    /*!< Controls the operation of GPIO pin 44.                                    */

    struct {
      __IOM uint32_t FNCSEL44   : 4;            /*!< Function select for GPIO pin 44                                           */
      __IOM uint32_t INPEN44    : 1;            /*!< Input enable for GPIO 44                                                  */
      __IOM uint32_t RDZERO44   : 1;            /*!< Return 0 for read data on GPIO 44                                         */
      __IOM uint32_t IRPTEN44   : 2;            /*!< Interrupt enable for GPIO 44                                              */
      __IOM uint32_t OUTCFG44   : 2;            /*!< Pin IO mode selection for GPIO pin 44                                     */
      __IOM uint32_t DS44       : 2;            /*!< Drive strength selection for High Speed GPIO 44                           */
      __IOM uint32_t SR44       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG44  : 3;            /*!< Pullup/Pulldown configuration for GPIO 44                                 */
      __IOM uint32_t NCESRC44   : 6;            /*!< IOMSTR/MSPI N Chip Select 44, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL44   : 1;            /*!< Polarity select for NCE for GPIO 44                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN44     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN44     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG44_b;
  } ;

  union {
    __IOM uint32_t PINCFG45;                    /*!< Controls the operation of GPIO pin 45.                                    */

