zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL111  : 4;            /*!< Function select for GPIO pin 111                                          */
      __IOM uint32_t INPEN111   : 1;            /*!< Input enable for GPIO 111                                                 */
      __IOM uint32_t RDZERO111  : 1;            /*!< Return 0 for read data on GPIO 111                                        */
      __IOM uint32_t IRPTEN111  : 2;            /*!< Interrupt enable for GPIO 111                                             */
      __IOM uint32_t OUTCFG111  : 2;            /*!< Pin IO mode selection for GPIO pin 111                                    */
      __IOM uint32_t DS111      : 2;            /*!< Drive strength selection for High Speed GPIO 111                          */
      __IOM uint32_t SR111      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG111 : 3;            /*!< Pullup/Pulldown configuration for GPIO 111                                */
      __IOM uint32_t NCESRC111  : 6;            /*!< IOMSTR/MSPI N Chip Select 111, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL111  : 1;            /*!< Polarity select for NCE for GPIO 111                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN111    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN111    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG111_b;
  } ;

  union {
    __IOM uint32_t PINCFG112;                   /*!< Controls the operation of GPIO pin 112.                                   */

    struct {
      __IOM uint32_t FNCSEL112  : 4;            /*!< Function select for GPIO pin 112                                          */
      __IOM uint32_t INPEN112   : 1;            /*!< Input enable for GPIO 112                                                 */
      __IOM uint32_t RDZERO112  : 1;            /*!< Return 0 for read data on GPIO 112                                        */
      __IOM uint32_t IRPTEN112  : 2;            /*!< Interrupt enable for GPIO 112                                             */
      __IOM uint32_t OUTCFG112  : 2;            /*!< Pin IO mode selection for GPIO pin 112                                    */
      __IOM uint32_t DS112      : 2;            /*!< Drive strength selection for High Speed GPIO 112                          */
      __IOM uint32_t SR112      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG112 : 3;            /*!< Pullup/Pulldown configuration for GPIO 112                                */
      __IOM uint32_t NCESRC112  : 6;            /*!< IOMSTR/MSPI N Chip Select 112, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL112  : 1;            /*!< Polarity select for NCE for GPIO 112                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN112    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN112    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG112_b;
  } ;

  union {
    __IOM uint32_t PINCFG113;                   /*!< Controls the operation of GPIO pin 113.                                   */

    struct {
      __IOM uint32_t FNCSEL113  : 4;            /*!< Function select for GPIO pin 113                                          */
      __IOM uint32_t INPEN113   : 1;            /*!< Input enable for GPIO 113                                                 */
      __IOM uint32_t RDZERO113  : 1;            /*!< Return 0 for read data on GPIO 113                                        */
      __IOM uint32_t IRPTEN113  : 2;            /*!< Interrupt enable for GPIO 113                                             */
      __IOM uint32_t OUTCFG113  : 2;            /*!< Pin IO mode selection for GPIO pin 113                                    */
      __IOM uint32_t DS113      : 2;            /*!< Drive strength selection for High Speed GPIO 113                          */
      __IOM uint32_t SR113      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG113 : 3;            /*!< Pullup/Pulldown configuration for GPIO 113                                */
      __IOM uint32_t NCESRC113  : 6;            /*!< IOMSTR/MSPI N Chip Select 113, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL113  : 1;            /*!< Polarity select for NCE for GPIO 113                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN113    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN113    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG113_b;
  } ;

  union {
    __IOM uint32_t PINCFG114;                   /*!< Controls the operation of GPIO pin 114.                                   */

