zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL117  : 4;            /*!< Function select for GPIO pin 117                                          */
      __IOM uint32_t INPEN117   : 1;            /*!< Input enable for GPIO 117                                                 */
      __IOM uint32_t RDZERO117  : 1;            /*!< Return 0 for read data on GPIO 117                                        */
      __IOM uint32_t IRPTEN117  : 2;            /*!< Interrupt enable for GPIO 117                                             */
      __IOM uint32_t OUTCFG117  : 2;            /*!< Pin IO mode selection for GPIO pin 117                                    */
      __IOM uint32_t DS117      : 2;            /*!< Drive strength selection for High Speed GPIO 117                          */
      __IOM uint32_t SR117      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG117 : 3;            /*!< Pullup/Pulldown configuration for GPIO 117                                */
      __IOM uint32_t NCESRC117  : 6;            /*!< IOMSTR/MSPI N Chip Select 117, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL117  : 1;            /*!< Polarity select for NCE for GPIO 117                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN117    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN117    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG117_b;
  } ;

  union {
    __IOM uint32_t PINCFG118;                   /*!< Controls the operation of GPIO pin 118.                                   */

    struct {
      __IOM uint32_t FNCSEL118  : 4;            /*!< Function select for GPIO pin 118                                          */
      __IOM uint32_t INPEN118   : 1;            /*!< Input enable for GPIO 118                                                 */
      __IOM uint32_t RDZERO118  : 1;            /*!< Return 0 for read data on GPIO 118                                        */
      __IOM uint32_t IRPTEN118  : 2;            /*!< Interrupt enable for GPIO 118                                             */
      __IOM uint32_t OUTCFG118  : 2;            /*!< Pin IO mode selection for GPIO pin 118                                    */
      __IOM uint32_t DS118      : 2;            /*!< Drive strength selection for High Speed GPIO 118                          */
      __IOM uint32_t SR118      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG118 : 3;            /*!< Pullup/Pulldown configuration for GPIO 118                                */
      __IOM uint32_t NCESRC118  : 6;            /*!< IOMSTR/MSPI N Chip Select 118, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL118  : 1;            /*!< Polarity select for NCE for GPIO 118                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN118    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN118    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG118_b;
  } ;

  union {
    __IOM uint32_t PINCFG119;                   /*!< Controls the operation of GPIO pin 119.                                   */

    struct {
      __IOM uint32_t FNCSEL119  : 4;            /*!< Function select for GPIO pin 119                                          */
      __IOM uint32_t INPEN119   : 1;            /*!< Input enable for GPIO 119                                                 */
      __IOM uint32_t RDZERO119  : 1;            /*!< Return 0 for read data on GPIO 119                                        */
      __IOM uint32_t IRPTEN119  : 2;            /*!< Interrupt enable for GPIO 119                                             */
      __IOM uint32_t OUTCFG119  : 2;            /*!< Pin IO mode selection for GPIO pin 119                                    */
      __IOM uint32_t DS119      : 2;            /*!< Drive strength selection for High Speed GPIO 119                          */
      __IOM uint32_t SR119      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG119 : 3;            /*!< Pullup/Pulldown configuration for GPIO 119                                */
      __IOM uint32_t NCESRC119  : 6;            /*!< IOMSTR/MSPI N Chip Select 119, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL119  : 1;            /*!< Polarity select for NCE for GPIO 119                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN119    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN119    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG119_b;
  } ;

  union {
    __IOM uint32_t PINCFG120;                   /*!< Controls the operation of GPIO pin 120.                                   */

