zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL123  : 4;            /*!< Function select for GPIO pin 123                                          */
      __IOM uint32_t INPEN123   : 1;            /*!< Input enable for GPIO 123                                                 */
      __IOM uint32_t RDZERO123  : 1;            /*!< Return 0 for read data on GPIO 123                                        */
      __IOM uint32_t IRPTEN123  : 2;            /*!< Interrupt enable for GPIO 123                                             */
      __IOM uint32_t OUTCFG123  : 2;            /*!< Pin IO mode selection for GPIO pin 123                                    */
      __IOM uint32_t DS123      : 2;            /*!< Drive strength selection for High Speed GPIO 123                          */
      __IOM uint32_t SR123      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG123 : 3;            /*!< Pullup/Pulldown configuration for GPIO 123                                */
      __IOM uint32_t NCESRC123  : 6;            /*!< IOMSTR/MSPI N Chip Select 123, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL123  : 1;            /*!< Polarity select for NCE for GPIO 123                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN123    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN123    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG123_b;
  } ;

  union {
    __IOM uint32_t PINCFG124;                   /*!< Controls the operation of GPIO pin 124.                                   */

    struct {
      __IOM uint32_t FNCSEL124  : 4;            /*!< Function select for GPIO pin 124                                          */
      __IOM uint32_t INPEN124   : 1;            /*!< Input enable for GPIO 124                                                 */
      __IOM uint32_t RDZERO124  : 1;            /*!< Return 0 for read data on GPIO 124                                        */
      __IOM uint32_t IRPTEN124  : 2;            /*!< Interrupt enable for GPIO 124                                             */
      __IOM uint32_t OUTCFG124  : 2;            /*!< Pin IO mode selection for GPIO pin 124                                    */
      __IOM uint32_t DS124      : 2;            /*!< Drive strength selection for High Speed GPIO 124                          */
      __IOM uint32_t SR124      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG124 : 3;            /*!< Pullup/Pulldown configuration for GPIO 124                                */
      __IOM uint32_t NCESRC124  : 6;            /*!< IOMSTR/MSPI N Chip Select 124, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL124  : 1;            /*!< Polarity select for NCE for GPIO 124                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN124    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN124    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG124_b;
  } ;

  union {
    __IOM uint32_t PINCFG125;                   /*!< Controls the operation of GPIO pin 125.                                   */

    struct {
      __IOM uint32_t FNCSEL125  : 4;            /*!< Function select for GPIO pin 125                                          */
      __IOM uint32_t INPEN125   : 1;            /*!< Input enable for GPIO 125                                                 */
      __IOM uint32_t RDZERO125  : 1;            /*!< Return 0 for read data on GPIO 125                                        */
      __IOM uint32_t IRPTEN125  : 2;            /*!< Interrupt enable for GPIO 125                                             */
      __IOM uint32_t OUTCFG125  : 2;            /*!< Pin IO mode selection for GPIO pin 125                                    */
      __IOM uint32_t DS125      : 2;            /*!< Drive strength selection for GPIO 125                                     */
      __IOM uint32_t SR125      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG125 : 3;            /*!< Pullup/Pulldown configuration for GPIO 125                                */
      __IOM uint32_t NCESRC125  : 6;            /*!< IOMSTR/MSPI N Chip Select 125, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL125  : 1;            /*!< Polarity select for NCE for GPIO 125                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN125    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN125    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG125_b;
  } ;

  union {
    __IOM uint32_t PINCFG126;                   /*!< Controls the operation of GPIO pin 126.                                   */

