zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL126  : 4;            /*!< Function select for GPIO pin 126                                          */
      __IOM uint32_t INPEN126   : 1;            /*!< Input enable for GPIO 126                                                 */
      __IOM uint32_t RDZERO126  : 1;            /*!< Return 0 for read data on GPIO 126                                        */
      __IOM uint32_t IRPTEN126  : 2;            /*!< Interrupt enable for GPIO 126                                             */
      __IOM uint32_t OUTCFG126  : 2;            /*!< Pin IO mode selection for GPIO pin 126                                    */
      __IOM uint32_t DS126      : 2;            /*!< Drive strength selection for GPIO 126                                     */
      __IOM uint32_t SR126      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG126 : 3;            /*!< Pullup/Pulldown configuration for GPIO 126                                */
      __IOM uint32_t NCESRC126  : 6;            /*!< IOMSTR/MSPI N Chip Select 126, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL126  : 1;            /*!< Polarity select for NCE for GPIO 126                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN126    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN126    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG126_b;
  } ;

  union {
    __IOM uint32_t PINCFG127;                   /*!< Controls the operation of GPIO pin 127.                                   */

    struct {
      __IOM uint32_t FNCSEL127  : 4;            /*!< Function select for GPIO pin 127                                          */
      __IOM uint32_t INPEN127   : 1;            /*!< Input enable for GPIO 127                                                 */
      __IOM uint32_t RDZERO127  : 1;            /*!< Return 0 for read data on GPIO 127                                        */
      __IOM uint32_t IRPTEN127  : 2;            /*!< Interrupt enable for GPIO 127                                             */
      __IOM uint32_t OUTCFG127  : 2;            /*!< Pin IO mode selection for GPIO pin 127                                    */
      __IOM uint32_t DS127      : 2;            /*!< Drive strength selection for GPIO 127                                     */
      __IOM uint32_t SR127      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG127 : 3;            /*!< Pullup/Pulldown configuration for GPIO 127                                */
      __IOM uint32_t NCESRC127  : 6;            /*!< IOMSTR/MSPI N Chip Select 127, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL127  : 1;            /*!< Polarity select for NCE for GPIO 127                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN127    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN127    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG127_b;
  } ;

  union {
    __IOM uint32_t PINCFG128;                   /*!< Controls the operation of GPIO pin 128.                                   */

    struct {
      __IOM uint32_t FNCSEL128  : 4;            /*!< Function select for GPIO pin 128                                          */
      __IOM uint32_t INPEN128   : 1;            /*!< Input enable for GPIO 128                                                 */
      __IOM uint32_t RDZERO128  : 1;            /*!< Return 0 for read data on GPIO 128                                        */
      __IOM uint32_t IRPTEN128  : 2;            /*!< Interrupt enable for GPIO 128                                             */
      __IOM uint32_t OUTCFG128  : 2;            /*!< Pin IO mode selection for GPIO pin 128                                    */
      __IOM uint32_t DS128      : 2;            /*!< Drive strength selection for GPIO 128                                     */
      __IOM uint32_t SR128      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG128 : 3;            /*!< Pullup/Pulldown configuration for GPIO 128                                */
      __IOM uint32_t NCESRC128  : 6;            /*!< IOMSTR/MSPI N Chip Select 128, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL128  : 1;            /*!< Polarity select for NCE for GPIO 128                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN128    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN128    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG128_b;
  } ;

  union {
    __IOM uint32_t PINCFG129;                   /*!< Controls the operation of GPIO pin 129.                                   */

