zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL129  : 4;            /*!< Function select for GPIO pin 129                                          */
      __IOM uint32_t INPEN129   : 1;            /*!< Input enable for GPIO 129                                                 */
      __IOM uint32_t RDZERO129  : 1;            /*!< Return 0 for read data on GPIO 129                                        */
      __IOM uint32_t IRPTEN129  : 2;            /*!< Interrupt enable for GPIO 129                                             */
      __IOM uint32_t OUTCFG129  : 2;            /*!< Pin IO mode selection for GPIO pin 129                                    */
      __IOM uint32_t DS129      : 2;            /*!< Drive strength selection for GPIO 129                                     */
      __IOM uint32_t SR129      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG129 : 3;            /*!< Pullup/Pulldown configuration for GPIO 129                                */
      __IOM uint32_t NCESRC129  : 6;            /*!< IOMSTR/MSPI N Chip Select 129, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL129  : 1;            /*!< Polarity select for NCE for GPIO 129                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN129    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN129    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG129_b;
  } ;

  union {
    __IOM uint32_t PINCFG130;                   /*!< Controls the operation of GPIO pin 130.                                   */

    struct {
      __IOM uint32_t FNCSEL130  : 4;            /*!< Function select for GPIO pin 130                                          */
      __IOM uint32_t INPEN130   : 1;            /*!< Input enable for GPIO 130                                                 */
      __IOM uint32_t RDZERO130  : 1;            /*!< Return 0 for read data on GPIO 130                                        */
      __IOM uint32_t IRPTEN130  : 2;            /*!< Interrupt enable for GPIO 130                                             */
      __IOM uint32_t OUTCFG130  : 2;            /*!< Pin IO mode selection for GPIO pin 130                                    */
      __IOM uint32_t DS130      : 2;            /*!< Drive strength selection for GPIO 130                                     */
      __IOM uint32_t SR130      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG130 : 3;            /*!< Pullup/Pulldown configuration for GPIO 130                                */
      __IOM uint32_t NCESRC130  : 6;            /*!< IOMSTR/MSPI N Chip Select 130, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL130  : 1;            /*!< Polarity select for NCE for GPIO 130                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN130    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN130    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG130_b;
  } ;

  union {
    __IOM uint32_t PINCFG131;                   /*!< Controls the operation of GPIO pin 131.                                   */

    struct {
      __IOM uint32_t FNCSEL131  : 4;            /*!< Function select for GPIO pin 131                                          */
      __IOM uint32_t INPEN131   : 1;            /*!< Input enable for GPIO 131                                                 */
      __IOM uint32_t RDZERO131  : 1;            /*!< Return 0 for read data on GPIO 131                                        */
      __IOM uint32_t IRPTEN131  : 2;            /*!< Interrupt enable for GPIO 131                                             */
      __IOM uint32_t OUTCFG131  : 2;            /*!< Pin IO mode selection for GPIO pin 131                                    */
      __IOM uint32_t DS131      : 2;            /*!< Drive strength selection for GPIO 131                                     */
      __IOM uint32_t SR131      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG131 : 3;            /*!< Pullup/Pulldown configuration for GPIO 131                                */
      __IOM uint32_t NCESRC131  : 6;            /*!< IOMSTR/MSPI N Chip Select 131, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL131  : 1;            /*!< Polarity select for NCE for GPIO 131                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN131    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN131    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG131_b;
  } ;

  union {
    __IOM uint32_t PINCFG132;                   /*!< Controls the operation of GPIO pin 132.                                   */

