zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL135  : 4;            /*!< Function select for GPIO pin 135                                          */
      __IOM uint32_t INPEN135   : 1;            /*!< Input enable for GPIO 135                                                 */
      __IOM uint32_t RDZERO135  : 1;            /*!< Return 0 for read data on GPIO 135                                        */
      __IOM uint32_t IRPTEN135  : 2;            /*!< Interrupt enable for GPIO 135                                             */
      __IOM uint32_t OUTCFG135  : 2;            /*!< Pin IO mode selection for GPIO pin 135                                    */
      __IOM uint32_t DS135      : 2;            /*!< Drive strength selection for GPIO 135                                     */
      __IOM uint32_t SR135      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG135 : 3;            /*!< Pullup/Pulldown configuration for GPIO 135                                */
      __IOM uint32_t NCESRC135  : 6;            /*!< IOMSTR/MSPI N Chip Select 135, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL135  : 1;            /*!< Polarity select for NCE for GPIO 135                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN135    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN135    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG135_b;
  } ;

  union {
    __IOM uint32_t PINCFG136;                   /*!< Controls the operation of GPIO pin 136.                                   */

    struct {
      __IOM uint32_t FNCSEL136  : 4;            /*!< Function select for GPIO pin 136                                          */
      __IOM uint32_t INPEN136   : 1;            /*!< Input enable for GPIO 136                                                 */
      __IOM uint32_t RDZERO136  : 1;            /*!< Return 0 for read data on GPIO 136                                        */
      __IOM uint32_t IRPTEN136  : 2;            /*!< Interrupt enable for GPIO 136                                             */
      __IOM uint32_t OUTCFG136  : 2;            /*!< Pin IO mode selection for GPIO pin 136                                    */
      __IOM uint32_t DS136      : 2;            /*!< Drive strength selection for GPIO 136                                     */
      __IOM uint32_t SR136      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG136 : 3;            /*!< Pullup/Pulldown configuration for GPIO 136                                */
      __IOM uint32_t NCESRC136  : 6;            /*!< IOMSTR/MSPI N Chip Select 136, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL136  : 1;            /*!< Polarity select for NCE for GPIO 136                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN136    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN136    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG136_b;
  } ;

  union {
    __IOM uint32_t PINCFG137;                   /*!< Controls the operation of GPIO pin 137.                                   */

    struct {
      __IOM uint32_t FNCSEL137  : 4;            /*!< Function select for GPIO pin 137                                          */
      __IOM uint32_t INPEN137   : 1;            /*!< Input enable for GPIO 137                                                 */
      __IOM uint32_t RDZERO137  : 1;            /*!< Return 0 for read data on GPIO 137                                        */
      __IOM uint32_t IRPTEN137  : 2;            /*!< Interrupt enable for GPIO 137                                             */
      __IOM uint32_t OUTCFG137  : 2;            /*!< Pin IO mode selection for GPIO pin 137                                    */
      __IOM uint32_t DS137      : 2;            /*!< Drive strength selection for GPIO 137                                     */
      __IOM uint32_t SR137      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG137 : 3;            /*!< Pullup/Pulldown configuration for GPIO 137                                */
      __IOM uint32_t NCESRC137  : 6;            /*!< IOMSTR/MSPI N Chip Select 137, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL137  : 1;            /*!< Polarity select for NCE for GPIO 137                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN137    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN137    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG137_b;
  } ;

  union {
    __IOM uint32_t PINCFG138;                   /*!< Controls the operation of GPIO pin 138.                                   */

