zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL138  : 4;            /*!< Function select for GPIO pin 138                                          */
      __IOM uint32_t INPEN138   : 1;            /*!< Input enable for GPIO 138                                                 */
      __IOM uint32_t RDZERO138  : 1;            /*!< Return 0 for read data on GPIO 138                                        */
      __IOM uint32_t IRPTEN138  : 2;            /*!< Interrupt enable for GPIO 138                                             */
      __IOM uint32_t OUTCFG138  : 2;            /*!< Pin IO mode selection for GPIO pin 138                                    */
      __IOM uint32_t DS138      : 2;            /*!< Drive strength selection for GPIO 138                                     */
      __IOM uint32_t SR138      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG138 : 3;            /*!< Pullup/Pulldown configuration for GPIO 138                                */
      __IOM uint32_t NCESRC138  : 6;            /*!< IOMSTR/MSPI N Chip Select 138, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL138  : 1;            /*!< Polarity select for NCE for GPIO 138                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN138    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN138    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG138_b;
  } ;

  union {
    __IOM uint32_t PINCFG139;                   /*!< Controls the operation of GPIO pin 139.                                   */

    struct {
      __IOM uint32_t FNCSEL139  : 4;            /*!< Function select for GPIO pin 139                                          */
      __IOM uint32_t INPEN139   : 1;            /*!< Input enable for GPIO 139                                                 */
      __IOM uint32_t RDZERO139  : 1;            /*!< Return 0 for read data on GPIO 139                                        */
      __IOM uint32_t IRPTEN139  : 2;            /*!< Interrupt enable for GPIO 139                                             */
      __IOM uint32_t OUTCFG139  : 2;            /*!< Pin IO mode selection for GPIO pin 139                                    */
      __IOM uint32_t DS139      : 2;            /*!< Drive strength selection for GPIO 139                                     */
      __IOM uint32_t SR139      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG139 : 3;            /*!< Pullup/Pulldown configuration for GPIO 139                                */
      __IOM uint32_t NCESRC139  : 6;            /*!< IOMSTR/MSPI N Chip Select 139, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL139  : 1;            /*!< Polarity select for NCE for GPIO 139                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN139    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN139    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG139_b;
  } ;

  union {
    __IOM uint32_t PINCFG140;                   /*!< Controls the operation of GPIO pin 140.                                   */

    struct {
      __IOM uint32_t FNCSEL140  : 4;            /*!< Function select for GPIO pin 140                                          */
      __IOM uint32_t INPEN140   : 1;            /*!< Input enable for GPIO 140                                                 */
      __IOM uint32_t RDZERO140  : 1;            /*!< Return 0 for read data on GPIO 140                                        */
      __IOM uint32_t IRPTEN140  : 2;            /*!< Interrupt enable for GPIO 140                                             */
      __IOM uint32_t OUTCFG140  : 2;            /*!< Pin IO mode selection for GPIO pin 140                                    */
      __IOM uint32_t DS140      : 2;            /*!< Drive strength selection for GPIO 140                                     */
      __IOM uint32_t SR140      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG140 : 3;            /*!< Pullup/Pulldown configuration for GPIO 140                                */
      __IOM uint32_t NCESRC140  : 6;            /*!< IOMSTR/MSPI N Chip Select 140, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL140  : 1;            /*!< Polarity select for NCE for GPIO 140                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN140    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN140    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG140_b;
  } ;

  union {
    __IOM uint32_t PINCFG141;                   /*!< Controls the operation of GPIO pin 141.                                   */

