zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL141  : 4;            /*!< Function select for GPIO pin 141                                          */
      __IOM uint32_t INPEN141   : 1;            /*!< Input enable for GPIO 141                                                 */
      __IOM uint32_t RDZERO141  : 1;            /*!< Return 0 for read data on GPIO 141                                        */
      __IOM uint32_t IRPTEN141  : 2;            /*!< Interrupt enable for GPIO 141                                             */
      __IOM uint32_t OUTCFG141  : 2;            /*!< Pin IO mode selection for GPIO pin 141                                    */
      __IOM uint32_t DS141      : 2;            /*!< Drive strength selection for GPIO 141                                     */
      __IOM uint32_t SR141      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG141 : 3;            /*!< Pullup/Pulldown configuration for GPIO 141                                */
      __IOM uint32_t NCESRC141  : 6;            /*!< IOMSTR/MSPI N Chip Select 141, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL141  : 1;            /*!< Polarity select for NCE for GPIO 141                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN141    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN141    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG141_b;
  } ;

  union {
    __IOM uint32_t PINCFG142;                   /*!< Controls the operation of GPIO pin 142.                                   */

    struct {
      __IOM uint32_t FNCSEL142  : 4;            /*!< Function select for GPIO pin 142                                          */
      __IOM uint32_t INPEN142   : 1;            /*!< Input enable for GPIO 142                                                 */
      __IOM uint32_t RDZERO142  : 1;            /*!< Return 0 for read data on GPIO 142                                        */
      __IOM uint32_t IRPTEN142  : 2;            /*!< Interrupt enable for GPIO 142                                             */
      __IOM uint32_t OUTCFG142  : 2;            /*!< Pin IO mode selection for GPIO pin 142                                    */
      __IOM uint32_t DS142      : 2;            /*!< Drive strength selection for High Speed GPIO 142                          */
      __IOM uint32_t SR142      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG142 : 3;            /*!< Pullup/Pulldown configuration for GPIO 142                                */
      __IOM uint32_t NCESRC142  : 6;            /*!< IOMSTR/MSPI N Chip Select 142, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL142  : 1;            /*!< Polarity select for NCE for GPIO 142                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN142    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN142    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG142_b;
  } ;

  union {
    __IOM uint32_t PINCFG143;                   /*!< Controls the operation of GPIO pin 143.                                   */

    struct {
      __IOM uint32_t FNCSEL143  : 4;            /*!< Function select for GPIO pin 143                                          */
      __IOM uint32_t INPEN143   : 1;            /*!< Input enable for GPIO 143                                                 */
      __IOM uint32_t RDZERO143  : 1;            /*!< Return 0 for read data on GPIO 143                                        */
      __IOM uint32_t IRPTEN143  : 2;            /*!< Interrupt enable for GPIO 143                                             */
      __IOM uint32_t OUTCFG143  : 2;            /*!< Pin IO mode selection for GPIO pin 143                                    */
      __IOM uint32_t DS143      : 2;            /*!< Drive strength selection for High Speed GPIO 143                          */
      __IOM uint32_t SR143      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG143 : 3;            /*!< Pullup/Pulldown configuration for GPIO 143                                */
      __IOM uint32_t NCESRC143  : 6;            /*!< IOMSTR/MSPI N Chip Select 143, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL143  : 1;            /*!< Polarity select for NCE for GPIO 143                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN143    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN143    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG143_b;
  } ;

  union {
    __IOM uint32_t PINCFG144;                   /*!< Controls the operation of GPIO pin 144.                                   */

