zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL156  : 4;            /*!< Function select for GPIO pin 156                                          */
      __IOM uint32_t INPEN156   : 1;            /*!< Input enable for GPIO 156                                                 */
      __IOM uint32_t RDZERO156  : 1;            /*!< Return 0 for read data on GPIO 156                                        */
      __IOM uint32_t IRPTEN156  : 2;            /*!< Interrupt enable for GPIO 156                                             */
      __IOM uint32_t OUTCFG156  : 2;            /*!< Pin IO mode selection for GPIO pin 156                                    */
      __IOM uint32_t DS156      : 2;            /*!< Drive strength selection for GPIO 156                                     */
      __IOM uint32_t SR156      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG156 : 3;            /*!< Pullup/Pulldown configuration for GPIO 156                                */
      __IOM uint32_t NCESRC156  : 6;            /*!< IOMSTR/MSPI N Chip Select 156, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL156  : 1;            /*!< Polarity select for NCE for GPIO 156                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN156    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN156    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG156_b;
  } ;

  union {
    __IOM uint32_t PINCFG157;                   /*!< Controls the operation of GPIO pin 157.                                   */

    struct {
      __IOM uint32_t FNCSEL157  : 4;            /*!< Function select for GPIO pin 157                                          */
      __IOM uint32_t INPEN157   : 1;            /*!< Input enable for GPIO 157                                                 */
      __IOM uint32_t RDZERO157  : 1;            /*!< Return 0 for read data on GPIO 157                                        */
      __IOM uint32_t IRPTEN157  : 2;            /*!< Interrupt enable for GPIO 157                                             */
      __IOM uint32_t OUTCFG157  : 2;            /*!< Pin IO mode selection for GPIO pin 157                                    */
      __IOM uint32_t DS157      : 2;            /*!< Drive strength selection for GPIO 157                                     */
      __IOM uint32_t SR157      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG157 : 3;            /*!< Pullup/Pulldown configuration for GPIO 157                                */
      __IOM uint32_t NCESRC157  : 6;            /*!< IOMSTR/MSPI N Chip Select 157, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL157  : 1;            /*!< Polarity select for NCE for GPIO 157                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN157    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN157    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG157_b;
  } ;

  union {
    __IOM uint32_t PINCFG158;                   /*!< Controls the operation of GPIO pin 158.                                   */

    struct {
      __IOM uint32_t FNCSEL158  : 4;            /*!< Function select for GPIO pin 158                                          */
      __IOM uint32_t INPEN158   : 1;            /*!< Input enable for GPIO 158                                                 */
      __IOM uint32_t RDZERO158  : 1;            /*!< Return 0 for read data on GPIO 158                                        */
      __IOM uint32_t IRPTEN158  : 2;            /*!< Interrupt enable for GPIO 158                                             */
      __IOM uint32_t OUTCFG158  : 2;            /*!< Pin IO mode selection for GPIO pin 158                                    */
      __IOM uint32_t DS158      : 2;            /*!< Drive strength selection for GPIO 158                                     */
      __IOM uint32_t SR158      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG158 : 3;            /*!< Pullup/Pulldown configuration for GPIO 158                                */
      __IOM uint32_t NCESRC158  : 6;            /*!< IOMSTR/MSPI N Chip Select 158, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL158  : 1;            /*!< Polarity select for NCE for GPIO 158                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN158    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN158    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG158_b;
  } ;

  union {
    __IOM uint32_t PINCFG159;                   /*!< Controls the operation of GPIO pin 159.                                   */

