zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL159  : 4;            /*!< Function select for GPIO pin 159                                          */
      __IOM uint32_t INPEN159   : 1;            /*!< Input enable for GPIO 159                                                 */
      __IOM uint32_t RDZERO159  : 1;            /*!< Return 0 for read data on GPIO 159                                        */
      __IOM uint32_t IRPTEN159  : 2;            /*!< Interrupt enable for GPIO 159                                             */
      __IOM uint32_t OUTCFG159  : 2;            /*!< Pin IO mode selection for GPIO pin 159                                    */
      __IOM uint32_t DS159      : 2;            /*!< Drive strength selection for GPIO 159                                     */
      __IOM uint32_t SR159      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG159 : 3;            /*!< Pullup/Pulldown configuration for GPIO 159                                */
      __IOM uint32_t NCESRC159  : 6;            /*!< IOMSTR/MSPI N Chip Select 159, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL159  : 1;            /*!< Polarity select for NCE for GPIO 159                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN159    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN159    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG159_b;
  } ;

  union {
    __IOM uint32_t PINCFG160;                   /*!< Controls the operation of GPIO pin 160.                                   */

    struct {
      __IOM uint32_t FNCSEL160  : 4;            /*!< Function select for GPIO pin 160                                          */
      __IOM uint32_t INPEN160   : 1;            /*!< Input enable for GPIO 160                                                 */
      __IOM uint32_t RDZERO160  : 1;            /*!< Return 0 for read data on GPIO 160                                        */
      __IOM uint32_t IRPTEN160  : 2;            /*!< Interrupt enable for GPIO 160                                             */
      __IOM uint32_t OUTCFG160  : 2;            /*!< Pin IO mode selection for GPIO pin 160                                    */
      __IOM uint32_t DS160      : 2;            /*!< Drive strength selection for GPIO 160                                     */
      __IOM uint32_t SR160      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG160 : 3;            /*!< Pullup/Pulldown configuration for GPIO 160                                */
      __IOM uint32_t NCESRC160  : 6;            /*!< IOMSTR/MSPI N Chip Select 160, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL160  : 1;            /*!< Polarity select for NCE for GPIO 160                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN160    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN160    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG160_b;
  } ;

  union {
    __IOM uint32_t PINCFG161;                   /*!< Controls the operation of GPIO pin 161.                                   */

    struct {
      __IOM uint32_t FNCSEL161  : 4;            /*!< Function select for GPIO pin 161                                          */
      __IOM uint32_t INPEN161   : 1;            /*!< Input enable for GPIO 161                                                 */
      __IOM uint32_t RDZERO161  : 1;            /*!< Return 0 for read data on GPIO 161                                        */
      __IOM uint32_t IRPTEN161  : 2;            /*!< Interrupt enable for GPIO 161                                             */
      __IOM uint32_t OUTCFG161  : 2;            /*!< Pin IO mode selection for GPIO pin 161                                    */
      __IOM uint32_t DS161      : 2;            /*!< Drive strength selection for GPIO 161                                     */
      __IOM uint32_t SR161      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG161 : 3;            /*!< Pullup/Pulldown configuration for GPIO 161                                */
      __IOM uint32_t NCESRC161  : 6;            /*!< IOMSTR/MSPI N Chip Select 161, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL161  : 1;            /*!< Polarity select for NCE for GPIO 161                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN161    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN161    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG161_b;
  } ;

  union {
    __IOM uint32_t PINCFG162;                   /*!< Controls the operation of GPIO pin 162.                                   */

