zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL168  : 4;            /*!< Function select for GPIO pin 168                                          */
      __IOM uint32_t INPEN168   : 1;            /*!< Input enable for GPIO 168                                                 */
      __IOM uint32_t RDZERO168  : 1;            /*!< Return 0 for read data on GPIO 168                                        */
      __IOM uint32_t IRPTEN168  : 2;            /*!< Interrupt enable for GPIO 168                                             */
      __IOM uint32_t OUTCFG168  : 2;            /*!< Pin IO mode selection for GPIO pin 168                                    */
      __IOM uint32_t DS168      : 2;            /*!< Drive strength selection for GPIO 168                                     */
      __IOM uint32_t SR168      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG168 : 3;            /*!< Pullup/Pulldown configuration for GPIO 168                                */
      __IOM uint32_t NCESRC168  : 6;            /*!< IOMSTR/MSPI N Chip Select 168, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL168  : 1;            /*!< Polarity select for NCE for GPIO 168                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN168    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN168    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG168_b;
  } ;

  union {
    __IOM uint32_t PINCFG169;                   /*!< Controls the operation of GPIO pin 169.                                   */

    struct {
      __IOM uint32_t FNCSEL169  : 4;            /*!< Function select for GPIO pin 169                                          */
      __IOM uint32_t INPEN169   : 1;            /*!< Input enable for GPIO 169                                                 */
      __IOM uint32_t RDZERO169  : 1;            /*!< Return 0 for read data on GPIO 169                                        */
      __IOM uint32_t IRPTEN169  : 2;            /*!< Interrupt enable for GPIO 169                                             */
      __IOM uint32_t OUTCFG169  : 2;            /*!< Pin IO mode selection for GPIO pin 169                                    */
      __IOM uint32_t DS169      : 2;            /*!< Drive strength selection for GPIO 169                                     */
      __IOM uint32_t SR169      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG169 : 3;            /*!< Pullup/Pulldown configuration for GPIO 169                                */
      __IOM uint32_t NCESRC169  : 6;            /*!< IOMSTR/MSPI N Chip Select 169, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL169  : 1;            /*!< Polarity select for NCE for GPIO 169                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN169    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN169    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG169_b;
  } ;

  union {
    __IOM uint32_t PINCFG170;                   /*!< Controls the operation of GPIO pin 170.                                   */

    struct {
      __IOM uint32_t FNCSEL170  : 4;            /*!< Function select for GPIO pin 170                                          */
      __IOM uint32_t INPEN170   : 1;            /*!< Input enable for GPIO 170                                                 */
      __IOM uint32_t RDZERO170  : 1;            /*!< Return 0 for read data on GPIO 170                                        */
      __IOM uint32_t IRPTEN170  : 2;            /*!< Interrupt enable for GPIO 170                                             */
      __IOM uint32_t OUTCFG170  : 2;            /*!< Pin IO mode selection for GPIO pin 170                                    */
      __IOM uint32_t DS170      : 2;            /*!< Drive strength selection for GPIO 170                                     */
      __IOM uint32_t SR170      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG170 : 3;            /*!< Pullup/Pulldown configuration for GPIO 170                                */
      __IOM uint32_t NCESRC170  : 6;            /*!< IOMSTR/MSPI N Chip Select 170, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL170  : 1;            /*!< Polarity select for NCE for GPIO 170                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN170    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN170    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG170_b;
  } ;

  union {
    __IOM uint32_t PINCFG171;                   /*!< Controls the operation of GPIO pin 171.                                   */

