zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL171  : 4;            /*!< Function select for GPIO pin 171                                          */
      __IOM uint32_t INPEN171   : 1;            /*!< Input enable for GPIO 171                                                 */
      __IOM uint32_t RDZERO171  : 1;            /*!< Return 0 for read data on GPIO 171                                        */
      __IOM uint32_t IRPTEN171  : 2;            /*!< Interrupt enable for GPIO 171                                             */
      __IOM uint32_t OUTCFG171  : 2;            /*!< Pin IO mode selection for GPIO pin 171                                    */
      __IOM uint32_t DS171      : 2;            /*!< Drive strength selection for GPIO 171                                     */
      __IOM uint32_t SR171      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG171 : 3;            /*!< Pullup/Pulldown configuration for GPIO 171                                */
      __IOM uint32_t NCESRC171  : 6;            /*!< IOMSTR/MSPI N Chip Select 171, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL171  : 1;            /*!< Polarity select for NCE for GPIO 171                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN171    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN171    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG171_b;
  } ;

  union {
    __IOM uint32_t PINCFG172;                   /*!< Controls the operation of GPIO pin 172.                                   */

    struct {
      __IOM uint32_t FNCSEL172  : 4;            /*!< Function select for GPIO pin 172                                          */
      __IOM uint32_t INPEN172   : 1;            /*!< Input enable for GPIO 172                                                 */
      __IOM uint32_t RDZERO172  : 1;            /*!< Return 0 for read data on GPIO 172                                        */
      __IOM uint32_t IRPTEN172  : 2;            /*!< Interrupt enable for GPIO 172                                             */
      __IOM uint32_t OUTCFG172  : 2;            /*!< Pin IO mode selection for GPIO pin 172                                    */
      __IOM uint32_t DS172      : 2;            /*!< Drive strength selection for GPIO 172                                     */
      __IOM uint32_t SR172      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG172 : 3;            /*!< Pullup/Pulldown configuration for GPIO 172                                */
      __IOM uint32_t NCESRC172  : 6;            /*!< IOMSTR/MSPI N Chip Select 172, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL172  : 1;            /*!< Polarity select for NCE for GPIO 172                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN172    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN172    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG172_b;
  } ;

  union {
    __IOM uint32_t PINCFG173;                   /*!< Controls the operation of GPIO pin 173.                                   */

    struct {
      __IOM uint32_t FNCSEL173  : 4;            /*!< Function select for GPIO pin 173                                          */
      __IOM uint32_t INPEN173   : 1;            /*!< Input enable for GPIO 173                                                 */
      __IOM uint32_t RDZERO173  : 1;            /*!< Return 0 for read data on GPIO 173                                        */
      __IOM uint32_t IRPTEN173  : 2;            /*!< Interrupt enable for GPIO 173                                             */
      __IOM uint32_t OUTCFG173  : 2;            /*!< Pin IO mode selection for GPIO pin 173                                    */
      __IOM uint32_t DS173      : 2;            /*!< Drive strength selection for GPIO 173                                     */
      __IOM uint32_t SR173      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG173 : 3;            /*!< Pullup/Pulldown configuration for GPIO 173                                */
      __IOM uint32_t NCESRC173  : 6;            /*!< IOMSTR/MSPI N Chip Select 173, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL173  : 1;            /*!< Polarity select for NCE for GPIO 173                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN173    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN173    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG173_b;
  } ;

  union {
    __IOM uint32_t PINCFG174;                   /*!< Controls the operation of GPIO pin 174.                                   */

