zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL180  : 4;            /*!< Function select for GPIO pin 180                                          */
      __IOM uint32_t INPEN180   : 1;            /*!< Input enable for GPIO 180                                                 */
      __IOM uint32_t RDZERO180  : 1;            /*!< Return 0 for read data on GPIO 180                                        */
      __IOM uint32_t IRPTEN180  : 2;            /*!< Interrupt enable for GPIO 180                                             */
      __IOM uint32_t OUTCFG180  : 2;            /*!< Pin IO mode selection for GPIO pin 180                                    */
      __IOM uint32_t DS180      : 2;            /*!< Drive strength selection for GPIO 180                                     */
      __IOM uint32_t SR180      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG180 : 3;            /*!< Pullup/Pulldown configuration for GPIO 180                                */
      __IOM uint32_t NCESRC180  : 6;            /*!< IOMSTR/MSPI N Chip Select 180, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL180  : 1;            /*!< Polarity select for NCE for GPIO 180                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN180    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN180    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG180_b;
  } ;

  union {
    __IOM uint32_t PINCFG181;                   /*!< Controls the operation of GPIO pin 181.                                   */

    struct {
      __IOM uint32_t FNCSEL181  : 4;            /*!< Function select for GPIO pin 181                                          */
      __IOM uint32_t INPEN181   : 1;            /*!< Input enable for GPIO 181                                                 */
      __IOM uint32_t RDZERO181  : 1;            /*!< Return 0 for read data on GPIO 181                                        */
      __IOM uint32_t IRPTEN181  : 2;            /*!< Interrupt enable for GPIO 181                                             */
      __IOM uint32_t OUTCFG181  : 2;            /*!< Pin IO mode selection for GPIO pin 181                                    */
      __IOM uint32_t DS181      : 2;            /*!< Drive strength selection for GPIO 181                                     */
      __IOM uint32_t SR181      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG181 : 3;            /*!< Pullup/Pulldown configuration for GPIO 181                                */
      __IOM uint32_t NCESRC181  : 6;            /*!< IOMSTR/MSPI N Chip Select 181, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL181  : 1;            /*!< Polarity select for NCE for GPIO 181                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN181    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN181    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG181_b;
  } ;

  union {
    __IOM uint32_t PINCFG182;                   /*!< Controls the operation of GPIO pin 182.                                   */

    struct {
      __IOM uint32_t FNCSEL182  : 4;            /*!< Function select for GPIO pin 182                                          */
      __IOM uint32_t INPEN182   : 1;            /*!< Input enable for GPIO 182                                                 */
      __IOM uint32_t RDZERO182  : 1;            /*!< Return 0 for read data on GPIO 182                                        */
      __IOM uint32_t IRPTEN182  : 2;            /*!< Interrupt enable for GPIO 182                                             */
      __IOM uint32_t OUTCFG182  : 2;            /*!< Pin IO mode selection for GPIO pin 182                                    */
      __IOM uint32_t DS182      : 2;            /*!< Drive strength selection for GPIO 182                                     */
      __IOM uint32_t SR182      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG182 : 3;            /*!< Pullup/Pulldown configuration for GPIO 182                                */
      __IOM uint32_t NCESRC182  : 6;            /*!< IOMSTR/MSPI N Chip Select 182, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL182  : 1;            /*!< Polarity select for NCE for GPIO 182                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN182    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN182    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG182_b;
  } ;

  union {
    __IOM uint32_t PINCFG183;                   /*!< Controls the operation of GPIO pin 183.                                   */

