zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL183  : 4;            /*!< Function select for GPIO pin 183                                          */
      __IOM uint32_t INPEN183   : 1;            /*!< Input enable for GPIO 183                                                 */
      __IOM uint32_t RDZERO183  : 1;            /*!< Return 0 for read data on GPIO 183                                        */
      __IOM uint32_t IRPTEN183  : 2;            /*!< Interrupt enable for GPIO 183                                             */
      __IOM uint32_t OUTCFG183  : 2;            /*!< Pin IO mode selection for GPIO pin 183                                    */
      __IOM uint32_t DS183      : 2;            /*!< Drive strength selection for GPIO 183                                     */
      __IOM uint32_t SR183      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG183 : 3;            /*!< Pullup/Pulldown configuration for GPIO 183                                */
      __IOM uint32_t NCESRC183  : 6;            /*!< IOMSTR/MSPI N Chip Select 183, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL183  : 1;            /*!< Polarity select for NCE for GPIO 183                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN183    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN183    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG183_b;
  } ;

  union {
    __IOM uint32_t PINCFG184;                   /*!< Controls the operation of GPIO pin 184.                                   */

    struct {
      __IOM uint32_t FNCSEL184  : 4;            /*!< Function select for GPIO pin 184                                          */
      __IOM uint32_t INPEN184   : 1;            /*!< Input enable for GPIO 184                                                 */
      __IOM uint32_t RDZERO184  : 1;            /*!< Return 0 for read data on GPIO 184                                        */
      __IOM uint32_t IRPTEN184  : 2;            /*!< Interrupt enable for GPIO 184                                             */
      __IOM uint32_t OUTCFG184  : 2;            /*!< Pin IO mode selection for GPIO pin 184                                    */
      __IOM uint32_t DS184      : 2;            /*!< Drive strength selection for GPIO 184                                     */
      __IOM uint32_t SR184      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG184 : 3;            /*!< Pullup/Pulldown configuration for GPIO 184                                */
      __IOM uint32_t NCESRC184  : 6;            /*!< IOMSTR/MSPI N Chip Select 184, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL184  : 1;            /*!< Polarity select for NCE for GPIO 184                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN184    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN184    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG184_b;
  } ;

  union {
    __IOM uint32_t PINCFG185;                   /*!< Controls the operation of GPIO pin 185.                                   */

    struct {
      __IOM uint32_t FNCSEL185  : 4;            /*!< Function select for GPIO pin 185                                          */
      __IOM uint32_t INPEN185   : 1;            /*!< Input enable for GPIO 185                                                 */
      __IOM uint32_t RDZERO185  : 1;            /*!< Return 0 for read data on GPIO 185                                        */
      __IOM uint32_t IRPTEN185  : 2;            /*!< Interrupt enable for GPIO 185                                             */
      __IOM uint32_t OUTCFG185  : 2;            /*!< Pin IO mode selection for GPIO pin 185                                    */
      __IOM uint32_t DS185      : 2;            /*!< Drive strength selection for GPIO 185                                     */
      __IOM uint32_t SR185      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG185 : 3;            /*!< Pullup/Pulldown configuration for GPIO 185                                */
      __IOM uint32_t NCESRC185  : 6;            /*!< IOMSTR/MSPI N Chip Select 185, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL185  : 1;            /*!< Polarity select for NCE for GPIO 185                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN185    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN185    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG185_b;
  } ;

  union {
    __IOM uint32_t PINCFG186;                   /*!< Controls the operation of GPIO pin 186.                                   */

