zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL189  : 4;            /*!< Function select for GPIO pin 189                                          */
      __IOM uint32_t INPEN189   : 1;            /*!< Input enable for GPIO 189                                                 */
      __IOM uint32_t RDZERO189  : 1;            /*!< Return 0 for read data on GPIO 189                                        */
      __IOM uint32_t IRPTEN189  : 2;            /*!< Interrupt enable for GPIO 189                                             */
      __IOM uint32_t OUTCFG189  : 2;            /*!< Pin IO mode selection for GPIO pin 189                                    */
      __IOM uint32_t DS189      : 2;            /*!< Drive strength selection for GPIO 189                                     */
      __IOM uint32_t SR189      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG189 : 3;            /*!< Pullup/Pulldown configuration for GPIO 189                                */
      __IOM uint32_t NCESRC189  : 6;            /*!< IOMSTR/MSPI N Chip Select 189, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL189  : 1;            /*!< Polarity select for NCE for GPIO 189                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN189    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN189    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG189_b;
  } ;

  union {
    __IOM uint32_t PINCFG190;                   /*!< Controls the operation of GPIO pin 190.                                   */

    struct {
      __IOM uint32_t FNCSEL190  : 4;            /*!< Function select for GPIO pin 190                                          */
      __IOM uint32_t INPEN190   : 1;            /*!< Input enable for GPIO 190                                                 */
      __IOM uint32_t RDZERO190  : 1;            /*!< Return 0 for read data on GPIO 190                                        */
      __IOM uint32_t IRPTEN190  : 2;            /*!< Interrupt enable for GPIO 190                                             */
      __IOM uint32_t OUTCFG190  : 2;            /*!< Pin IO mode selection for GPIO pin 190                                    */
      __IOM uint32_t DS190      : 2;            /*!< Drive strength selection for GPIO 190                                     */
      __IOM uint32_t SR190      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG190 : 3;            /*!< Pullup/Pulldown configuration for GPIO 190                                */
      __IOM uint32_t NCESRC190  : 6;            /*!< IOMSTR/MSPI N Chip Select 190, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL190  : 1;            /*!< Polarity select for NCE for GPIO 190                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN190    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN190    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG190_b;
  } ;

  union {
    __IOM uint32_t PINCFG191;                   /*!< Controls the operation of GPIO pin 191.                                   */

    struct {
      __IOM uint32_t FNCSEL191  : 4;            /*!< Function select for GPIO pin 191                                          */
      __IOM uint32_t INPEN191   : 1;            /*!< Input enable for GPIO 191                                                 */
      __IOM uint32_t RDZERO191  : 1;            /*!< Return 0 for read data on GPIO 191                                        */
      __IOM uint32_t IRPTEN191  : 2;            /*!< Interrupt enable for GPIO 191                                             */
      __IOM uint32_t OUTCFG191  : 2;            /*!< Pin IO mode selection for GPIO pin 191                                    */
      __IOM uint32_t DS191      : 2;            /*!< Drive strength selection for GPIO 191                                     */
      __IOM uint32_t SR191      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG191 : 3;            /*!< Pullup/Pulldown configuration for GPIO 191                                */
      __IOM uint32_t NCESRC191  : 6;            /*!< IOMSTR/MSPI N Chip Select 191, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL191  : 1;            /*!< Polarity select for NCE for GPIO 191                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN191    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN191    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG191_b;
  } ;

  union {
    __IOM uint32_t PINCFG192;                   /*!< Controls the operation of GPIO pin 192.                                   */

