zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL195  : 4;            /*!< Function select for GPIO pin 195                                          */
      __IOM uint32_t INPEN195   : 1;            /*!< Input enable for GPIO 195                                                 */
      __IOM uint32_t RDZERO195  : 1;            /*!< Return 0 for read data on GPIO 195                                        */
      __IOM uint32_t IRPTEN195  : 2;            /*!< Interrupt enable for GPIO 195                                             */
      __IOM uint32_t OUTCFG195  : 2;            /*!< Pin IO mode selection for GPIO pin 195                                    */
      __IOM uint32_t DS195      : 2;            /*!< Drive strength selection for GPIO 195                                     */
      __IOM uint32_t SR195      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG195 : 3;            /*!< Pullup/Pulldown configuration for GPIO 195                                */
      __IOM uint32_t NCESRC195  : 6;            /*!< IOMSTR/MSPI N Chip Select 195, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL195  : 1;            /*!< Polarity select for NCE for GPIO 195                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN195    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN195    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG195_b;
  } ;

  union {
    __IOM uint32_t PINCFG196;                   /*!< Controls the operation of GPIO pin 196.                                   */

    struct {
      __IOM uint32_t FNCSEL196  : 4;            /*!< Function select for GPIO pin 196                                          */
      __IOM uint32_t INPEN196   : 1;            /*!< Input enable for GPIO 196                                                 */
      __IOM uint32_t RDZERO196  : 1;            /*!< Return 0 for read data on GPIO 196                                        */
      __IOM uint32_t IRPTEN196  : 2;            /*!< Interrupt enable for GPIO 196                                             */
      __IOM uint32_t OUTCFG196  : 2;            /*!< Pin IO mode selection for GPIO pin 196                                    */
      __IOM uint32_t DS196      : 2;            /*!< Drive strength selection for GPIO 196                                     */
      __IOM uint32_t SR196      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG196 : 3;            /*!< Pullup/Pulldown configuration for GPIO 196                                */
      __IOM uint32_t NCESRC196  : 6;            /*!< IOMSTR/MSPI N Chip Select 196, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL196  : 1;            /*!< Polarity select for NCE for GPIO 196                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN196    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN196    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG196_b;
  } ;

  union {
    __IOM uint32_t PINCFG197;                   /*!< Controls the operation of GPIO pin 197.                                   */

    struct {
      __IOM uint32_t FNCSEL197  : 4;            /*!< Function select for GPIO pin 197                                          */
      __IOM uint32_t INPEN197   : 1;            /*!< Input enable for GPIO 197                                                 */
      __IOM uint32_t RDZERO197  : 1;            /*!< Return 0 for read data on GPIO 197                                        */
      __IOM uint32_t IRPTEN197  : 2;            /*!< Interrupt enable for GPIO 197                                             */
      __IOM uint32_t OUTCFG197  : 2;            /*!< Pin IO mode selection for GPIO pin 197                                    */
      __IOM uint32_t DS197      : 2;            /*!< Drive strength selection for GPIO 197                                     */
      __IOM uint32_t SR197      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG197 : 3;            /*!< Pullup/Pulldown configuration for GPIO 197                                */
      __IOM uint32_t NCESRC197  : 6;            /*!< IOMSTR/MSPI N Chip Select 197, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL197  : 1;            /*!< Polarity select for NCE for GPIO 197                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN197    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN197    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG197_b;
  } ;

  union {
    __IOM uint32_t PINCFG198;                   /*!< Controls the operation of GPIO pin 198.                                   */

