zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL198  : 4;            /*!< Function select for GPIO pin 198                                          */
      __IOM uint32_t INPEN198   : 1;            /*!< Input enable for GPIO 198                                                 */
      __IOM uint32_t RDZERO198  : 1;            /*!< Return 0 for read data on GPIO 198                                        */
      __IOM uint32_t IRPTEN198  : 2;            /*!< Interrupt enable for GPIO 198                                             */
      __IOM uint32_t OUTCFG198  : 2;            /*!< Pin IO mode selection for GPIO pin 198                                    */
      __IOM uint32_t DS198      : 2;            /*!< Drive strength selection for GPIO 198                                     */
      __IOM uint32_t SR198      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG198 : 3;            /*!< Pullup/Pulldown configuration for GPIO 198                                */
      __IOM uint32_t NCESRC198  : 6;            /*!< IOMSTR/MSPI N Chip Select 198, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL198  : 1;            /*!< Polarity select for NCE for GPIO 198                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN198    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN198    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG198_b;
  } ;

  union {
    __IOM uint32_t PINCFG199;                   /*!< Controls the operation of GPIO pin 199.                                   */

    struct {
      __IOM uint32_t FNCSEL199  : 4;            /*!< Function select for GPIO pin 199                                          */
      __IOM uint32_t INPEN199   : 1;            /*!< Input enable for GPIO 199                                                 */
      __IOM uint32_t RDZERO199  : 1;            /*!< Return 0 for read data on GPIO 199                                        */
      __IOM uint32_t IRPTEN199  : 2;            /*!< Interrupt enable for GPIO 199                                             */
      __IOM uint32_t OUTCFG199  : 2;            /*!< Pin IO mode selection for GPIO pin 199                                    */
      __IOM uint32_t DS199      : 2;            /*!< Drive strength selection for GPIO 199                                     */
      __IOM uint32_t SR199      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG199 : 3;            /*!< Pullup/Pulldown configuration for GPIO 199                                */
      __IOM uint32_t NCESRC199  : 6;            /*!< IOMSTR/MSPI N Chip Select 199, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL199  : 1;            /*!< Polarity select for NCE for GPIO 199                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN199    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN199    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG199_b;
  } ;

  union {
    __IOM uint32_t PINCFG200;                   /*!< Controls the operation of GPIO pin 200.                                   */

    struct {
      __IOM uint32_t FNCSEL200  : 4;            /*!< Function select for GPIO pin 200                                          */
      __IOM uint32_t INPEN200   : 1;            /*!< Input enable for GPIO 200                                                 */
      __IOM uint32_t RDZERO200  : 1;            /*!< Return 0 for read data on GPIO 200                                        */
      __IOM uint32_t IRPTEN200  : 2;            /*!< Interrupt enable for GPIO 200                                             */
      __IOM uint32_t OUTCFG200  : 2;            /*!< Pin IO mode selection for GPIO pin 200                                    */
      __IOM uint32_t DS200      : 2;            /*!< Drive strength selection for GPIO 200                                     */
      __IOM uint32_t SR200      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG200 : 3;            /*!< Pullup/Pulldown configuration for GPIO 200                                */
      __IOM uint32_t NCESRC200  : 6;            /*!< IOMSTR/MSPI N Chip Select 200, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL200  : 1;            /*!< Polarity select for NCE for GPIO 200                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN200    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN200    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG200_b;
  } ;

  union {
    __IOM uint32_t PINCFG201;                   /*!< Controls the operation of GPIO pin 201.                                   */

