zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL201  : 4;            /*!< Function select for GPIO pin 201                                          */
      __IOM uint32_t INPEN201   : 1;            /*!< Input enable for GPIO 201                                                 */
      __IOM uint32_t RDZERO201  : 1;            /*!< Return 0 for read data on GPIO 201                                        */
      __IOM uint32_t IRPTEN201  : 2;            /*!< Interrupt enable for GPIO 201                                             */
      __IOM uint32_t OUTCFG201  : 2;            /*!< Pin IO mode selection for GPIO pin 201                                    */
      __IOM uint32_t DS201      : 2;            /*!< Drive strength selection for GPIO 201                                     */
      __IOM uint32_t SR201      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG201 : 3;            /*!< Pullup/Pulldown configuration for GPIO 201                                */
      __IOM uint32_t NCESRC201  : 6;            /*!< IOMSTR/MSPI N Chip Select 201, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL201  : 1;            /*!< Polarity select for NCE for GPIO 201                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN201    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN201    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG201_b;
  } ;

  union {
    __IOM uint32_t PINCFG202;                   /*!< Controls the operation of GPIO pin 202.                                   */

    struct {
      __IOM uint32_t FNCSEL202  : 4;            /*!< Function select for GPIO pin 202                                          */
      __IOM uint32_t INPEN202   : 1;            /*!< Input enable for GPIO 202                                                 */
      __IOM uint32_t RDZERO202  : 1;            /*!< Return 0 for read data on GPIO 202                                        */
      __IOM uint32_t IRPTEN202  : 2;            /*!< Interrupt enable for GPIO 202                                             */
      __IOM uint32_t OUTCFG202  : 2;            /*!< Pin IO mode selection for GPIO pin 202                                    */
      __IOM uint32_t DS202      : 2;            /*!< Drive strength selection for GPIO 202                                     */
      __IOM uint32_t SR202      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG202 : 3;            /*!< Pullup/Pulldown configuration for GPIO 202                                */
      __IOM uint32_t NCESRC202  : 6;            /*!< IOMSTR/MSPI N Chip Select 202, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL202  : 1;            /*!< Polarity select for NCE for GPIO 202                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN202    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN202    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG202_b;
  } ;

  union {
    __IOM uint32_t PINCFG203;                   /*!< Controls the operation of GPIO pin 203.                                   */

    struct {
      __IOM uint32_t FNCSEL203  : 4;            /*!< Function select for GPIO pin 203                                          */
      __IOM uint32_t INPEN203   : 1;            /*!< Input enable for GPIO 203                                                 */
      __IOM uint32_t RDZERO203  : 1;            /*!< Return 0 for read data on GPIO 203                                        */
      __IOM uint32_t IRPTEN203  : 2;            /*!< Interrupt enable for GPIO 203                                             */
      __IOM uint32_t OUTCFG203  : 2;            /*!< Pin IO mode selection for GPIO pin 203                                    */
      __IOM uint32_t DS203      : 2;            /*!< Drive strength selection for GPIO 203                                     */
      __IOM uint32_t SR203      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG203 : 3;            /*!< Pullup/Pulldown configuration for GPIO 203                                */
      __IOM uint32_t NCESRC203  : 6;            /*!< IOMSTR/MSPI N Chip Select 203, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL203  : 1;            /*!< Polarity select for NCE for GPIO 203                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN203    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN203    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG203_b;
  } ;

  union {
    __IOM uint32_t PINCFG204;                   /*!< Controls the operation of GPIO pin 204.                                   */

