zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL207  : 4;            /*!< Function select for GPIO pin 207                                          */
      __IOM uint32_t INPEN207   : 1;            /*!< Input enable for GPIO 207                                                 */
      __IOM uint32_t RDZERO207  : 1;            /*!< Return 0 for read data on GPIO 207                                        */
      __IOM uint32_t IRPTEN207  : 2;            /*!< Interrupt enable for GPIO 207                                             */
      __IOM uint32_t OUTCFG207  : 2;            /*!< Pin IO mode selection for GPIO pin 207                                    */
      __IOM uint32_t DS207      : 2;            /*!< Drive strength selection for GPIO 207                                     */
      __IOM uint32_t SR207      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG207 : 3;            /*!< Pullup/Pulldown configuration for GPIO 207                                */
      __IOM uint32_t NCESRC207  : 6;            /*!< IOMSTR/MSPI N Chip Select 207, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL207  : 1;            /*!< Polarity select for NCE for GPIO 207                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN207    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN207    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG207_b;
  } ;

  union {
    __IOM uint32_t PINCFG208;                   /*!< Controls the operation of GPIO pin 208.                                   */

    struct {
      __IOM uint32_t FNCSEL208  : 4;            /*!< Function select for GPIO pin 208                                          */
      __IOM uint32_t INPEN208   : 1;            /*!< Input enable for GPIO 208                                                 */
      __IOM uint32_t RDZERO208  : 1;            /*!< Return 0 for read data on GPIO 208                                        */
      __IOM uint32_t IRPTEN208  : 2;            /*!< Interrupt enable for GPIO 208                                             */
      __IOM uint32_t OUTCFG208  : 2;            /*!< Pin IO mode selection for GPIO pin 208                                    */
      __IOM uint32_t DS208      : 2;            /*!< Drive strength selection for GPIO 208                                     */
      __IOM uint32_t SR208      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG208 : 3;            /*!< Pullup/Pulldown configuration for GPIO 208                                */
      __IOM uint32_t NCESRC208  : 6;            /*!< IOMSTR/MSPI N Chip Select 208, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL208  : 1;            /*!< Polarity select for NCE for GPIO 208                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN208    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN208    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG208_b;
  } ;

  union {
    __IOM uint32_t PINCFG209;                   /*!< Controls the operation of GPIO pin 209.                                   */

    struct {
      __IOM uint32_t FNCSEL209  : 4;            /*!< Function select for GPIO pin 209                                          */
      __IOM uint32_t INPEN209   : 1;            /*!< Input enable for GPIO 209                                                 */
      __IOM uint32_t RDZERO209  : 1;            /*!< Return 0 for read data on GPIO 209                                        */
      __IOM uint32_t IRPTEN209  : 2;            /*!< Interrupt enable for GPIO 209                                             */
      __IOM uint32_t OUTCFG209  : 2;            /*!< Pin IO mode selection for GPIO pin 209                                    */
      __IOM uint32_t DS209      : 2;            /*!< Drive strength selection for GPIO 209                                     */
      __IOM uint32_t SR209      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG209 : 3;            /*!< Pullup/Pulldown configuration for GPIO 209                                */
      __IOM uint32_t NCESRC209  : 6;            /*!< IOMSTR/MSPI N Chip Select 209, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL209  : 1;            /*!< Polarity select for NCE for GPIO 209                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN209    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN209    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG209_b;
  } ;

  union {
    __IOM uint32_t PINCFG210;                   /*!< Controls the operation of GPIO pin 210.                                   */

