zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL210  : 4;            /*!< Function select for GPIO pin 210                                          */
      __IOM uint32_t INPEN210   : 1;            /*!< Input enable for GPIO 210                                                 */
      __IOM uint32_t RDZERO210  : 1;            /*!< Return 0 for read data on GPIO 210                                        */
      __IOM uint32_t IRPTEN210  : 2;            /*!< Interrupt enable for GPIO 210                                             */
      __IOM uint32_t OUTCFG210  : 2;            /*!< Pin IO mode selection for GPIO pin 210                                    */
      __IOM uint32_t DS210      : 2;            /*!< Drive strength selection for GPIO 210                                     */
      __IOM uint32_t SR210      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG210 : 3;            /*!< Pullup/Pulldown configuration for GPIO 210                                */
      __IOM uint32_t NCESRC210  : 6;            /*!< IOMSTR/MSPI N Chip Select 210, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL210  : 1;            /*!< Polarity select for NCE for GPIO 210                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN210    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN210    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG210_b;
  } ;

  union {
    __IOM uint32_t PINCFG211;                   /*!< Controls the operation of GPIO pin 211.                                   */

    struct {
      __IOM uint32_t FNCSEL211  : 4;            /*!< Function select for GPIO pin 211                                          */
      __IOM uint32_t INPEN211   : 1;            /*!< Input enable for GPIO 211                                                 */
      __IOM uint32_t RDZERO211  : 1;            /*!< Return 0 for read data on GPIO 211                                        */
      __IOM uint32_t IRPTEN211  : 2;            /*!< Interrupt enable for GPIO 211                                             */
      __IOM uint32_t OUTCFG211  : 2;            /*!< Pin IO mode selection for GPIO pin 211                                    */
      __IOM uint32_t DS211      : 2;            /*!< Drive strength selection for GPIO 211                                     */
      __IOM uint32_t SR211      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG211 : 3;            /*!< Pullup/Pulldown configuration for GPIO 211                                */
      __IOM uint32_t NCESRC211  : 6;            /*!< IOMSTR/MSPI N Chip Select 211, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL211  : 1;            /*!< Polarity select for NCE for GPIO 211                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN211    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN211    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG211_b;
  } ;

  union {
    __IOM uint32_t PINCFG212;                   /*!< Controls the operation of GPIO pin 212.                                   */

    struct {
      __IOM uint32_t FNCSEL212  : 4;            /*!< Function select for GPIO pin 212                                          */
      __IOM uint32_t INPEN212   : 1;            /*!< Input enable for GPIO 212                                                 */
      __IOM uint32_t RDZERO212  : 1;            /*!< Return 0 for read data on GPIO 212                                        */
      __IOM uint32_t IRPTEN212  : 2;            /*!< Interrupt enable for GPIO 212                                             */
      __IOM uint32_t OUTCFG212  : 2;            /*!< Pin IO mode selection for GPIO pin 212                                    */
      __IOM uint32_t DS212      : 2;            /*!< Drive strength selection for GPIO 212                                     */
      __IOM uint32_t SR212      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG212 : 3;            /*!< Pullup/Pulldown configuration for GPIO 212                                */
      __IOM uint32_t NCESRC212  : 6;            /*!< IOMSTR/MSPI N Chip Select 212, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL212  : 1;            /*!< Polarity select for NCE for GPIO 212                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN212    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN212    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG212_b;
  } ;

  union {
    __IOM uint32_t PINCFG213;                   /*!< Controls the operation of GPIO pin 213.                                   */

