zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL219  : 4;            /*!< Function select for GPIO pin 219                                          */
      __IOM uint32_t INPEN219   : 1;            /*!< Input enable for GPIO 219                                                 */
      __IOM uint32_t RDZERO219  : 1;            /*!< Return 0 for read data on GPIO 219                                        */
      __IOM uint32_t IRPTEN219  : 2;            /*!< Interrupt enable for GPIO 219                                             */
      __IOM uint32_t OUTCFG219  : 2;            /*!< Pin IO mode selection for GPIO pin 219                                    */
      __IOM uint32_t DS219      : 2;            /*!< Drive strength selection for GPIO 219                                     */
      __IOM uint32_t SR219      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG219 : 3;            /*!< Pullup/Pulldown configuration for GPIO 219                                */
      __IOM uint32_t NCESRC219  : 6;            /*!< IOMSTR/MSPI N Chip Select 219, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL219  : 1;            /*!< Polarity select for NCE for GPIO 219                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN219    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN219    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG219_b;
  } ;

  union {
    __IOM uint32_t PINCFG220;                   /*!< Controls the operation of GPIO pin 220.                                   */

    struct {
      __IOM uint32_t FNCSEL220  : 4;            /*!< Function select for GPIO pin 220                                          */
      __IOM uint32_t INPEN220   : 1;            /*!< Input enable for GPIO 220                                                 */
      __IOM uint32_t RDZERO220  : 1;            /*!< Return 0 for read data on GPIO 220                                        */
      __IOM uint32_t IRPTEN220  : 2;            /*!< Interrupt enable for GPIO 220                                             */
      __IOM uint32_t OUTCFG220  : 2;            /*!< Pin IO mode selection for GPIO pin 220                                    */
      __IOM uint32_t DS220      : 2;            /*!< Drive strength selection for GPIO 220                                     */
      __IOM uint32_t SR220      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG220 : 3;            /*!< Pullup/Pulldown configuration for GPIO 220                                */
      __IOM uint32_t NCESRC220  : 6;            /*!< IOMSTR/MSPI N Chip Select 220, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL220  : 1;            /*!< Polarity select for NCE for GPIO 220                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN220    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN220    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG220_b;
  } ;

  union {
    __IOM uint32_t PINCFG221;                   /*!< Controls the operation of GPIO pin 221.                                   */

    struct {
      __IOM uint32_t FNCSEL221  : 4;            /*!< Function select for GPIO pin 221                                          */
      __IOM uint32_t INPEN221   : 1;            /*!< Input enable for GPIO 221                                                 */
      __IOM uint32_t RDZERO221  : 1;            /*!< Return 0 for read data on GPIO 221                                        */
      __IOM uint32_t IRPTEN221  : 2;            /*!< Interrupt enable for GPIO 221                                             */
      __IOM uint32_t OUTCFG221  : 2;            /*!< Pin IO mode selection for GPIO pin 221                                    */
      __IOM uint32_t DS221      : 2;            /*!< Drive strength selection for GPIO 221                                     */
      __IOM uint32_t SR221      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG221 : 3;            /*!< Pullup/Pulldown configuration for GPIO 221                                */
      __IOM uint32_t NCESRC221  : 6;            /*!< IOMSTR/MSPI N Chip Select 221, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL221  : 1;            /*!< Polarity select for NCE for GPIO 221                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN221    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN221    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG221_b;
  } ;

  union {
    __IOM uint32_t PINCFG222;                   /*!< Controls the operation of GPIO pin 222.                                   */

