zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FNCSEL222  : 4;            /*!< Function select for GPIO pin 222                                          */
      __IOM uint32_t INPEN222   : 1;            /*!< Input enable for GPIO 222                                                 */
      __IOM uint32_t RDZERO222  : 1;            /*!< Return 0 for read data on GPIO 222                                        */
      __IOM uint32_t IRPTEN222  : 2;            /*!< Interrupt enable for GPIO 222                                             */
      __IOM uint32_t OUTCFG222  : 2;            /*!< Pin IO mode selection for GPIO pin 222                                    */
      __IOM uint32_t DS222      : 2;            /*!< Drive strength selection for GPIO 222                                     */
      __IOM uint32_t SR222      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG222 : 3;            /*!< Pullup/Pulldown configuration for GPIO 222                                */
      __IOM uint32_t NCESRC222  : 6;            /*!< IOMSTR/MSPI N Chip Select 222, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL222  : 1;            /*!< Polarity select for NCE for GPIO 222                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN222    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN222    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG222_b;
  } ;

  union {
    __IOM uint32_t PINCFG223;                   /*!< Controls the operation of GPIO pin 223.                                   */

    struct {
      __IOM uint32_t FNCSEL223  : 4;            /*!< Function select for GPIO pin 223                                          */
      __IOM uint32_t INPEN223   : 1;            /*!< Input enable for GPIO 223                                                 */
      __IOM uint32_t RDZERO223  : 1;            /*!< Return 0 for read data on GPIO 223                                        */
      __IOM uint32_t IRPTEN223  : 2;            /*!< Interrupt enable for GPIO 223                                             */
      __IOM uint32_t OUTCFG223  : 2;            /*!< Pin IO mode selection for GPIO pin 223                                    */
      __IOM uint32_t DS223      : 2;            /*!< Drive strength selection for GPIO 223                                     */
      __IOM uint32_t SR223      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG223 : 3;            /*!< Pullup/Pulldown configuration for GPIO 223                                */
      __IOM uint32_t NCESRC223  : 6;            /*!< IOMSTR/MSPI N Chip Select 223, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL223  : 1;            /*!< Polarity select for NCE for GPIO 223                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN223    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN223    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG223_b;
  } ;
  __IM  uint32_t  RESERVED[32];

  union {
    __IOM uint32_t PADKEY;                      /*!< Lock state of the PINCFG and GPIO configuration registers. Write
                                                     a value of 0x73 to unlock write access to the PAD and GPIO.               */

    struct {
      __IOM uint32_t PADKEY     : 32;           /*!< Key register value.                                                       */
    } PADKEY_b;
  } ;

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 31-0 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

    struct {
      __IOM uint32_t RD1        : 32;           /*!< GPIO63-32 Reads pin state - read only. Returns the pad pin state
                                                     for pins 63-32 if the PINCFG's input enable (INPEN) is
                                                     active and RDZERO is inactive.                                            */
    } RD1_b;
  } ;

  union {
    __IOM uint32_t RD2;                         /*!< GPIO Input 2 (95-64)                                                      */

