zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t ENS5       : 32;           /*!< GPIO191-160 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS5_b;
  } ;

  union {
    __IOM uint32_t ENS6;                        /*!< GPIO Enable Set 6 (223-192)                                               */

    struct {
      __IOM uint32_t ENS6       : 32;           /*!< GPIO223-192 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS6_b;
  } ;

  union {
    __IOM uint32_t ENC0;                        /*!< GPIO Enable Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t ENC0       : 32;           /*!< GPIO31-0 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC0_b;
  } ;

  union {
    __IOM uint32_t ENC1;                        /*!< GPIO Enable Clear 1 (63-32)                                               */

    struct {
      __IOM uint32_t ENC1       : 32;           /*!< GPIO63-32 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC1_b;
  } ;

  union {
    __IOM uint32_t ENC2;                        /*!< GPIO Enable Clear 2 (95-64)                                               */

    struct {
      __IOM uint32_t ENC2       : 32;           /*!< GPIO95-64 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC2_b;
  } ;

  union {
    __IOM uint32_t ENC3;                        /*!< GPIO Enable Clear 3 (127-96)                                              */

    struct {
      __IOM uint32_t ENC3       : 32;           /*!< GPIO127-96 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC3_b;
  } ;

  union {
    __IOM uint32_t ENC4;                        /*!< GPIO Enable Clear 4 (159-128)                                             */

    struct {
      __IOM uint32_t ENC4       : 32;           /*!< GPIO159-128 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC4_b;
  } ;

  union {
    __IOM uint32_t ENC5;                        /*!< GPIO Enable Clear 5 (191-160)                                             */

    struct {
      __IOM uint32_t ENC5       : 32;           /*!< GPIO191-160 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC5_b;
  } ;

  union {
    __IOM uint32_t ENC6;                        /*!< GPIO Enable Clear 6 (223-192)                                             */

    struct {
      __IOM uint32_t ENC6       : 32;           /*!< GPIO223-192 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC6_b;
  } ;

  union {
    __IOM uint32_t IOM0IRQ;                     /*!< IOM0 IRQ select for flow control.                                         */

