zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< GPIO128 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< GPIO129 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< GPIO130 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< GPIO131 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< GPIO132 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< GPIO133 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< GPIO134 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< GPIO135 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< GPIO136 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< GPIO137 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< GPIO138 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< GPIO139 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< GPIO140 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< GPIO141 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< GPIO142 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< GPIO143 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< GPIO144 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< GPIO145 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< GPIO146 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< GPIO147 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< GPIO148 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< GPIO149 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< GPIO150 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< GPIO151 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< GPIO152 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< GPIO153 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< GPIO154 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< GPIO155 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< GPIO156 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< GPIO157 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< GPIO158 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< GPIO159 MCU N0-priority interrupt                                         */
    } MCUN0INT4SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< GPIO160 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< GPIO161 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< GPIO162 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< GPIO163 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< GPIO164 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< GPIO165 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< GPIO166 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< GPIO167 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< GPIO168 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< GPIO169 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< GPIO170 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< GPIO171 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< GPIO172 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< GPIO173 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< GPIO174 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< GPIO175 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< GPIO176 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< GPIO177 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< GPIO178 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< GPIO179 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< GPIO180 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< GPIO181 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< GPIO182 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< GPIO183 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< GPIO184 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< GPIO185 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< GPIO186 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< GPIO187 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< GPIO188 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< GPIO189 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< GPIO190 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< GPIO191 MCU N0-priority interrupt                                         */
    } MCUN0INT5EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

