zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< GPIO160 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< GPIO161 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< GPIO162 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< GPIO163 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< GPIO164 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< GPIO165 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< GPIO166 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< GPIO167 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< GPIO168 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< GPIO169 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< GPIO170 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< GPIO171 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< GPIO172 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< GPIO173 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< GPIO174 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< GPIO175 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< GPIO176 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< GPIO177 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< GPIO178 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< GPIO179 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< GPIO180 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< GPIO181 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< GPIO182 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< GPIO183 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< GPIO184 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< GPIO185 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< GPIO186 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< GPIO187 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< GPIO188 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< GPIO189 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< GPIO190 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< GPIO191 MCU N0-priority interrupt                                         */
    } MCUN0INT5SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< GPIO192 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< GPIO193 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< GPIO194 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< GPIO195 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< GPIO196 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< GPIO197 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< GPIO198 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< GPIO199 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< GPIO200 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< GPIO201 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< GPIO202 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< GPIO203 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< GPIO204 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< GPIO205 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< GPIO206 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< GPIO207 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< GPIO208 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< GPIO209 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< GPIO210 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< GPIO211 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< GPIO212 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< GPIO213 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< GPIO214 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< GPIO215 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< GPIO216 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< GPIO217 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< GPIO218 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< GPIO219 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< GPIO220 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< GPIO221 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< GPIO222 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< GPIO223 MCU N0-priority interrupt                                         */
    } MCUN0INT6EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

