zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< GPIO192 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< GPIO193 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< GPIO194 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< GPIO195 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< GPIO196 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< GPIO197 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< GPIO198 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< GPIO199 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< GPIO200 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< GPIO201 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< GPIO202 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< GPIO203 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< GPIO204 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< GPIO205 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< GPIO206 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< GPIO207 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< GPIO208 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< GPIO209 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< GPIO210 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< GPIO211 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< GPIO212 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< GPIO213 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< GPIO214 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< GPIO215 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< GPIO216 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< GPIO217 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< GPIO218 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< GPIO219 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< GPIO220 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< GPIO221 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< GPIO222 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< GPIO223 MCU N0-priority interrupt                                         */
    } MCUN0INT6STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< GPIO192 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< GPIO193 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< GPIO194 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< GPIO195 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< GPIO196 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< GPIO197 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< GPIO198 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< GPIO199 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< GPIO200 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< GPIO201 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< GPIO202 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< GPIO203 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< GPIO204 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< GPIO205 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< GPIO206 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< GPIO207 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< GPIO208 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< GPIO209 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< GPIO210 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< GPIO211 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< GPIO212 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< GPIO213 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< GPIO214 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< GPIO215 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< GPIO216 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< GPIO217 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< GPIO218 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< GPIO219 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< GPIO220 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< GPIO221 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< GPIO222 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< GPIO223 MCU N0-priority interrupt                                         */
    } MCUN0INT6CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

