zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< GPIO192 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< GPIO193 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< GPIO194 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< GPIO195 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< GPIO196 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< GPIO197 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< GPIO198 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< GPIO199 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< GPIO200 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< GPIO201 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< GPIO202 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< GPIO203 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< GPIO204 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< GPIO205 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< GPIO206 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< GPIO207 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< GPIO208 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< GPIO209 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< GPIO210 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< GPIO211 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< GPIO212 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< GPIO213 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< GPIO214 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< GPIO215 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< GPIO216 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< GPIO217 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< GPIO218 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< GPIO219 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< GPIO220 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< GPIO221 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< GPIO222 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< GPIO223 MCU N0-priority interrupt                                         */
    } MCUN0INT6SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO0 : 1;            /*!< GPIO0 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO1 : 1;            /*!< GPIO1 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO2 : 1;            /*!< GPIO2 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO3 : 1;            /*!< GPIO3 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO4 : 1;            /*!< GPIO4 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO5 : 1;            /*!< GPIO5 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO6 : 1;            /*!< GPIO6 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO7 : 1;            /*!< GPIO7 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO8 : 1;            /*!< GPIO8 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO9 : 1;            /*!< GPIO9 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO10 : 1;           /*!< GPIO10 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO11 : 1;           /*!< GPIO11 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO12 : 1;           /*!< GPIO12 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO13 : 1;           /*!< GPIO13 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO14 : 1;           /*!< GPIO14 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO15 : 1;           /*!< GPIO15 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO16 : 1;           /*!< GPIO16 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO17 : 1;           /*!< GPIO17 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO18 : 1;           /*!< GPIO18 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO19 : 1;           /*!< GPIO19 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO20 : 1;           /*!< GPIO20 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO21 : 1;           /*!< GPIO21 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO22 : 1;           /*!< GPIO22 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO23 : 1;           /*!< GPIO23 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO24 : 1;           /*!< GPIO24 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO25 : 1;           /*!< GPIO25 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO26 : 1;           /*!< GPIO26 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO27 : 1;           /*!< GPIO27 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO28 : 1;           /*!< GPIO28 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO29 : 1;           /*!< GPIO29 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO30 : 1;           /*!< GPIO30 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO31 : 1;           /*!< GPIO31 MCU N1-priority interrupt                                          */
    } MCUN1INT0EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

