zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MCUN1GPIO192 : 1;          /*!< GPIO192 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO193 : 1;          /*!< GPIO193 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO194 : 1;          /*!< GPIO194 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO195 : 1;          /*!< GPIO195 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO196 : 1;          /*!< GPIO196 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO197 : 1;          /*!< GPIO197 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO198 : 1;          /*!< GPIO198 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO199 : 1;          /*!< GPIO199 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO200 : 1;          /*!< GPIO200 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO201 : 1;          /*!< GPIO201 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO202 : 1;          /*!< GPIO202 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO203 : 1;          /*!< GPIO203 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO204 : 1;          /*!< GPIO204 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO205 : 1;          /*!< GPIO205 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO206 : 1;          /*!< GPIO206 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO207 : 1;          /*!< GPIO207 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO208 : 1;          /*!< GPIO208 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO209 : 1;          /*!< GPIO209 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO210 : 1;          /*!< GPIO210 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO211 : 1;          /*!< GPIO211 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO212 : 1;          /*!< GPIO212 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO213 : 1;          /*!< GPIO213 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO214 : 1;          /*!< GPIO214 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO215 : 1;          /*!< GPIO215 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO216 : 1;          /*!< GPIO216 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO217 : 1;          /*!< GPIO217 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO218 : 1;          /*!< GPIO218 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO219 : 1;          /*!< GPIO219 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO220 : 1;          /*!< GPIO220 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO221 : 1;          /*!< GPIO221 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO222 : 1;          /*!< GPIO222 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO223 : 1;          /*!< GPIO223 MCU N1-priority interrupt                                         */
    } MCUN1INT6SET_b;
  } ;
} GPIO_Type;                                    /*!< Size = 1552 (0x610)                                                       */



/* =========================================================================================================================== */
/* ================                                            GPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Graphics Processing Unit (GPU)
  */

typedef struct {                                /*!< GPU Structure                                                             */

  union {
    __IOM uint32_t TEX0BASE;                    /*!< Base address of the drawing surface 0 (must be word aligned).             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< Address 0: base address of the drawing surface 0 (must be word
                                                     aligned).                                                                 */
    } TEX0BASE_b;
  } ;

  union {
    __IOM uint32_t TEX0STRIDE;                  /*!< Image 0 mode and stride.                                                  */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< Image Mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< Image Format                                                              */
    } TEX0STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX0RES;                     /*!< Image 0 resolution.                                                       */

