zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t DRAW1Y     : 32;           /*!< Y coordinate                                                              */
    } DRAWPT1Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1Z;                    /*!< FIXME - register description needed here.                                 */

    struct {
      __IOM uint32_t DRAW1Z     : 32;           /*!< This bitfield is reserved.                                                */
    } DRAWPT1Z_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t DRAWPT2X;                    /*!< X coordinate of Vertex 2 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW2X     : 32;           /*!< X coordinate                                                              */
    } DRAWPT2X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT2Y;                    /*!< Y coordinate of Vertex 2 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW2Y     : 32;           /*!< Y coordinate                                                              */
    } DRAWPT2Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT2Z;                    /*!< FIXME - register description needed here.                                 */

    struct {
      __IOM uint32_t RSVD       : 32;           /*!< This bitfield is reserved.                                                */
    } DRAWPT2Z_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t DRAWPT3X;                    /*!< X coordinate of Vertex 3 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW3X     : 32;           /*!< X coordinate                                                              */
    } DRAWPT3X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT3Y;                    /*!< Y coordinate of Vertex 3 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW3Y     : 32;           /*!< Y coordinate.                                                             */
    } DRAWPT3Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT3Z;                    /*!< Fixed value (not accessible). Registers 0x160-0x180 are the
                                                     elements of the 3x3 transformation matrix used for homogeneous
                                                     conversion from screen coordinates to texture coordinates;
                                                     the elements are floating points                                          */

    struct {
      __IOM uint32_t DRAW3Z     : 32;           /*!< Fixed value (not accessible)                                              */
    } DRAWPT3Z_b;
  } ;
  __IM  uint32_t  RESERVED9;

  union {
    __IOM uint32_t MM00;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (0,0). matrix floating point element.                                     */
    } MM00_b;
  } ;

  union {
    __IOM uint32_t MM01;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (0,1). matrix floating point element.                                     */
    } MM01_b;
  } ;

  union {
    __IOM uint32_t MM02;                        /*!< matrix floating point element; sets to unit matrix if previously
                                                     written element is MM12.                                                  */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (0,2). matrix floating point element.                                     */
    } MM02_b;
  } ;

  union {
    __IOM uint32_t MM10;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (1,0). matrix floating point element.                                     */
    } MM10_b;
  } ;

  union {
    __IOM uint32_t MM11;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (1,1). matrix floating point element                                      */
    } MM11_b;
  } ;

  union {
    __IOM uint32_t MM12;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (1,2). matrix floating point element.                                     */
    } MM12_b;
  } ;

  union {
    __IOM uint32_t MM20;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (2,0). matrix floating point element.                                     */
    } MM20_b;
  } ;

  union {
    __IOM uint32_t MM21;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (2,1). matrix floating point element.                                     */
    } MM21_b;
  } ;

  union {
    __IOM uint32_t MM22;                        /*!< matrix floating point element.                                            */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< (2,2). matrix floating point element                                      */
    } MM22_b;
  } ;

  union {
    __IOM uint32_t DEPTHSTARTL;                 /*!< Depth value of START pixel, (32 low bits fractional.)                     */

    struct {
      __IOM uint32_t DEPTH32LO  : 32;           /*!< Depth value of START pixel                                                */
    } DEPTHSTARTL_b;
  } ;

  union {
    __IOM uint32_t DEPTHSTARTH;                 /*!< Depth value of START pixel, (32 high bits integral.)                      */

