zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t TXTARGADDRNEXT : 32;       /*!< Address bits of the target byte address for source of next TX
                                                     write DMA.                                                                */
    } TXDMAADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< I2S Module Status                                                         */

    struct {
      __IOM uint32_t TBD        : 1;            /*!< To Be determined.                                                         */
            uint32_t            : 31;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED5[51];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTSET_b;
  } ;
} I2S0_Type;                                    /*!< Size = 784 (0x310)                                                        */



/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief IO Peripheral Master (IOM0)
  */

typedef struct {                                /*!< IOM0 Structure                                                            */

  union {
    __IOM uint32_t FIFO;                        /*!< Provides direct random access to both input and output fifos.
                                                     The state of the FIFO is not distured by reading these
                                                     locations (ie no POP will be done). FIFO0 is accessible
                                                     from addresses 0x0 - 0x1C, and is used for data outuput
                                                     from the IOM to external devices. These FIFO locations
                                                     can be read and written directly.FIFO locations 0x20 -
                                                     0x3C provide read only access to the input fifo. These
                                                     FIFO locations cannot be directly written by the MCU, and
                                                     are updated only by the internal hardware. Writes to the
                                                     FIFO0 will take effect immediately. The currently FIFO
                                                     pointersin register FIFOLOC indicate the current offset
                                                     into each FIFO0 for the read and write operations.Access
                                                     to the FIFOs can only be done in word increments; Byte
                                                     access and writes are not supported.For push and pop style
                                                     access to FIFO0 can be done using the FIFOPOP and FIFOPUSH
                                                     registers below.                                                          */

