zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< FIFO direct access. Only locations 0 - 3F will return valid
                                                     information.                                                              */
    } FIFO_b;
  } ;
  __IM  uint32_t  RESERVED[63];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< Provides the current valid byte count of data within the FIFO
                                                     as seen from the internal state machines. FIFO0 is dedicated
                                                     to outgoing transactions and FIFO1 is dedicated to incoming
                                                     transactions. All counts are specified in units of bytes.                 */

    struct {
      __IOM uint32_t FIFO0SIZ   : 8;            /*!< The number of valid data bytes currently in the FIFO 0 (written
                                                     by MCU, read by interface)                                                */
      __IOM uint32_t FIFO0REM   : 8;            /*!< The number of remaining data bytes slots currently in FIFO 0
                                                     (written by MCU, read by interface)                                       */
      __IOM uint32_t FIFO1SIZ   : 8;            /*!< The number of valid data bytes currently in FIFO 1 (written
                                                     by interface, read by MCU)                                                */
      __IOM uint32_t FIFO1REM   : 8;            /*!< The number of remaining data bytes slots currently in FIFO 1
                                                     (written by interface, read by MCU)                                       */
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< Sets the threshold values for incoming and outgoing transactions.
                                                     The threshold values are used to assert the interrupt if
                                                     enabled, and also used during DMA to set the transfer size
                                                     as a result of DMATHR trigger.The WTHR is used to indicate
                                                     when there are more than WTHR bytes of open fifo locations
                                                     available in the outgoing FIFO (FIFO0). The intended use
                                                     to invoke an interrupt or DMA transfer that will refill
                                                     the FIFO with a byte count up to this value.The RTHR is
                                                     used to indicate when there are more than RTHR bytes in
                                                     the incoming FIFO (FIFO1) and a data transfer of this size
                                                     can be supported, either through direct POP of the FIFO,
                                                     or through DMA.The value of both RTHR and WTHR are also
                                                     used to set the data transfer size of DMA operations if
                                                     DMATHR trigger is enabled.                                                */

    struct {
      __IOM uint32_t FIFORTHR   : 6;            /*!< FIFO read threshold in bytes. A value of 0 will disable the
                                                     read FIFO level from activating the threshold interrupt.
                                                     If this field is non-zero, it will trigger a threshold
                                                     interrupt when the read fifo contains FIFORTHR valid bytes
                                                     of data, as indicated by the FIFO1SIZ field. This is intended
                                                     to signal when a data transfer of FIFORTHR bytes can be
                                                     done from the IOM module to the host via the read fifo
                                                     to support large IOM read operations.                                     */
            uint32_t            : 2;
      __IOM uint32_t FIFOWTHR   : 6;            /*!< FIFO write threshold in bytes. A value of 0 will disable the
                                                     write FIFO level from activating the threshold interrupt.
                                                     If this field is non-zero, it will trigger a threshold
                                                     interrupt when the write fifo contains FIFOWTHR free bytes,
                                                     as indicated by the FIFO0REM field. This is intended to
                                                     signal when a transfer of FIFOWTHR bytes can be done from
                                                     the host to the IOM write fifo to support large IOM write
                                                     operations.                                                               */
            uint32_t            : 18;
    } FIFOTHR_b;
  } ;

  union {
    __IOM uint32_t FIFOPOP;                     /*!< Will advance the internal read pointer of the incoming FIFO
                                                     (FIFO1) when read, if POPWR is not active. If POPWR is
                                                     active, a write to this register is needed to advance the
                                                     internal FIFO pointer.                                                    */

    struct {
      __IOM uint32_t FIFODOUT   : 32;           /*!< This register will return the read data indicated by the current
                                                     read pointer on reads. If the POPWR control bit in the
                                                     FIFOCTRL register is reset (0), the fifo read pointer will
                                                     be advanced by one word as a result of the read.If the
                                                     POPWR bit is set (1), the fifo read pointer will only be
                                                     advanced after a write operation to this register. The
                                                     write data is ignored for this register.If less than a
                                                     even word multiple is available, and the command is completed,
                                                     the module will return the word containing these bytes
                                                     and undetermined data in the unused fields of the word.                   */
    } FIFOPOP_b;
  } ;

  union {
    __IOM uint32_t FIFOPUSH;                    /*!< Will write new data into the outgoing FIFO and advance the internal
                                                     write pointer.                                                            */

