zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FIFODIN    : 32;           /*!< This register is used to write the FIFORAM in FIFO mode and
                                                     will cause a push event to occur to the next open slot
                                                     within the FIFORAM. Writing to this register will cause
                                                     the write point to increment by 1 word(4 bytes).                          */
    } FIFOPUSH_b;
  } ;

  union {
    __IOM uint32_t FIFOCTRL;                    /*!< Provides controls for the operation of the internal FIFOs. Contains
                                                     fields used to control the operation of the POP register,
                                                     and also controls to reset the internal pointers of the
                                                     FIFOs.                                                                    */

    struct {
      __IOM uint32_t POPWR      : 1;            /*!< Selects the mode in which 'pop' events are done for the fifo
                                                     read operations. A value of '1' will prevent a pop event
                                                     on a read operation, and will require a write to the FIFOPOP
                                                     register to create a pop event.A value of '0' in this register
                                                     will allow a pop event to occur on the read of the FIFOPOP
                                                     register, and may cause inadvertant fifo pops when used
                                                     in a debugging mode.                                                      */
      __IOM uint32_t FIFORSTN   : 1;            /*!< Active low manual reset of the fifo. Write to 0 to reset fifo,
                                                     and then write to 1 to remove the reset.                                  */
            uint32_t            : 30;
    } FIFOCTRL_b;
  } ;

  union {
    __IOM uint32_t FIFOLOC;                     /*!< Provides a read only value of the current read and write pointers.
                                                     This register is read only and can be used alogn with the
                                                     FIFO direct access method to determine the next data to
                                                     be used for input and output functions.                                   */

    struct {
      __IOM uint32_t FIFOWPTR   : 4;            /*!< Current FIFO write pointer. Value is the index into the outgoing
                                                     FIFO (FIFO0), which is used during write operations to
                                                     external devices.                                                         */
            uint32_t            : 4;
      __IOM uint32_t FIFORPTR   : 4;            /*!< Current FIFO read pointer. Used to index into the incoming FIFO
                                                     (FIFO1), which is used to store read data returned from
                                                     external devices during a read operation.                                 */
            uint32_t            : 20;
    } FIFOLOC_b;
  } ;

  union {
    __IOM uint32_t CLKCFG;                      /*!< Provides clock related controls used internal to the IOM module.
                                                     The internal clock sourced is selected via the FSEL and
                                                     can be further divided by 3 using the DIV3 control.This
                                                     register is also used to enable the clock, which must be
                                                     done prior to performing any IO transactions.                             */

    struct {
      __IOM uint32_t IOCLKEN    : 1;            /*!< Enable for the interface clock. Must be enabled prior to executing
                                                     any IO operations.                                                        */
            uint32_t            : 7;
      __IOM uint32_t FSEL       : 4;            /*!< Select the input clock frequency.                                         */
      __IOM uint32_t DIV3       : 1;            /*!< Enable divide by 3 of the source IOCLK. Division by 3 is done
                                                     before the DIVEN programmable divider, and if enabledwill
                                                     provide the divided by 3 clock as the source to the programmable
                                                     divider.                                                                  */
      __IOM uint32_t DIVEN      : 1;            /*!< Enable clock division by TOTPER and LOWPER                                */
            uint32_t            : 2;
      __IOM uint32_t LOWPER     : 8;            /*!< Clock low clock count minus 1. This provides the number of clocks
                                                     the divided clock will be low when the DIVEN = 1.Only applicable
                                                     when DIVEN = 1.                                                           */
      __IOM uint32_t TOTPER     : 8;            /*!< Clock total clock count minus 1. This provides the total period
                                                     of the divided clock -1 when the DIVEN is active. Thesource
                                                     clock is selected by FSEL. Only applicable when DIVEN =
                                                     1.                                                                        */
    } CLKCFG_b;
  } ;

  union {
    __IOM uint32_t SUBMODCTRL;                  /*!< Provides enable for each submodule. Only a sigle submodule can
                                                     be enabled at one time.                                                   */

