zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTEN_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSTAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSTAT_b;
  } ;

  union {
    __IOM uint32_t REGACCINTCLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTCLR_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSET_b;
  } ;
} IOSLAVEFD0_Type;                              /*!< Size = 544 (0x220)                                                        */



/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C/SPI Slave (IOSLAVE)
  */

typedef struct {                                /*!< IOSLAVE Structure                                                         */
  __IM  uint32_t  RESERVED[64];

  union {
    __IOM uint32_t FIFOPTR;                     /*!< Current FIFO Pointer                                                      */

    struct {
      __IOM uint32_t FIFOPTR    : 8;            /*!< Current FIFO pointer.                                                     */
      __IOM uint32_t FIFOSIZ    : 8;            /*!< The number of bytes currently in the hardware FIFO.                       */
            uint32_t            : 16;
    } FIFOPTR_b;
  } ;

  union {
    __IOM uint32_t FIFOCFG;                     /*!< FIFO Configuration                                                        */

    struct {
      __IOM uint32_t FIFOBASE   : 5;            /*!< These bits hold the base address of the I/O FIFO in 8 byte segments.
                                                     The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to
                                                     (FIFOMAX*8-1).                                                            */
            uint32_t            : 3;
      __IOM uint32_t FIFOMAX    : 6;            /*!< These bits hold the maximum FIFO address in 8 byte segments.
                                                     It is also the beginning of the RAM area of the LRAM. Note
                                                     that no RAM area is configured if FIFOMAX is set to 0x1F.                 */
            uint32_t            : 10;
      __IOM uint32_t ROBASE     : 6;            /*!< Defines the read-only area. The IO Slave read-only area is situated
                                                     in LRAM at (ROBASE*8) to (FIFOBASE*8-1)                                   */
            uint32_t            : 2;
    } FIFOCFG_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< FIFO Threshold Configuration                                              */

    struct {
      __IOM uint32_t FIFOTHR    : 8;            /*!< FIFO size interrupt threshold.                                            */
            uint32_t            : 24;
    } FIFOTHR_b;
  } ;

  union {
    __IOM uint32_t FUPD;                        /*!< FIFO Update Status                                                        */

    struct {
      __IOM uint32_t FIFOUPD    : 1;            /*!< This bit indicates that a FIFO update is underway.                        */
      __IOM uint32_t IOREAD     : 1;            /*!< This bitfield indicates an IO read is active.                             */
            uint32_t            : 30;
    } FUPD_b;
  } ;

  union {
    __IOM uint32_t FIFOCTR;                     /*!< Overall FIFO Counter                                                      */

    struct {
      __IOM uint32_t FIFOCTR    : 10;           /*!< Virtual FIFO byte count                                                   */
            uint32_t            : 22;
    } FIFOCTR_b;
  } ;

  union {
    __IOM uint32_t FIFOINC;                     /*!< Overall FIFO Counter Increment                                            */

    struct {
      __IOM uint32_t FIFOINC    : 10;           /*!< Increment the Overall FIFO Counter by this value on a write               */
            uint32_t            : 22;
    } FIFOINC_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< I/O Slave Configuration                                                   */

    struct {
      __IOM uint32_t IFCSEL     : 1;            /*!< This bit selects the I/O interface.                                       */
      __IOM uint32_t SPOL       : 1;            /*!< This bit selects SPI polarity.                                            */
      __IOM uint32_t LSB        : 1;            /*!< This bit selects the transfer bit ordering.                               */
            uint32_t            : 1;
      __IOM uint32_t STARTRD    : 1;            /*!< This bit holds the cycle to initiate an I/O RAM read.                     */
            uint32_t            : 3;
      __IOM uint32_t I2CADDR    : 12;           /*!< 7-bit or 10-bit I2C device address.                                       */
      __IOM uint32_t WRAPPTR    : 1;            /*!< Address pointer wrap mode enable.                                         */
            uint32_t            : 10;
      __IOM uint32_t IFCEN      : 1;            /*!< IOSLAVE interface enable.                                                 */
    } CFG_b;
  } ;

  union {
    __IOM uint32_t PRENC;                       /*!< I/O Slave Interrupt Priority Encode                                       */

