zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t PRENC      : 5;            /*!< These bits hold the priority encode of the REGACC interrupts.             */
            uint32_t            : 27;
    } PRENC_b;
  } ;

  union {
    __IOM uint32_t IOINTCTL;                    /*!< I/O Interrupt Control                                                     */

    struct {
      __IOM uint32_t IOINTEN    : 8;            /*!< These read-only bits indicate whether the IOINT interrupts are
                                                     enabled.                                                                  */
      __IOM uint32_t IOINT      : 8;            /*!< These bits read the IOINT interrupts.                                     */
      __IOM uint32_t IOINTCLR   : 1;            /*!< This bit clears all of the IOINT interrupts when written with
                                                     a 1.                                                                      */
            uint32_t            : 7;
      __IOM uint32_t IOINTSET   : 8;            /*!< These bits set the IOINT interrupts when written with a 1.                */
    } IOINTCTL_b;
  } ;

  union {
    __IOM uint32_t GENADD;                      /*!< General Address Data                                                      */

    struct {
      __IOM uint32_t GADATA     : 8;            /*!< The data supplied on the last General Address reference.                  */
            uint32_t            : 24;
    } GENADD_b;
  } ;

  union {
    __IOM uint32_t ADDPTR;                      /*!< Address pointer                                                           */

    struct {
      __IOM uint32_t ADDPTR     : 8;            /*!< The current value in the Address pointer.                                 */
            uint32_t            : 24;
    } ADDPTR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DMACFG;                      /*!< Configuration control of the DMA process, including the direction
                                                     of DMA, and enablement of DMA                                             */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation.
                                                     This should be the last DMA related register set prior
                                                     to issuing the command                                                    */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 6;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power off module after DMA is complete. If this bit is active,
                                                     the module will request to power off the supply it is attached
                                                     to. If there are other units still requiring power from
                                                     the same domain, power down will not be performed.                        */
      __IOM uint32_t DMAQUAD    : 1;            /*!< Sets the Priority of the DMA request                                      */
            uint32_t            : 5;
      __IOM uint32_t PADBYTE    : 8;            /*!< PAD byte value.                                                           */
      __IOM uint32_t PADBYTEEN  : 1;            /*!< PAD byte enable.                                                          */
      __IOM uint32_t FRCDMA     : 1;            /*!< Force DMA transfer read/write independent of R/W bit in interface
                                                     command                                                                   */
      __IOM uint32_t FRCRDWRT   : 1;            /*!< Select DMA transfer force direction                                       */
            uint32_t            : 5;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< Contains the number of bytes to be transferred for this DMA
                                                     transaction. This register is decremented as the data is
                                                     transferred.                                                              */

    struct {
      __IOM uint32_t TOTCOUNT   : 16;           /*!< This bitfield holds the number of bytes transferred to/from
                                                     memory during a DMA transfer.                                             */
      __IOM uint32_t XFRCOUNT   : 16;           /*!< This bitfield holds the number of bytes transferred on the interface.     */
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< The source or destination address internal the SRAM for the
                                                     DMA data. For write operations, this can only be SRAM data
                                                     (ADDR bit 28 = 1); For read operations, this can be either
                                                     SRAM or FLASH (ADDR bit 28 = 0)                                           */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Bits [28:0] of the target byte address for source of DMA (either
                                                     read or write). The address can be any byte alignment,
                                                     and does not have to be word aligned. In cases of non-word
                                                     aligned addresses, the DMA logic will take care of ensuring
                                                     only the target bytes are read/written.                                   */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< Status of the DMA operation currently in progress.                        */

