zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< Lockout of debugger (SWD).                                                */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< Active Current Reference Generator Control                                */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< Software enablement for ACRG register. A value of 1 will allow
                                                     writes to the register                                                    */
      __IOM uint32_t ACRGPWD    : 1;            /*!< Power down the ACRG.                                                      */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect. The inversion of this register
                                                     is driven to analog.                                                      */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< ACRG Trim value                                                           */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< Voltage Reference Generator 2 Control                                     */

    struct {
      __IOM uint32_t TVRGCVREFTRIM : 7;         /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRGCTEMPCOTRIM : 5;       /*!< TVRGC tempcompensation trim init value                                    */
      __IOM uint32_t TVRGCSELVREF : 1;          /*!< TVRGC sel vref init value                                                 */
      __IOM uint32_t TVRGCPDNB  : 1;            /*!< TVRGC pdnb init value                                                     */
      __IOM uint32_t TVRGCHSENRESDIV : 1;       /*!< TVRGC hsenable resdiv init value                                          */
      __IOM uint32_t TVRGCCURRENTTRIM : 1;      /*!< TVRGC Current trim init value                                             */
            uint32_t            : 16;
    } VREFGEN2_b;
  } ;

  union {
    __IOM uint32_t VREFGEN3;                    /*!< Voltage Reference Generator 3 Control                                     */

    struct {
      __IOM uint32_t TVRGCLVVREFTRIM : 7;       /*!< TVRGCLV Voltage Reference Generator trim (bottom transistor)              */
      __IOM uint32_t TVRGCLVTEMPCOTRIM : 5;     /*!< TVRGCLV tempco trim init value                                            */
      __IOM uint32_t TVRGCLVSELVREF : 1;        /*!< TVRGCLV sel vref init value                                               */
      __IOM uint32_t TVRGCLVPDNB : 1;           /*!< TVRGCLV pdnb init value                                                   */
      __IOM uint32_t TVRGCLVHSENRESDIV : 1;     /*!< TVRGCLV hsenable resdiv init value                                        */
      __IOM uint32_t TVRGCLVCURRENTTRIM : 1;    /*!< TVRGCLV Current trim init value                                           */
            uint32_t            : 16;
    } VREFGEN3_b;
  } ;

  union {
    __IOM uint32_t VREFGEN4;                    /*!< Voltage Reference Generator 4 Control                                     */

    struct {
      __IOM uint32_t TVRGFVREFTRIM : 7;         /*!< TVRGF Voltage Reference Generator trim (bottom transistor)                */
      __IOM uint32_t TVRGFTEMPCOTRIM : 5;       /*!< TVRGF tempo trim init value                                               */
      __IOM uint32_t TVRGFSELVREF : 1;          /*!< TVRGF sel vref init value                                                 */
      __IOM uint32_t TVRGFPWLTEMPCOTRIM : 5;    /*!< Calibrated Voltage Reference Generator pwl tc trim (bottom transistor)    */
      __IOM uint32_t TVRGFPDNB  : 1;            /*!< TVRGF pdnb init value                                                     */
      __IOM uint32_t TVRGFHSENRESDIV : 1;       /*!< TVRGF hsenable resdiv init value                                          */
      __IOM uint32_t TVRGFCURRENTTRIM : 1;      /*!< TVRGF Current trim init value                                             */
            uint32_t            : 11;
    } VREFGEN4_b;
  } ;

  union {
    __IOM uint32_t VREFGEN5;                    /*!< Voltage Reference Generator 5 Control                                     */

    struct {
      __IOM uint32_t TVRGSVREFTRIM : 7;         /*!< TVRGS Voltage Reference Generator trim (bottom transistor)                */
      __IOM uint32_t TVRGSTEMPCOTRIM : 5;       /*!< TVRGS tempo trim init value                                               */
      __IOM uint32_t TVRGSSELVREF : 1;          /*!< TVRGS sel vref init value                                                 */
      __IOM uint32_t TVRGSPWLTEMPCOTRIM : 5;    /*!< Calibrated Voltage Reference Generator pwl tc trim (bottom transistor)    */
      __IOM uint32_t TVRGSPDNB  : 1;            /*!< TVRGS pdnb init value                                                     */
      __IOM uint32_t TVRGSHSENRESDIV : 1;       /*!< TVRGS hsenable resdiv init value                                          */
      __IOM uint32_t TVRGSCURRENTTRIM : 1;      /*!< TVRGS Current trim init value                                             */
            uint32_t            : 11;
    } VREFGEN5_b;
  } ;

  union {
    __IOM uint32_t VREFBUF;                     /*!< Voltage Reference BUF Control                                             */

    struct {
      __IOM uint32_t VREFBUFVOLTTRIM : 6;       /*!< VREFBUF voltage trim init value                                           */
      __IOM uint32_t VREFBUFPDNB : 1;           /*!< VREGBUF pdnb init value                                                   */
      __IOM uint32_t VREFBUFMISCTRIM : 6;       /*!< VREFBUF MISC trim init value                                              */
      __IOM uint32_t VREFBUFIBIASTRIM : 1;      /*!< VREFBUFIBIAS trim init value                                              */
      __IOM uint32_t VREFBUFCCOMPTRIM : 3;      /*!< VREFBUF ccomp trim init value                                             */
            uint32_t            : 15;
    } VREFBUF_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t VRCTRL;                      /*!< Overrides for Voltage Regulators Controls                                 */

