zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t BODLRDE    : 1;            /*!< Disable Unregulated 1.8V Brown-out reset.                                 */
      __IOM uint32_t BODCREN    : 1;            /*!< Disable VDDC Brown Out reset.                                             */
      __IOM uint32_t BODFREN    : 1;            /*!< Disable VDDF Brown Out reset.                                             */
      __IOM uint32_t BODSREN    : 1;            /*!< Disable VDDS Brown Out reset.                                             */
      __IOM uint32_t BODCLVREN  : 1;            /*!< Disable VDDC_LV Brown Out reset.                                          */
            uint32_t            : 27;
    } BODISABLE_b;
  } ;

  union {
    __IOM uint32_t D2ASPARE;                    /*!< Spare registers to analog module                                          */

    struct {
            uint32_t            : 8;
      __IOM uint32_t SIMOVDDCBOOST : 1;         /*!< SIMOBUCK VDDC boost.                                                      */
            uint32_t            : 6;
      __IOM uint32_t MEMLDOREF  : 2;            /*!< Memory LDO reference trim.                                                */
            uint32_t            : 4;
      __IOM uint32_t PLLISOLATIONVDDHVDDF : 1;  /*!< Setting this bit to 1 pulls the two power supply inputs of the
                                                     PLL block to ground ensuring that PLL signals are not able
                                                     to float to mid-scale levels and cause unnecessary current
                                                     flow to downstream logic. This bit must only be enabled
                                                     while the PLL is disabled. If the PLL is enabled while
                                                     the isolation bit is enabled, a leakage path may occur
                                                     from VDDH and VDDF to ground, which may result in EM damage.              */
      __IOM uint32_t UART0PLL   : 1;            /*!< PLL clock for UART0 enable field. This bit is set to select
                                                     the System PLL as the clock source for UART0. The UART0
                                                     PCLK is always on when set.                                               */
      __IOM uint32_t UART1PLL   : 1;            /*!< PLL clock for UART1 enable field. This bit is set to select
                                                     the System PLL as the clock source for UART1. The UART1
                                                     PCLK is always on when set.                                               */
      __IOM uint32_t UART2PLL   : 1;            /*!< PLL clock for UART2 enable field. This bit is set to select
                                                     the System PLL as the clock source for UART2. The UART2
                                                     PCLK is always on when set.                                               */
      __IOM uint32_t UART3PLL   : 1;            /*!< PLL clock for UART3 enable field. This bit is set to select
                                                     the System PLL as the clock source for UART3. The UART3
                                                     PCLK is always on when set.                                               */
            uint32_t            : 5;
      __IOM uint32_t INFO1ACCESS : 1;           /*!< For Apollo510 revB1 or later, this bit must be set for reliable
                                                     INFO1 access.                                                             */
    } D2ASPARE_b;
  } ;
  __IM  uint32_t  RESERVED13;

  union {
    __IOM uint32_t BOOTLOADER;                  /*!< Bootloader and secure boot functions                                      */

    struct {
      __IOM uint32_t RSVD0      : 1;            /*!< This field is reserved and must not be modified.                          */
      __IOM uint32_t SBRLOCK    : 1;            /*!< Secure boot ROM lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
      __IOM uint32_t PROTLOCK   : 1;            /*!< Flash protection lock. Always resets to 1, write 1 to clear.
                                                     Enables writes to flash protection register set.                          */
      __IOM uint32_t SBLLOCK    : 1;            /*!< Secure boot loader lock. Always resets to 1, write 1 to clear.
                                                     Enables system visibility to bootloader until set.                        */
            uint32_t            : 22;
      __IOM uint32_t SECBOOTFEATURE : 2;        /*!< Indicates whether the secure boot feature is enabled.                     */
      __IOM uint32_t SECBOOT    : 2;            /*!< Indicates whether the secure boot on cold reset is enabled                */
      __IOM uint32_t SECBOOTONRST : 2;          /*!< Indicates whether the secure boot on warm reset is enabled                */
    } BOOTLOADER_b;
  } ;

  union {
    __IOM uint32_t SHADOWVALID;                 /*!< Register to indicate whether the shadow registers have been
                                                     successfully loaded from the Flash Information Space.                     */

    struct {
      __IOM uint32_t VALID      : 1;            /*!< Indicates whether the shadow registers contain valid data from
                                                     the Flash Information Space.                                              */
            uint32_t            : 2;
      __IOM uint32_t INFO1SELOTP : 1;           /*!< Select OTP Info1 or MRAM Info1.                                           */
      __IOM uint32_t INFO0SELOTP : 1;           /*!< Select OTP Info0 or MRAM Info0.                                           */
            uint32_t            : 1;
      __IOM uint32_t OTPREADY   : 1;            /*!< Whether OTP is ready for access                                           */
      __IOM uint32_t OTPBOOTFAULT : 6;          /*!< OTP interrupt status during shadow copy                                   */
            uint32_t            : 19;
    } SHADOWVALID_b;
  } ;

  union {
    __IOM uint32_t SCRATCH0;                    /*!< This register reserved for Ambiq INTERNAL use only. Do not modify.        */

