zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< Key register value.                                                       */
    } KEXTCLKSEL_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK0;                   /*!< This WRITE_ONLY register controls various buck parameters. It
                                                     will read back as 0x00000000.                                             */

    struct {
      __IOM uint32_t VDDCRXCOMPEN : 1;          /*!< Enable the VDDC rail.                                                     */
      __IOM uint32_t VDDFRXCOMPEN : 1;          /*!< Enable the VDDS rail.                                                     */
      __IOM uint32_t VDDSRXCOMPEN : 1;          /*!< Enable the VDDS rail.                                                     */
      __IOM uint32_t VDDCLVRXCOMPEN : 1;        /*!< Enable the VDDC LV rail.                                                  */
      __IOM uint32_t TONTOFFNODEGLITCH : 1;     /*!< Enable the ton and toff signals no deglitch output.                       */
            uint32_t            : 27;
    } SIMOBUCK0_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK1;                   /*!< 1. Control the even division of 3 clocks: refresh, low power
                                                     and TONCLK. 2. Control gap bewteen secondary switches.
                                                     3. Debug features: control the amount of time TONCLK is
                                                     on, and the time before snubber asserts for each buck sequence.
                                                     4. Enable or disable the observation bus. 5. Select the
                                                     buck sequence operation mode. 6. Control delay between
                                                     primary Pmos and Nmos transitions.                                        */

    struct {
      __IOM uint32_t ACTFBEN    : 1;            /*!< DEPRECATED                                                                */
      __IOM uint32_t COARSESEL  : 1;            /*!< DEPRECATED                                                                */
      __IOM uint32_t DCMMODEEN  : 1;            /*!< DEPRECATED                                                                */
      __IOM uint32_t FORCETONCLKEN : 1;         /*!< TONCLK is active only when needed to save power. This keeps
                                                     the clock always on (AON). Set before simobuck comes up.                  */
      __IOM uint32_t LPFBEN     : 1;            /*!< DEPRECATED                                                                */
      __IOM uint32_t RXCLKACTSEL : 1;           /*!< DEPRECATED                                                                */
      __IOM uint32_t RXCLKACTTRIM : 5;          /*!< This divides the 5 MHz refresh clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
      __IOM uint32_t RXCLKLPTRIM : 5;           /*!< This divides the 32 kHz low power clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
      __IOM uint32_t OBSMODE    : 2;            /*!< Choose from 4 modes of operation                                          */
      __IOM uint32_t RXSCHEDULINGCODE : 2;      /*!< DEPRECATED                                                                */
      __IOM uint32_t WSELDELAYTRIM : 1;         /*!< DEPRECATED                                                                */
      __IOM uint32_t WSELVDDSBSMODE : 1;        /*!< DEPRECATED                                                                */
      __IOM uint32_t TONCLKTRIM : 4;            /*!< This divides the 100 MHz ton clock. Even divides are supported
                                                     only. This value represents the division amount minus 1.                  */
      __IOM uint32_t TPNDTRIM   : 2;            /*!< Control delay between primary Pmos and Nmos transitions.                  */
      __IOM uint32_t FORCEBUCKOFF : 1;          /*!< Control the buck sequence stopping point before snubber asserts.
                                                     Set before simobuck comes up.                                             */
      __IOM uint32_t BUCKMODE   : 1;            /*!< The buck sequence can operate in two buck sequence modes: default
                                                     (zxcomp) and backup. Set before simobuck comes up.                        */
      __IOM uint32_t SIMOBUCKOBSEN : 1;         /*!< Enable the simobuck observation bus output.                               */
      __IOM uint32_t SIMOBUCKHPTRIMEN : 1;      /*!< Enable the simobuck HP mode trim                                          */
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< SIMO Buck Muxed VDDC Active Sequence Trim Control                         */

    struct {
      __IOM uint32_t VDDCACTDRVSTRTRIM : 2;     /*!< VDDC active trim control for drive strength.                              */
            uint32_t            : 4;
      __IOM uint32_t VDDCACTHIGHTOFFTRIM : 5;   /*!< VDDC active high toff trim control for Buck sequence.                     */
      __IOM uint32_t VDDCACTHIGHTONTRIM : 5;    /*!< VDDC active high ton trim control for Buck sequence.                      */
            uint32_t            : 4;
      __IOM uint32_t VDDCACTLOWTOFFTRIM : 5;    /*!< VDDC active low toff trim control for Buck sequence.                      */
      __IOM uint32_t VDDCACTLOWTONTRIM : 5;     /*!< VDDC active high ton trim control for Buck sequence.                      */
            uint32_t            : 2;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< SIMO Buck Muxed VDDC low power Sequence Trim Control                      */

