zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t VDDCLEAKAGETRIM : 2;       /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDCLPDRVSTRTRIM : 2;      /*!< VDDC LP trim control for drive strength.                                  */
      __IOM uint32_t VDDCLPHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDCLPHIGHTOFFTRIM : 5;    /*!< VDDC LP high toff trim control for Buck sequence.                         */
      __IOM uint32_t VDDCLPHIGHTONTRIM : 5;     /*!< VDDC LP high ton trim control for Buck sequence.                          */
      __IOM uint32_t VDDCLPLOWTOFFTRIMFINE : 4; /*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDCLPLOWTOFFTRIM : 5;     /*!< VDDC LP low toff trim control for Buck sequence.                          */
      __IOM uint32_t VDDCLPLOWTONTRIM : 5;      /*!< VDDC LP low ton trim control for Buck sequence.                           */
    } SIMOBUCK3_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< SIMO Buck Muxed VDDC LV Active Sequence Trim Control                      */

    struct {
      __IOM uint32_t VDDCLVACTDRVSTRTRIM : 2;   /*!< VDDC LV active trim control for drive strength.                           */
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                            */
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIM : 5; /*!< VDDC LV active high toff trim control for Buck sequence.                  */
      __IOM uint32_t VDDCLVACTHIGHTONTRIM : 5;  /*!< VDDC LV active high ton trim control for Buck sequence.                   */
      __IOM uint32_t VDDCLVACTLOWTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                             */
      __IOM uint32_t VDDCLVACTLOWTOFFTRIM : 5;  /*!< VDDC LV active low trim control for a 500 MHz clock inside the
                                                     simobuck analog design.                                                   */
      __IOM uint32_t VDDCLVACTLOWTONTRIM : 5;   /*!< VDDC LV active low ton trim control for Buck sequence.                    */
      __IOM uint32_t VDDCLVINPREFSEL : 1;       /*!< DEPRECATED                                                                */
            uint32_t            : 1;
    } SIMOBUCK4_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK5;                   /*!< SIMO Buck Muxed VDDC LV Low PowerSequence Trim Control                    */

    struct {
      __IOM uint32_t VDDCLVLEAKAGETRIM : 2;     /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDCLVLPDRVSTRTRIM : 2;    /*!< VDDC LV low power trim control for drive strength.                        */
      __IOM uint32_t VDDCLVLPHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                             */
      __IOM uint32_t VDDCLVLPHIGHTOFFTRIM : 5;  /*!< VDDC LV low power high toff trim control for Buck sequence.               */
      __IOM uint32_t VDDCLVLPHIGHTONTRIM : 5;   /*!< VDDC LV low power high ton trim control for Buck sequence.                */
      __IOM uint32_t VDDCLVLPLOWTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                              */
      __IOM uint32_t VDDCLVLPLOWTOFFTRIM : 5;   /*!< VDDC LV low power low toff trim control for Buck sequence.                */
      __IOM uint32_t VDDCLVLPLOWTONTRIM : 5;    /*!< VDDC LV low power high ton trim control for Buck sequence.                */
    } SIMOBUCK5_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< SIMO Buck Muxed VDDF Active Sequence Trim Control                         */

    struct {
      __IOM uint32_t VDDFACTDRVSTRTRIM : 2;     /*!< VDDF active high toff trim for drive strength.                            */
      __IOM uint32_t VDDFACTFBTRIM : 6;         /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDFACTHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                              */
      __IOM uint32_t VDDFACTHIGHTOFFTRIM : 5;   /*!< VDDF active high toff trim control for Buck sequence.                     */
      __IOM uint32_t VDDFACTHIGHTONTRIM : 5;    /*!< VDDF active high ton trim control for Buck sequence.                      */
      __IOM uint32_t VDDFACTINPREFSEL : 1;      /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDFACTTRIM : 6;           /*!< VDDF active trim.                                                         */
      __IOM uint32_t VDDFINPREFSEL : 1;         /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDFLEAKAGETRIM : 2;       /*!< DEPRECATED                                                                */
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< SIMO Buck Muxed VDDF active Sequence Trim Control                         */

    struct {
      __IOM uint32_t VDDFACTLOWTOFFTRIMFINE : 3;/*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDFACTLOWTOFFTRIM : 5;    /*!< VDDF active low toff trim control for Buck sequence.                      */
      __IOM uint32_t VDDFACTLOWTONTRIM : 5;     /*!< VDDF active low ton trim control for Buck sequence.                       */
      __IOM uint32_t VDDFLPDRVSTRTRIM : 2;      /*!< VDDF active trim control for drive strength.                              */
      __IOM uint32_t VDDFLPFBCDACEN : 1;        /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDFLPFBCDACTRIM : 2;      /*!< DEPRECATED                                                                */
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< Zxcomp trim. Feedthrough to analog.                                       */
      __IOM uint32_t VDDFLPINPREFSEL : 2;       /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDFLPTRIM : 6;            /*!< VDDF low power trim.                                                      */
            uint32_t            : 1;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< SIMO Buck Muxed VDDF Low Power Sequence Trim Control                      */

