zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t VDDFCOMPTRIMMINUS : 5;     /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDFCOMPTRIMPLUS : 5;      /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDFBRNOUTTRIM : 10;       /*!< Digital Brown out max counter value for VDDF rail.                        */
      __IOM uint32_t VDDCLVLKGTRIM : 2;         /*!< Leakage trim for vddc lv.                                                 */
      __IOM uint32_t VDDCLVLKGEN : 1;           /*!< Leakage vddc lv rail enable. Set before simobuck comes up.                */
      __IOM uint32_t VDDSLKGTRIM : 2;           /*!< Leakage trim for vdds.                                                    */
      __IOM uint32_t VDDSLKGEN  : 1;            /*!< Leakage vdds rail enable. Set before simobuck comes up.                   */
      __IOM uint32_t VDDFLKGTRIM : 2;           /*!< Leakage trim for vddf.                                                    */
      __IOM uint32_t VDDFLKGEN  : 1;            /*!< Leakage vddf rail enable. Set before simobuck comes up.                   */
      __IOM uint32_t VDDCLKGTRIM : 2;           /*!< Leakage trim for vddc.                                                    */
      __IOM uint32_t VDDCLKGEN  : 1;            /*!< Leakage vddc rail enable. Set before simobuck comes up.                   */
    } SIMOBUCK14_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< SIMO Buck Compare, Brown out, Active and Low power Trim Control           */

    struct {
      __IOM uint32_t VDDCCOMPTRIMMINUS : 5;     /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCCOMPTRIMPLUS : 5;      /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDCBRNOUTTRIM : 10;       /*!< Digital brown out max counter value for VDDC rail.                        */
      __IOM uint32_t VDDCLVRXCOMPTRIMEN : 1;    /*!< Enable the VDDC LV rail. If not enabled, the rail will not be
                                                     regulated. This must be done before simobuck comes up.                    */
      __IOM uint32_t VDDSRXCOMPTRIMEN : 1;      /*!< Enable the VDDS rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t VDDFRXCOMPTRIMEN : 1;      /*!< Enable the VDDF rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t VDDCRXCOMPTRIMEN : 1;      /*!< Enable the VDDC rail. If not enabled, the rail will not be regulated.
                                                     This must be done before simobuck comes up.                               */
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< Zxcomp offset trim. Feedthrough to analog.                                */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< Override / Bypass the simobuck trim latch to enable on-the-fly
                                                     trimming for VDDF and VDDS active and LP trims                            */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< PWRSW Control 0                                                           */

    struct {
      __IOM uint32_t PWRSWVDDCPUDYNSEL : 2;     /*!< override value for pwrsw_vddcpu_dynsel                                    */
      __IOM uint32_t PWRSWVDDCPUPGN : 1;        /*!< override value for pwrsw_vddcpu_pgn                                       */
      __IOM uint32_t PWRSWVDDCPUOVERRIDE : 1;   /*!< override enable for pwrsw_vddcpu_dynsel and pgn                           */
      __IOM uint32_t PWRSWVDDCAORDYNSEL : 2;    /*!< override value for pwrsw_vddcaor_dynsel                                   */
      __IOM uint32_t PWRSWVDDCAOROVERRIDE : 1;  /*!< override enable for pwrsw_vddcaor_dynsel                                  */
      __IOM uint32_t PWRSWVDDCAORPGN : 1;       /*!< override enable for pwrsw_vddcaor_pgn                                     */
            uint32_t            : 7;
      __IOM uint32_t PWRSWVDDMCPUDYNSEL : 1;    /*!< override value for pwrsw_vddmcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDMCPUSTATSEL : 1;   /*!< VDDMCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDMCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddmcpu_dynsel                                  */
            uint32_t            : 6;
      __IOM uint32_t PWRSWVDDMLDYNSEL : 1;      /*!< override value for pwrsw_vddml_dynsel                                     */
      __IOM uint32_t PWRSWVDDMLSTATSEL : 1;     /*!< VDDML power switch static select                                          */
      __IOM uint32_t PWRSWVDDMLOVERRIDE : 1;    /*!< override enable for pwrsw_vddml_dynsel                                    */
      __IOM uint32_t PWRSWVDDRCPUDYNSEL : 1;    /*!< override value for pwrsw_vddrcpu_dynsel                                   */
            uint32_t            : 1;
      __IOM uint32_t PWRSWVDDRCPUPGN : 1;       /*!< override value for pwrsw_vddrcpu_pgn                                      */
      __IOM uint32_t PWRSWVDDRCPUSTATSEL : 1;   /*!< VDDRCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDRCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddrcpu_dynsel and pgn                          */
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< PWRSW Control 1                                                           */

