zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t SRAMRPROT5 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT5_b;
  } ;
  __IM  uint32_t  RESERVED23[10];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< Audio ADC Power Control                                                   */

    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< Audio ADC Power Control Software Override Enable                          */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< Enable the Global audio ADC Power Switch on when set to 1 if
                                                     the AUDADCPWRCTRLSWE bit is set.                                          */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< Enable the Analog, IO and SAR Digital logic Power Switch on
                                                     when set to 1 if the AUDADCPWRCTRLSWE bit is set.                         */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< Reference Buffer Power Switch Enable                                      */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< Reference Buffer Keeper Power Switch Enable                               */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN is
                                                     switched off )                                                            */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< ISOLATE signal for audio ADC Digital Contoller ( when AUDADCAPSEN
                                                     is switched off and if the AUDADCPWRCTRLSWE bit is set)                   */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE bit
                                                     is set )                                                                  */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< Audio ADC input buffer mux select                                         */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< Audio ADC reference buffer slew enable                                    */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< Audio ADC reference keeper out en                                         */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< Audio trims 1                                                             */

    struct {
      __IOM uint32_t MICBIASMISCTRIM : 6;       /*!< micbias_misc_trim                                                         */
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< micbias_voltage_trim                                                      */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< micbias_pdnb                                                              */
            uint32_t            : 3;
      __IOM uint32_t PGAADCIFIBIASINTRIM : 1;   /*!< pgaadcif_ibias_in_trim                                                    */
      __IOM uint32_t PGAADCIFIBIASOUTTRIM : 3;  /*!< pgaadcif_ibias_out_trim                                                   */
      __IOM uint32_t PGAADCIFCCOMPTRIM : 2;     /*!< pgaadcif_ccomp_trim                                                       */
            uint32_t            : 10;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED24;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< PGA ADCIF control                                                         */

    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< pgaadcif_chA_active                                                       */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< pgaadcif_chA_pdnb                                                         */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< pgaadcif_chB_active                                                       */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< pgaadcif_chB_pdnb                                                         */
      __IOM uint32_t PGAADCIFTESTPADEN : 1;     /*!< pgaadcif_testpad_en                                                       */
      __IOM uint32_t PGAADCIFTESTPADSEL : 3;    /*!< pgaadcif_testpad_sel                                                      */
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< pgaadcif_vcomp_en                                                         */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< pgaadcif_vcomp_sel                                                        */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< PGA control 1                                                             */

