zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< d2a_pga_chA0_gain1_sel_vddh                                               */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< d2a_pga_chA0_gain2_div2_sel_vddh                                          */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< d2a_pga_chA0_gain2_sel_vddh                                               */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< d2a_pga_chA1_gain1_sel_vddh                                               */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< d2a_pga_chA1_gain2_div2_sel_vddh                                          */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< d2a_pga_chA1_gain2_sel_vddh                                               */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< d2a_pga_chA_bypass_en_vddh                                                */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< d2a_pga_chA_opamp_in_pdnb_vddh                                            */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< d2a_pga_chA_opamp_out_pdnb_vddh                                           */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< d2a_pga_chA_vcmgen_pdnb_vddh                                              */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< d2a_pga_chA_vcmgen_qcharge_en_vddh                                        */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< d2a_pga_irefgen_pdnb_vddh                                                 */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< d2a_pga_vrefgen_pdnb_vddh                                                 */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< d2a_pga_vrefgen_quickstart_en_vddh                                        */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< d2a_vcomp_sel_pga_vddh                                                    */
            uint32_t            : 1;
      __IOM uint32_t PGAGAINAOVRD : 1;          /*!< Apply BYPASS and GAIN bits from this register (for channel A)
                                                     instead of automatically via audio ADC. Note that audio
                                                     ADC FIFO meta data will not reflect dB gain as used when
                                                     configuring audio ADC.                                                    */
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< PGA control 2                                                             */

    struct {
      __IOM uint32_t PGACHB0GAIN1SEL : 3;       /*!< d2a_pga_chB0_gain1_sel_vddh                                               */
      __IOM uint32_t PGACHB0GAIN2DIV2SEL : 1;   /*!< d2a_pga_chB0_gain2_div2_sel_vddh                                          */
      __IOM uint32_t PGACHB0GAIN2SEL : 5;       /*!< d2a_pga_chB0_gain2_sel_vddh                                               */
      __IOM uint32_t PGACHB1GAIN1SEL : 3;       /*!< d2a_pga_chB1_gain1_sel_vddh                                               */
      __IOM uint32_t PGACHB1GAIN2DIV2SEL : 1;   /*!< d2a_pga_chB1_gain2_div2_sel_vddh                                          */
      __IOM uint32_t PGACHB1GAIN2SEL : 5;       /*!< d2a_pga_chB1_gain2_sel_vddh                                               */
      __IOM uint32_t PGACHBBYPASSEN : 2;        /*!< d2a_pga_chB_bypass_en_vddh                                                */
      __IOM uint32_t PGACHBOPAMPINPDNB : 2;     /*!< d2a_pga_chB_opamp_in_pdnb_vddh                                            */
      __IOM uint32_t PGACHBOPAMPOUTPDNB : 2;    /*!< d2a_pga_chB_opamp_out_pdnb_vddh                                           */
      __IOM uint32_t PGACHBVCMGENPDNB : 1;      /*!< d2a_pga_chB_vcmgen_pdnb_vddh                                              */
      __IOM uint32_t PGACHBVCMGENQCHARGEEN : 1; /*!< d2a_pga_chB_vcmgen_qcharge_en_vddh                                        */
            uint32_t            : 5;
      __IOM uint32_t PGAGAINBOVRD : 1;          /*!< Apply BYPASS and GAIN bits from this register (for channel B)
                                                     instead of automatically via audio ADC. Note that audio
                                                     ADC FIFO meta data will not reflect dB gain as used when
                                                     configuring audio ADC.                                                    */
    } PGACTRL2_b;
  } ;

  union {
    __IOM uint32_t AUDADCPWRDLY;                /*!< Audio ADC Power Up Delay Control                                          */

    struct {
      __IOM uint32_t AUDADCPWR0 : 8;            /*!< ADC Reference Buffer Power Enable delay in 64 ADC CLK increments
                                                     for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
      __IOM uint32_t AUDADCPWR1 : 8;            /*!< ADC Reference Keeper enable delay in 16 ADC CLK increments for
                                                     ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
            uint32_t            : 16;
    } AUDADCPWRDLY_b;
  } ;
  __IM  uint32_t  RESERVED25[2];

  union {
    __IOM uint32_t SDIO0CTRL;                   /*!< SDIO0/eMMC Control                                                        */

    struct {
      __IOM uint32_t SDIO0SYSCLKEN : 1;         /*!< SDIO0 system clock enable.                                                */
      __IOM uint32_t SDIO0XINCLKEN : 1;         /*!< SDIO0 serial clock source enable.                                         */
      __IOM uint32_t SDIO0ITAPCHGWIN : 1;       /*!< This is used to gate the output of the Tap Delay lines so as
                                                     to avoid glithches being propagated into the Core. This
                                                     signal should be asserted few clocks before the itapdlysel
                                                     changes and should be asserted for few clocks after.                      */
      __IOM uint32_t SDIO0ITAPDLYENA : 1;       /*!< Used to enable selective Tap delay line on the Looped back SD
                                                     Clock (rxclk_in). This signal along with the itapdlysel[4:0]
                                                     selects the the amount of delay to be inserted on the line.
                                                     When Tuning is enabled (for SDR104 and optionally for SDR50),
                                                     this signal is ignored and internalcontrols are used instead.
                                                     This should not be asserted when operating in DS mode.                    */
      __IOM uint32_t SDIO0ITAPDLYSEL : 5;       /*!< Selects one of the 32 Taps on the rxclk_in line. This is effective
                                                     only when itapdlyena is asserted and Tuning is not enabled.               */
      __IOM uint32_t SDIO0OTAPDLYENA : 1;       /*!< Used to enable the selective Tap delay on the sdcard_clk so
                                                     as to generate the delayed sdcard_clk. This is used to
                                                     latch the CMD/DAT outputs to generate delay on them w.r.t
                                                     CLK going out. This signal along with otapdlysel[3:0] selects
                                                     the amount of delay to be inserted on the Clock line. This
                                                     signal should not be asserted when operating in DS mode.                  */
      __IOM uint32_t SDIO0OTAPDLYSEL : 4;       /*!< Selects one of the 16 Taps on the sdcard_clk. This is effective
                                                     only when otapdlyena is asserted.                                         */
      __IOM uint32_t SDIO0ASYNCWKUPENA : 1;     /*!< SDIO0 asynchronous wakeup mode. 0: Synchronous wakeup mode,
                                                     1: Asynchronous wakeup mode                                               */
      __IOM uint32_t SDIO0XINCLKSEL : 2;        /*!< Select clock source for SDIO0 xin_clk.                                    */
      __IOM uint32_t SDIO0CMDOPENDRAINEN : 1;   /*!< SDIO0 CMD line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
      __IOM uint32_t SDIO0DATOPENDRAINEN : 1;   /*!< SDIO0 DAT line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
            uint32_t            : 13;
    } SDIO0CTRL_b;
  } ;

  union {
    __IOM uint32_t SDIO1CTRL;                   /*!< SDIO1/eMMC Control                                                        */

