zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FR7BITS    : 32;           /*!< Copy (read) protect flash 0x00380000 - 0x003FFFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT7_b;
  } ;

  union {
    __IOM uint32_t PWRSW2;                      /*!< PWRSW Control 2                                                           */

    struct {
      __IOM uint32_t PWRSWVDDGFXDYNSEL : 1;     /*!< override value for pwrsw_vddgfx_dynsel                                    */
      __IOM uint32_t PWRSWVDDGFXSTATSEL : 1;    /*!< override value for pwrsw_vddgfx_statsel                                   */
      __IOM uint32_t PWRSWVDDGFXOVERRIDE : 1;   /*!< override enable for pwrsw_vddgfx_dynsel and pgn                           */
            uint32_t            : 29;
    } PWRSW2_b;
  } ;

  union {
    __IOM uint32_t CPUCFG;                      /*!< CPU config                                                                */

    struct {
      __IOM uint32_t INITTCMDIS : 2;            /*!< INIT TCM disable                                                          */
      __IOM uint32_t INITPAHBDIS : 1;           /*!< InitPAHB disable                                                          */
      __IOM uint32_t INITL1RSTDIS : 1;          /*!< Init L1 reset diable                                                      */
      __IOM uint32_t CFGNSSTCALIB : 26;         /*!< CFGNSST calib value                                                       */
            uint32_t            : 2;
    } CPUCFG_b;
  } ;
  __IM  uint32_t  RESERVED27[2];

  union {
    __IOM uint32_t PLLCTL0;                     /*!< This register controls power down and enable for various features
                                                     of the system PLL                                                         */

    struct {
      __IOM uint32_t FOUTVCOPD  : 1;            /*!< System PLL VCO rate output clock power down, connected to PLL
                                                     pin FOUTVCOPD                                                             */
      __IOM uint32_t FOUTPOSTDIVPD : 1;         /*!< System PLL post divider power down, connected to PLL pin FOUTPOSTDIVPD.
                                                     Must enable when using 4-phase outputs                                    */
      __IOM uint32_t FOUT4PHASEPD : 1;          /*!< System PLL 4-phase clock generator power down, connected to
                                                     PLL pin FOUT4PHASEPD                                                      */
      __IOM uint32_t DSMPD      : 1;            /*!< System PLL DSM (delta-sigma modulator) power down, connected
                                                     to PLL pin DSMPD                                                          */
      __IOM uint32_t DACPD      : 1;            /*!< System PLL noise canceling DAC power down, connected to PLL
                                                     pin DACPD                                                                 */
      __IOM uint32_t FREFSEL    : 1;            /*!< System PLL reference clock select, connected to PLL pin FREF              */
            uint32_t            : 2;
      __IOM uint32_t BYPASS     : 1;            /*!< System PLL bypass, connected to PLL pin BYPASS                            */
      __IOM uint32_t VCOSELECT  : 1;            /*!< System PLL VCO range select, connected to PLL pin VCOSEL                  */
            uint32_t            : 19;
      __IOM uint32_t SYSPLLPDB  : 1;            /*!< System PLL enable. When the PLL is enabled, SW must ensure that
                                                     the PLL receives adequate current by forcing the LDO to
                                                     be in active mode: SIMOBUCKACTIVE = 1 (in BUCK mode), MEMLDOACTIVE
                                                     = 1 (in LDO mode).                                                        */
      __IOM uint32_t SYSPLLVDDHPDNB : 1;        /*!< System PLL VDDH enable                                                    */
      __IOM uint32_t SYSPLLVDDFPDNB : 1;        /*!< System PLL VDDF enable                                                    */
    } PLLCTL0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV0;                     /*!< This register sets the fractional portion of the feedback divider
                                                     when the system PLL is in fractional mode. Refer to the
                                                     PLLTS22ULPHVLPFRACA datasheet for more details                            */

    struct {
      __IOM uint32_t FRAC       : 24;           /*!< System PLL feedback divide value (fractional portion), connected
                                                     to PLL pin FRAC[23:0]. Do not change FRAC while the clock
                                                     is in use as it can make the clock unstable. First disable
                                                     the clock, change FRAC, and then enable the clock                         */
            uint32_t            : 8;
    } PLLDIV0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV1;                     /*!< This register sets the integer portion of the feedback divider
                                                     along with the other dividers in the system PLL. Refer
                                                     to the PLLTS22ULPHVLPFRACA datasheet for more details                     */

    struct {
      __IOM uint32_t REFDIV     : 6;            /*!< System PLL reference divide value, connnected to PLL pin REFDIV[5:0].
                                                     Valid range is 1 to 63. A setting of 0 will send 1 to the
                                                     PLL                                                                       */
            uint32_t            : 2;
      __IOM uint32_t POSTDIV2   : 3;            /*!< System PLL post divide 2 setting, connected to PLL pin POSTDIV2[2:0].
                                                     Valid range is 1 to 7. A setting of 0 will send 1 to the
                                                     PLL. Total post divide is POSTDIV1*POSTDIV2. The value
                                                     of POSTDIV1 should be maximized before enabling POSTDIV2.                 */
            uint32_t            : 1;
      __IOM uint32_t POSTDIV1   : 3;            /*!< System PLL post divide 1 setting, connected to PLL pin POSTDIV1[2:0].
                                                     Valid range is 1 to 7. A setting of 0 will send 1 to the
                                                     PLL. Total post divide is POSTDIV1*POSTDIV2                               */
            uint32_t            : 1;
      __IOM uint32_t FBDIV      : 12;           /*!< System PLL feedback divide value, connected to PLL pin FBDIV[11:0].
                                                     Valid range is 10 to 960 in integer mode, 10 to 96 in fractional
                                                     mode. Do not change FBDIV while the clock is in use as
                                                     it can make the clock unstable. First disable the clock,
                                                     change FBDIV, and then enable the clock                                   */
            uint32_t            : 4;
    } PLLDIV1_b;
  } ;

  union {
    __IOM uint32_t PLLSTAT;                     /*!< This register indicates the system PLL status                             */

