zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t PIOMIXED   : 4;            /*!< Provides override controls for data operations where instruction,
                                                     address, and data may transfer in different rates.                        */
            uint32_t            : 28;
    } CTRL1_b;
  } ;

  union {
    __IOM uint32_t ADDR;                        /*!< Optional Address field to send for PIO transfers                          */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Optional Address field to send (after optional instruction field)
                                                     - qualified by ASIZE in CMD register. NOTE: This register
                                                     is aliased to DMADEVADDR.                                                 */
    } ADDR_b;
  } ;

  union {
    __IOM uint32_t INSTR;                       /*!< Optional Instruction field to send for PIO transfers                      */

    struct {
      __IOM uint32_t INSTR      : 16;           /*!< Optional Instruction field to send (1st byte) - qualified by
                                                     ISEND/ISIZE                                                               */
            uint32_t            : 16;
    } INSTR_b;
  } ;

  union {
    __IOM uint32_t TXFIFO;                      /*!< TX Data FIFO                                                              */

    struct {
      __IOM uint32_t TXFIFO     : 32;           /*!< Data to be transmitted. Data should normally be aligned to the
                                                     LSB (pad the upper bits with zeros) unless BIGENDIAN is
                                                     set.                                                                      */
    } TXFIFO_b;
  } ;

  union {
    __IOM uint32_t RXFIFO;                      /*!< RX Data FIFO                                                              */

    struct {
      __IOM uint32_t RXFIFO     : 32;           /*!< Receive data. Data is aligned to the LSB (padded zeros on upper
                                                     bits) unless BIGENDIAN is set.                                            */
    } RXFIFO_b;
  } ;

  union {
    __IOM uint32_t TXENTRIES;                   /*!< Number of words in TX FIFO                                                */

    struct {
      __IOM uint32_t TXENTRIES  : 6;            /*!< Number of 32-bit words/entries in TX FIFO                                 */
            uint32_t            : 26;
    } TXENTRIES_b;
  } ;

  union {
    __IOM uint32_t RXENTRIES;                   /*!< Number of words in RX FIFO                                                */

    struct {
      __IOM uint32_t RXENTRIES  : 6;            /*!< Number of 32-bit words/entries in RX FIFO                                 */
            uint32_t            : 26;
    } RXENTRIES_b;
  } ;

  union {
    __IOM uint32_t THRESHOLD;                   /*!< Threshold levels that trigger RXFull and TXEmpty interrupts               */

    struct {
      __IOM uint32_t TXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause TXF interrupt                     */
            uint32_t            : 2;
      __IOM uint32_t RXTHRESH   : 6;            /*!< Number of entries in TX FIFO that cause RXE interrupt                     */
            uint32_t            : 18;
    } THRESHOLD_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t MSPICFG;                     /*!< Timing configuration bits for the MSPI module. PRSTN, IPRSTN,
                                                     and FIFORESET can be used to reset portions of the MSPI
                                                     interface in order to clear error conditions. The remaining
                                                     bits control clock frequency and TX/RX capture timings.                   */

    struct {
      __IOM uint32_t APBCLK     : 1;            /*!< Enable continuous APB clock. For power-efficient operation,
                                                     APBCLK should be set to 0.                                                */
            uint32_t            : 3;
      __IOM uint32_t IOMSEL     : 4;            /*!< Selects which IOM is selected for CQ handshake status.                    */
            uint32_t            : 21;
      __IOM uint32_t FIFORESET  : 1;            /*!< Reset MSPI FIFO (active high). 1=reset FIFO, 0=normal operation.
                                                     May be used to manually flush the FIFO in error handling.                 */
      __IOM uint32_t IPRSTN     : 1;            /*!< IP block reset. Write to 0 to put the transfer module in reset
                                                     or 1 for normal operation. This may be required after error
                                                     conditions to clear the transfer on the bus.                              */
      __IOM uint32_t PRSTN      : 1;            /*!< Peripheral reset. Master reset to the entire MSPI module (DMA,
                                                     XIP, and transfer state machines). 1=normal operation,
                                                     0=in reset.                                                               */
    } MSPICFG_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t PADOUTEN;                    /*!< Enable bits for the MSPI output pads. Each active MSPI line
                                                     should be set to 1 in the OUTEN field below.                              */

    struct {
      __IOM uint32_t OUTEN      : 19;           /*!< Output pad enable configuration. Indicates which pads should
                                                     be driven. Bits [3:0] are Quad0 data. Bits [7:4] are Quad1
                                                     data. Bit [8] is clock. Bit [9] is BM/DQS. Bit [10:17]
                                                     are data for 16-bit. Bit[18] is BM/DQS for 16-bit.                        */
            uint32_t            : 11;
      __IOM uint32_t PADSET1    : 1;            /*!< Only applicable on mspi1. When set, use gpio95 .. gpio 104 as
                                                     the pads. This extra set of pads is to run mspi0 on HEX
                                                     and mspi1 concurrently. Note that the timing of this extra
                                                     pads may not be as good as the origianl pads.                             */
      __IOM uint32_t CLKOND4    : 1;            /*!< Output clock on MSPI data[4]                                              */
    } PADOUTEN_b;
  } ;

  union {
    __IOM uint32_t PADOVEREN;                   /*!< Enables PIO-like pad override control                                     */

