zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t EMULATEDDR0 : 1;           /*!< Drive external clock at 1/2 rate to emulate DDR mode                      */
      __IOM uint32_t QUADDDR0   : 1;            /*!< Deprecated. No effect on RevC.                                            */
      __IOM uint32_t ENABLEDQS0 : 1;            /*!< In EMULATEDDR mode, enable DQS for read capture                           */
      __IOM uint32_t DQSSYNCNEG0 : 1;           /*!< Use negative edge of clock for DDR data sync                              */
      __IOM uint32_t ENABLEFINEDELAY0 : 1;      /*!< Enables use of delay line to provide fine control over traditional
                                                     RX capture clock.                                                         */
      __IOM uint32_t TXDQSDELAY0 : 5;           /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default)                                                          */
      __IOM uint32_t RXDQSDELAY0 : 5;           /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default)                                                          */
      __IOM uint32_t RXDQSDELAYNEG0 : 5;        /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) of falling edge.                                         */
      __IOM uint32_t RXDQSDELAYNEGEN0 : 1;      /*!< When 1, RXDQSDELAYNEG is used for falling edge of the clock.              */
      __IOM uint32_t RXDQSDELAYHI0 : 5;         /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) for 2nd DQS on HEX mode.                                 */
      __IOM uint32_t RXDQSDELAYNEGHI0 : 5;      /*!< This acts as an offset to the computed value (should be set
                                                     to 0 by default) of falling edge for 2nd DQS on HEX mode.                 */
      __IOM uint32_t RXDQSDELAYHIEN0 : 1;       /*!< When 1, RXDQSDELAYHI and RXDQSDELAYNEGHI is used for falling
                                                     edge of the clock.                                                        */
    } DEV0DDR_b;
  } ;

  union {
    __IOM uint32_t DEV0CFG1;                    /*!< Timing and mode configuration bits for the MSPI module.                   */

    struct {
      __IOM uint32_t SFTURN0    : 4;            /*!< Subtract from internal counter of write latency and turnaround            */
      __IOM uint32_t RXCAPEXT0  : 1;            /*!< Specify the number of apb_clk of RX capture phse {RXCAPEXT,
                                                     RXCAP}                                                                    */
      __IOM uint32_t SCLKRXHALT0 : 1;           /*!< Halt sclk based on xfer_count                                             */
            uint32_t            : 1;
      __IOM uint32_t WBX0       : 1;            /*!< Enable the support of WBX ( page boundary crossing on write
                                                     )                                                                         */
      __IOM uint32_t RBX0       : 1;            /*!< Enable the support of RBX ( page boundary crossing on read )              */
      __IOM uint32_t RXSMP0     : 2;            /*!< Sampling edge based on sclk edge. No effect when div1                     */
      __IOM uint32_t HYPERIO0   : 1;            /*!< When using Windbond, set this bit to 1 to generate CA[47:0]
                                                     in hardware.                                                              */
      __IOM uint32_t TAFOURTH0  : 1;            /*!< Add 1/4th mspi_clk in DDR to turnaround. Recommended set this
                                                     to 1 when EMULATEDDR is set in non-DQS mode (ENABLEDQS
                                                     = 0).                                                                     */
      __IOM uint32_t RXHI0      : 1;            /*!< Force st_rx to start at clock high of mspi_clk                            */
      __IOM uint32_t DQSTURN0   : 3;            /*!< In DQS mode, the internal cycle count to enable DQS path.                 */
      __IOM uint32_t CELATENCY0 : 2;            /*!< Mem CE assertion latency before the first Mem transfer clock              */
            uint32_t            : 10;
      __IOM uint32_t TXDATADELAY0 : 1;          /*!< Delay TXDATA output by 1 clock cycle                                      */
      __IOM uint32_t SDR250EN0  : 1;            /*!< Enable MSPI core logic to run at the same frequency as its input
                                                     clock. This bit has no effect when DDREN is 1                             */
            uint32_t            : 1;
    } DEV0CFG1_b;
  } ;

  union {
    __IOM uint32_t DEV0XIP;                     /*!< When any SPI flash is configured, this register must be properly
                                                     programmed before XIP or AUTO DMA operations commence.                    */

    struct {
      __IOM uint32_t XIPEN0     : 1;            /*!< Enable the XIP (eXecute In Place) function which effectively
                                                     enables the address decoding of the MSPI device in the
                                                     flash/cache address space at address 0x04000000-0x07FFFFFF.               */
            uint32_t            : 1;
      __IOM uint32_t XIPACK0    : 2;            /*!< Controls transmission of Micron XIP acknowledge cycles (Micron
                                                     Flash devices only)                                                       */
      __IOM uint32_t XIPBIGENDIAN0 : 1;         /*!< Indicates whether XIP/AUTO DMA data transfers are in big or
                                                     little endian format                                                      */
      __IOM uint32_t XIPENTURN0 : 1;            /*!< Indicates whether XIP/AUTO DMA operations should enable TX->RX
                                                     turnaround cycles                                                         */
      __IOM uint32_t XIPSENDA0  : 1;            /*!< Indicates whether XIP/AUTO DMA operations should send an an
                                                     address phase (see DMADEVADDR register and ASIZE field
                                                     in CFG)                                                                   */
      __IOM uint32_t XIPSENDI0  : 1;            /*!< Indicates whether XIP/AUTO DMA operations should send an instruction
                                                     (see READINSTR field and ISIZE field in CFG)                              */
      __IOM uint32_t XIPMIXED0  : 4;            /*!< Provides override controls for data operations where instruction,
                                                     address, and data may transfer in different rates.                        */
      __IOM uint32_t XIPENDCX0  : 1;            /*!< Enable DCX signal on data [1] for XIP/DMA operations                      */
      __IOM uint32_t XIPENWLAT0 : 1;            /*!< Enable Write Latency counter for XIP write transactions                   */
      __IOM uint32_t XIPTURNAROUND0 : 6;        /*!< Number of turnaound cycles (for TX->RX transitions). Qualified
                                                     by XIPENTURN bit field.                                                   */
      __IOM uint32_t XIPWRITELATENCY0 : 6;      /*!< Number of write Latency cycles. Qualified by XIPENWLAT bit field.         */
            uint32_t            : 6;
    } DEV0XIP_b;
  } ;

  union {
    __IOM uint32_t DEV0INSTR;                   /*!< When any SPI flash is configured, this register must be properly
                                                     programmed before XIP or AUTO DMA operations commence.                    */

