zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t WRITEINSTR0 : 16;          /*!< Write command sent for DMA operations                                     */
      __IOM uint32_t READINSTR0 : 16;           /*!< Read command sent to flash for DMA/XIP operations                         */
    } DEV0INSTR_b;
  } ;

  union {
    __IOM uint32_t DEV0BOUNDARY;                /*!< Allows large transfers to be broken up into smaller ones in
                                                     hardware to accommodate needs of external devices and allow
                                                     XIP/XIPMM. Only applicable for memory-mapped devices (PSRAM,
                                                     Flash, etc) where address can be retransmitted without
                                                     side effects.                                                             */

    struct {
      __IOM uint32_t DMATIMELIMIT0 : 12;        /*!< DMA time limit. Can be used to limit the transaction time on
                                                     the MSPI bus. The count is in ~100 ns increments for the
                                                     96 MHz clock input. A value of 0 disables the counter.                    */
      __IOM uint32_t DMABOUND0  : 4;            /*!< DMA Address boundary                                                      */
            uint32_t            : 16;
    } DEV0BOUNDARY_b;
  } ;

  union {
    __IOM uint32_t DEV0SCRAMBLING;              /*!< Enables data scrambling for the specified range external flash
                                                     addresses. Scrambling does not impact flash access performance.           */

    struct {
      __IOM uint32_t SCRSTART0  : 13;           /*!< Scrambling region start address [28:16] (64K block granularity).
                                                     The START block is the FIRST block included in the scrambled
                                                     address range.                                                            */
            uint32_t            : 3;
      __IOM uint32_t SCREND0    : 13;           /*!< Scrambling region end address [28:16] (64K block granularity).
                                                     The END block is the LAST block included in the scrambled
                                                     address range.                                                            */
            uint32_t            : 2;
      __IOM uint32_t SCRENABLE0 : 1;            /*!< Enables Data Scrambling Region. When 1 reads and writes to the
                                                     range will be scrambled. When 0, data will be read/written
                                                     unmodified. Address range is specified in 64K granularity
                                                     and the START/END ranges are included within the range.                   */
    } DEV0SCRAMBLING_b;
  } ;

  union {
    __IOM uint32_t DEV0XIPMISC;                 /*!< Miscellaneous XIP control registers for AXI logic                         */

    struct {
      __IOM uint32_t CEBREAK0   : 12;           /*!< Number of clock cycles for CE deassertion time                            */
      __IOM uint32_t XIPODD0    : 1;            /*!< Convert odd starting address to word-aligned starting address
                                                     with byte-enables for holes. For example, an AXI transaction
                                                     with wstrb of 0x0600 results in mspi transaction of addr=8
                                                     and BE=0b1001 ( active low ).                                             */
      __IOM uint32_t BEPOL0     : 1;            /*!< byte mask polarity to MSPI xfer                                           */
      __IOM uint32_t BEON0      : 1;            /*!< Byte enable always on for all lanes                                       */
      __IOM uint32_t XIPBOUNDARY0 : 1;          /*!< Deprecated. No effect on RevC.                                            */
            uint32_t            : 5;
      __IOM uint32_t APNDODD0   : 1;            /*!< Append dummy byte to odd number of write                                  */
            uint32_t            : 10;
    } DEV0XIPMISC_b;
  } ;

  union {
    __IOM uint32_t DEV0XIPCPURQ;                /*!< XIP CPU Read Queue Configuration for AXI logic                            */

    struct {
      __IOM uint32_t CPURQEN0   : 1;            /*!< Enable CPU Read Queue                                                     */
      __IOM uint32_t RID0MASK0  : 1;            /*!< CPU Read ID 0 will in included in CPU Read Queue (if CPURQEN=1)
                                                     (Invalid for CM55 system)                                                 */
      __IOM uint32_t RID1MASK0  : 1;            /*!< CPU Read ID 1 will in included in CPU Read Queue (if CPURQEN=1)
                                                     (Invalid for CM55 system)                                                 */
      __IOM uint32_t RID2MASK0  : 1;            /*!< CPU Read ID 2 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t RID3MASK0  : 1;            /*!< CPU Read ID 3 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t RID4MASK0  : 1;            /*!< CPU Read ID 4 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t RID5MASK0  : 1;            /*!< CPU Read ID 5 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t RID6MASK0  : 1;            /*!< CPU Read ID 6 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t RID7MASK0  : 1;            /*!< CPU Read ID 7 will in included in CPU Read Queue (if CPURQEN=1)           */
      __IOM uint32_t GQARB0     : 2;            /*!< Arbitration Bias between General (Non-CPU) and CPU Rd Queue               */
            uint32_t            : 21;
    } DEV0XIPCPURQ_b;
  } ;

  union {
    __IOM uint32_t DEV0DDRDLYEXT;               /*!< DDR RX DQS Delayline MSB bits extenstion for DEV0DDR                      */

