zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t THR        : 1;            /*!< This is the FIFO threshold interrupt.                                     */
      __IOM uint32_t OVF        : 1;            /*!< This is the FIFO overflow interrupt.                                      */
      __IOM uint32_t UNDFL      : 1;            /*!< This is the FIFO underflow interrupt.                                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA completed a transfer                                                  */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error receieved                                                       */
            uint32_t            : 27;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED1[12];

  union {
    __IOM uint32_t DMATRIGEN;                   /*!< DMA Trigger Enable                                                        */

    struct {
      __IOM uint32_t DTHR       : 1;            /*!< Trigger DMA upon when FIFO iss filled to level indicated by
                                                     the FIFO THRESHOLD,at granularity of 16 bytes only                        */
      __IOM uint32_t DTHR90     : 1;            /*!< Trigger DMA at FIFO 90 percent full. This signal is also used
                                                     internally for AUTOHIP function                                           */
            uint32_t            : 30;
    } DMATRIGEN_b;
  } ;

  union {
    __IOM uint32_t DMATRIGSTAT;                 /*!< DMA Trigger Status                                                        */

    struct {
      __IOM uint32_t DTHRSTAT   : 1;            /*!< Triggered DMA from FIFO reaching threshold                                */
      __IOM uint32_t DTHR90STAT : 1;            /*!< Triggered DMA from FIFO reaching 90 percent full                          */
            uint32_t            : 30;
    } DMATRIGSTAT_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA Configuration                                                         */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DAUTOHIP   : 1;            /*!< Raise priority to high on fifo full, and DMAPRI set to low                */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power Off the ADC System upon DMACPL.                                     */
      __IOM uint32_t NEXTDMAEN  : 1;            /*!< Next DMA Request Feature Enable. When set, SW shall not program
                                                     TOTCOUNT and TARGADDR. Instead, SW shall program TOTCOUNTNEXT
                                                     and TARGADDRNEXT, and load them into HW DMA request pipeline
                                                     using DMAENNEXT bit.                                                      */
            uint32_t            : 20;
    } DMACFG_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

