zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t PWRENTCM   : 3;            /*!< Power up Combination of DTCM and ITCM. Only 3 Combinations are
                                                     allowed - 0x1, 0x3 and 0x7. And, Setting 0x2 selects ITCM128K_DTCM256K,
                                                     Setting 0x4, 0x5, 0x6 selects ITCM256K_DTCM512K.                          */
      __IOM uint32_t PWRENNVM   : 1;            /*!< Power up NVM                                                              */
      __IOM uint32_t PWRENNVM1  : 1;            /*!< Power up NVM1. PWRENNVM (Bit 3) MUST ALSO BE SET to 0x1.                  */
      __IOM uint32_t PWRENROM   : 1;            /*!< Power up ROM.                                                             */
            uint32_t            : 26;
    } MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t MEMPWRSTATUS;                /*!< It provides the power status for all the memory banks including-
                                                     caches, nvm (0 and 1) and all the SRAM groups. The status
                                                     here should reflect the enable provided by the MEMPWREN
                                                     register. There may be a lag time between setting the bits
                                                     in MEMPWREN register and MEMPWRSTATUS register, due to
                                                     the need to cycle the power gate and isolation seqeunces
                                                     to the memory banks.                                                      */

    struct {
      __IOM uint32_t PWRSTTCM   : 3;            /*!< Power status for xTCM. Each bit corresponds to one of the TCMs.
                                                     bit0=TCM0_0, bit1=TCM0_1, bit2=TCM1.                                      */
      __IOM uint32_t PWRSTNVM0  : 1;            /*!< This bit is 1 if power is supplied to NVM 0                               */
      __IOM uint32_t PWRSTCACHE : 1;            /*!< This bit is 1 if power is supplied to Cache                               */
            uint32_t            : 1;
      __IOM uint32_t PWRSTNVM1  : 1;            /*!< This bit is 1 if power is supplied to NVM 1                               */
      __IOM uint32_t PWRSTROM   : 1;            /*!< This bit is 1 if power is supplied to ROM                                 */
            uint32_t            : 24;
    } MEMPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMRETCFG;                   /*!< This register's fields control the power down of the NVM and
                                                     TCM in deep sleep.                                                        */

    struct {
      __IOM uint32_t TCMPWDSLP  : 1;            /*!< Powers down all enabled ITCM and DTCM in deep sleep when set
                                                     (memory is not retained). Enabled ITCM and DTCM are as
                                                     set in the PWRENTCM field of the MEMPWREN register and
                                                     the SKUITCM and SUDTCM fields in the MCUCTRL_SKU register.
                                                     If power-down is disabled (TCMPWDSLP is cleared), then
                                                     upon wake the data within the TCMs is retained. Do not
                                                     set this bit if the TCM bank is used as the target for
                                                     DMA transfer while CPU in deep sleep.                                     */
      __IOM uint32_t NVMPWDSLP  : 1;            /*!< Powers down NVM in deep sleep when set.                                   */
            uint32_t            : 30;
    } MEMRETCFG_b;
  } ;

  union {
    __IOM uint32_t SYSPWRSTATUS;                /*!< Power ON Status for domains that are not part of devpwrstatus
                                                     or mempwrstatus                                                           */

    struct {
      __IOM uint32_t PWRSTMCUL  : 1;            /*!< Power Domain status for MCUL                                              */
      __IOM uint32_t PWRSTMCUH  : 1;            /*!< Power Domain status for MCUH                                              */
            uint32_t            : 27;
      __IOM uint32_t CORESLEEP  : 1;            /*!< Indicates MCU entered SLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t COREDEEPSLEEP : 1;         /*!< Indicates MCU entered DEEPSLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t SYSDEEPSLEEP : 1;          /*!< Indicates all device domains powered down and MCU entered DEEPSLEEP
                                                     state since it was last cleared. Write 1 to to clear it.                  */
    } SYSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWREN;                  /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the SSRAMRETCFG register. If
                                                     this register is not set, then power will always be disabled
                                                     to the memory bank.                                                       */

    struct {
      __IOM uint32_t PWRENSSRAM : 3;            /*!< Power up SRAM groups                                                      */
            uint32_t            : 29;
    } SSRAMPWREN_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWRST;                  /*!< It provides the power status for shared sram banks. The status
                                                     here should reflect the enable provided by the SSRAMPWREN
                                                     register.                                                                 */

