zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t MMSOVRMCULDISP : 1;        /*!< MMS override for MCUL on by PD_DISP setting.                              */
      __IOM uint32_t MMSOVRMCULGFX : 1;         /*!< MMS override for MCUL on by PD_GFX setting. NOTE: THIS BIT MUST
                                                     ALWAYS BE SET TO 0.                                                       */
      __IOM uint32_t MMSOVRSSRAMDISP : 1;       /*!< MMS override for SSRAM power state by PD_DISP power setting.              */
      __IOM uint32_t MMSOVRSSRAMGFX : 1;        /*!< MMS override for SSRAM power state by PD_GFX power setting.               */
            uint32_t            : 4;
      __IOM uint32_t MMSOVRSSRAMRETDISP : 3;    /*!< If set, retention equation doesn't consider DISP. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRSSRAMRETGFX : 3;     /*!< If set, retention equation doesn't consider GFX. Each bit corresponds
                                                     to a domain.                                                              */
            uint32_t            : 18;
    } MMSOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t CPUPWRCTRL;                  /*!< This register contains override settings to override legacy_mode
                                                     trim bit setting                                                          */

    struct {
            uint32_t            : 2;
      __IOM uint32_t SLEEPMODE  : 1;            /*!< Control to select between Ambiq sleep and ARM sleep                       */
      __IOM uint32_t EPUMODEOVREN : 1;          /*!< EPU Mode override                                                         */
      __IOM uint32_t EPUPWRSTATE : 2;           /*!< EPU Power State                                                           */
      __IOM uint32_t CPUCLKOVREN : 1;           /*!< CPU clock override enable                                                 */
      __IOM uint32_t IWICCLKSTATE : 1;          /*!< IWIC Clock state                                                          */
            uint32_t            : 1;
      __IOM uint32_t PMUCLKSTATE : 1;           /*!< PMU Clock state                                                           */
      __IOM uint32_t FCLKSTATE  : 1;            /*!< FCLK Clock state                                                          */
      __IOM uint32_t DBGCLKSTATE : 1;           /*!< DBG Clock state                                                           */
      __IOM uint32_t DISFUNCRETMODE : 1;        /*!< SW Override to disable FUNC_RET mode                                      */
            uint32_t            : 19;
    } CPUPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t PWRCTRLMODESTATUS;           /*!< This register indicates power control operational mode                    */

    struct {
      __IOM uint32_t LEGACYMODEST : 1;          /*!< Legacy Mode value                                                         */
            uint32_t            : 31;
    } PWRCTRLMODESTATUS_b;
  } ;

  union {
    __IOM uint32_t CPUPWRSTATUS;                /*!< This register indicates the accepted power state request sent
                                                     to pwr_ctrl                                                               */

    struct {
      __IOM uint32_t CPUARMSLEEP : 1;           /*!< Indicates M55 entered ARM SLEEP mode (clkin ungated, internal
                                                     M55 clock gating via Q-channel signaling). Write 1 to clear               */
      __IOM uint32_t CPUAMBIQSLEEP : 1;         /*!< Indicates M55 entered Ambiq SLEEP mode (clkin gated). Write
                                                     1 to clear                                                                */
      __IOM uint32_t CPULP      : 1;            /*!< Indicates M55 entered LP mode. Write 1 to clear                           */
      __IOM uint32_t CPUHP      : 1;            /*!< Indicates M55 entered HP mode. Write 1 to clear                           */
            uint32_t            : 15;
      __IOM uint32_t FULLRETCACHE : 1;          /*!< Indicates M55 entered the FULL_RET (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t LOGICRETCACHE : 1;         /*!< Indicates M55 entered the LOGIC_RET (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t FUNCRETCACHE : 1;          /*!< Indicates M55 entered the FUNC_RET (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t EPUOFFCACHE : 1;           /*!< Indicates M55 entered the EPU_OFF (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t ONCACHE    : 1;            /*!< Indicates M55 entered the ON (Cache) power state, Write 1 to
                                                     clear                                                                     */
      __IOM uint32_t MEMRETCACHE : 1;           /*!< Indicates M55 entered the MEM_RET (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t FULLRETNOCACHE : 1;        /*!< Indicates M55 entered the FULL_RET (NO Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t LOGICRETNOCACHE : 1;       /*!< Indicates M55 entered the LOGIC_RET (NO Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t FUNCRETNOCACHE : 1;        /*!< Indicates M55 entered the FUNC_RET (NO Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t EPUOFFNOCACHE : 1;         /*!< Indicates M55 entered the EPU_OFF (NO Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t ONNOCACHE  : 1;            /*!< Indicates M55 entered the ON (NO Cache) power state, Write 1
                                                     to clear                                                                  */
      __IOM uint32_t MEMRETNOCACHE : 1;         /*!< Indicates M55 entered the MEM_RET (NO Cache) power state, Write
                                                     1 to clear                                                                */
            uint32_t            : 1;
    } CPUPWRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED2[10];

  union {
    __IOM uint32_t PWRACKOVR;                   /*!< This register contains override bit fields for various power
                                                     domain power switch acknowledge notification. As a part
                                                     of power up sequnce, Power controller will look for power
                                                     switch ack to advance power up sequence. It is possible
                                                     for power controller to be a forever wait state in case
                                                     of a unforeseen HW bug. This register defines a bit fileds
                                                     to work around if needed in such a situation. The default
                                                     behavior is to use HW power switch ack. Software can set
                                                     it to override this feature for each power switch.                        */

