zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC                                                        */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDF                                                        */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDS                                                        */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC_LV                                                     */
            uint32_t            : 27;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC                                                        */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDF                                                        */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDS                                                        */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC_LV                                                     */
            uint32_t            : 27;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC                                                        */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDF                                                        */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDS                                                        */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC_LV                                                     */
            uint32_t            : 27;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED2[8595];

  union {
    __IOM uint32_t STAT;                        /*!< This register contains information about the status of and causes
                                                     for resets and brownouts. NOTE 1: The bootrom and/or the
                                                     secure bootloader maintain and update this register with
                                                     appropriate status after each reset event. NOTE 2: While
                                                     this register is intended to be read-only, all bits in
                                                     this register, including reserved bits, are in fact writable.
                                                     Therefore SW should take great care to never write this
                                                     register.                                                                 */

    struct {
      __IOM uint32_t EXRSTAT    : 1;            /*!< Reset was initiated by an External Reset.                                 */
      __IOM uint32_t POASTAT    : 1;            /*!< Reset was initiated by a Power-On Analog (POA) Reset.                     */
      __IOM uint32_t BORSTAT    : 1;            /*!< Reset was initiated by a Brown-Out Reset. Following powerup,
                                                     this bit may be inadvertantly set due to the Brown-Out
                                                     signals powering up in a unusual sequence. It is recommended
                                                     to clear this bit after initial powerup.                                  */
      __IOM uint32_t SWRSTAT    : 1;            /*!< Reset was a initiated by SW POR Reset.                                    */
      __IOM uint32_t POIRSTAT   : 1;            /*!< Reset was a initiated by Software POI Reset.                              */
      __IOM uint32_t DBGRSTAT   : 1;            /*!< Reset was a initiated by Debugger Reset.                                  */
      __IOM uint32_t WDRSTAT    : 1;            /*!< Reset was initiated by a Watchdog Timer Reset.                            */
      __IOM uint32_t BOUSTAT    : 1;            /*!< An Unregulated Supply Brownout Event occurred.                            */
      __IOM uint32_t BOCSTAT    : 1;            /*!< VDDC Analog Brownout Event occurred.                                      */
      __IOM uint32_t BOFSTAT    : 1;            /*!< VDDF Analog Brownout Event occurred.                                      */
      __IOM uint32_t BOSSTAT    : 1;            /*!< VDDS Analog Brownout Event occurred.                                      */
            uint32_t            : 1;
      __IOM uint32_t AIRCRSTAT  : 1;            /*!< System reset request (SYSRESETREQ from CM55)                              */
            uint32_t            : 2;
      __IOM uint32_t RCVYINPROGRESS : 1;        /*!< An MRAM recovery operation is in progress.                                */
      __IOM uint32_t RCVYUARTLOAD : 1;          /*!< The recovery image loaded via UART.                                       */
      __IOM uint32_t RCVYSPILOAD : 1;           /*!< The recovery image loaded via SPI.                                        */
      __IOM uint32_t RCVYINITIATED : 2;         /*!< A recovery event was initiated by one of the following: APP,
                                                     GPIO, or certificate error.                                               */
      __IOM uint32_t SBLWIREDOTA : 1;           /*!< SBL recovery detailed status: wired OTA was successful.                   */
      __IOM uint32_t SBLWIREDLOAD : 1;          /*!< SBL recovery detailed status: wired load was successful.                  */
      __IOM uint32_t SBLNVOTA   : 1;            /*!< SBL recovery detailed status: NV OTA was successful.                      */
      __IOM uint32_t SBLNVIMAGELOAD : 1;        /*!< SBL recovery detailed status: NV Image Load was successful.               */
      __IOM uint32_t OEMWIREDOTA : 1;           /*!< OEM recovery detailed status: wired OTA was successful.                   */
      __IOM uint32_t OEMWIREDLOAD : 1;          /*!< OEM recovery detailed status: wired load was successful.                  */
      __IOM uint32_t OEMNVOTA   : 1;            /*!< OEM recovery detailed status: NV OTA was successful.                      */
      __IOM uint32_t OEMNVIMAGELOAD : 1;        /*!< OEM recovery detailed status: NV Image Load was successful.               */
      __IOM uint32_t OEMRCVYFAIL : 1;           /*!< OEM recovery was attempted but failed.                                    */
      __IOM uint32_t OEMRCVYSUCCESS : 1;        /*!< OEM recovery was successful.                                              */
      __IOM uint32_t SBLRCVYFAIL : 1;           /*!< SBL recovery was attempted but failed.                                    */
      __IOM uint32_t SBLRCVYSUCCESS : 1;        /*!< SBL recovery was successful by Secure Bootrom.                            */
    } STAT_b;
  } ;
} RSTGEN_Type;                                  /*!< Size = 34912 (0x8860)                                                     */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */

  union {
    __IOM uint32_t RTCCTL;                      /*!< This is the register control for the RTC module. It enables
                                                     counter writes and sets the alarm repeat interval.                        */

