zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t BOOTDATATO : 32;           /*!< This value determines the interval by which DAT line time-outs
                                                     are detected during boot operation for eMMC card. The value
                                                     is in number of sd clock.                                                 */
    } BOOTTOCTRL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t VENDOR;                      /*!< Vendor                                                                    */

    struct {
      __IOM uint32_t GATESDCLKEN : 1;           /*!< If this bit is 0, SD_CLK to card will not be gated automatically,
                                                     when there is no transfer. If this bit set to 1, SD_CLK
                                                     to card will be gated automatically,when there is no transfer.            */
      __IOM uint32_t DLYDIS     : 1;            /*!< Chicken bit added to enable/disable the rtl fix made to delay
                                                     the sampling of cmd_in and data_in.                                       */
            uint32_t            : 30;
    } VENDOR_b;
  } ;
  __IM  uint32_t  RESERVED1[32];

  union {
    __IOM uint32_t SLOTSTAT;                    /*!< Slot interrupt status                                                     */

    struct {
      __IOM uint32_t INTSLOT0   : 1;            /*!< This status bit indicates the OR of Interrupt signal and Wakeup
                                                     signal for slot                                                           */
            uint32_t            : 15;
      __IOM uint32_t SPECVER    : 8;            /*!< The Host Controller Version Number is set to 0x02 (SD Host Specification
                                                     Version 3.00).                                                            */
      __IOM uint32_t VENDORVER  : 8;            /*!< The Vendor Version Number is set to 0x10 (1.0)                            */
    } SLOTSTAT_b;
  } ;

  union {
    __IOM uint32_t CLKOUTCFG;                   /*!< clkout configure                                                          */

    struct {
      __IOM uint32_t STEP       : 4;            /*!< tune step                                                                 */
      __IOM uint32_t WIDEN      : 1;            /*!< narrow or widen the high portion                                          */
            uint32_t            : 27;
    } CLKOUTCFG_b;
  } ;
} SDIO0_Type;                                   /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Security Interfaces (SECURITY)
  */

typedef struct {                                /*!< SECURITY Structure                                                        */

  union {
    __IOM uint32_t CTRL;                        /*!< Control                                                                   */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Function Enable. Software should set the ENABLE bit to initiate
                                                     a CRC operation. Hardware will clear the ENABLE bit upon
                                                     completion.                                                               */
            uint32_t            : 3;
      __IOM uint32_t FUNCTION   : 4;            /*!< Function Select                                                           */
            uint32_t            : 23;
      __IOM uint32_t CRCERROR   : 1;            /*!< CRC Error Status - Set to 1 if an error occurs during a CRC
                                                     operation. Cleared when CTRL register is written (with
                                                     any value). Usually indicates an invalid address range.                   */
    } CTRL_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t SRCADDR;                     /*!< Source Addresss                                                           */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Source Buffer Address. Address may be byte aligned, but the
                                                     length must be a multiple of 4 bits.                                      */
    } SRCADDR_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t LEN;                         /*!< Length                                                                    */

    struct {
            uint32_t            : 2;
      __IOM uint32_t LEN        : 22;           /*!< Buffer size (bottom two bits assumed to be zero to ensure a
                                                     multiple of 4 bytes)                                                      */
            uint32_t            : 8;
    } LEN_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t RESULT;                      /*!< CRC Seed/Result                                                           */

    struct {
      __IOM uint32_t CRC        : 32;           /*!< CRC Seed/Result. Software must seed the CRC with 0xFFFFFFFF
                                                     before starting a CRC operation (unless the CRC is continued
                                                     from a previous operation).                                               */
    } RESULT_b;
  } ;
  __IM  uint32_t  RESERVED3[17];

  union {
    __IOM uint32_t LOCKCTRL;                    /*!< LOCK Control                                                              */

