zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t TCMALLSECDISABLE : 1;      /*!< Write 1 to disables TCM all secure access override. Once set,
                                                     it remains locked until the next system reset. Write 0
                                                     has no effect.                                                            */
            uint32_t            : 31;
    } SSLOCKS_b;
  } ;
} SSC_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                          STIMER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Counter/Timer (STIMER)
  */

typedef struct {                                /*!< STIMER Structure                                                          */

  union {
    __IOM uint32_t STCFG;                       /*!< The STIMER Configuration Register contains the software control
                                                     for selecting the clock divider and source feeding the
                                                     system timer.                                                             */

    struct {
      __IOM uint32_t CLKSEL     : 4;            /*!< Selects an appropriate clock source and divider to use for the
                                                     System Timer clock.                                                       */
            uint32_t            : 4;
      __IOM uint32_t COMPAREAEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREBEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPARECEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREDEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREEEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREFEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREGEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
      __IOM uint32_t COMPAREHEN : 1;            /*!< Selects whether compare is enabled for the corresponding SCMPR
                                                     register. If compare is enabled, the interrupt status is
                                                     set once the comparision is met.                                          */
            uint32_t            : 14;
      __IOM uint32_t CLEAR      : 1;            /*!< Set this bit to one to clear the System Timer register. If this
                                                     bit is set to '1', the system timer register will stay
                                                     cleared. It needs to be set to '0' for the system timer
                                                     to start running.                                                         */
      __IOM uint32_t FREEZE     : 1;            /*!< Set this bit to one to freeze the clock input to the COUNTER
                                                     register. Once frozen, the value can be safely written
                                                     from the MCU. Unfreeze to resume.                                         */
    } STCFG_b;
  } ;

  union {
    __IOM uint32_t STTMR;                       /*!< The COUNTER Register contains the running count of time as maintained
                                                     by incrementing for every rising clock edge of the clock
                                                     source selected in the configuration register. It is this
                                                     counter value that captured in the capture registers and
                                                     it is this counter value that is compared against the various
                                                     compare registers. This register cannot be written, but
                                                     can be cleared to 0 for a deterministic value. Use the
                                                     FREEZE bit will stop this counter from incrementing.                      */

