zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t OUTCFG28   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO28. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG29   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO29. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG30   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO30. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG31   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO31. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG7_b;
  } ;

  union {
    __IOM uint32_t OUTCFG8;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG32   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO32. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG33   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO33. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG34   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO34. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG35   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO35. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG8_b;
  } ;

  union {
    __IOM uint32_t OUTCFG9;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG36   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO36. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG37   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO37. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG38   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO38. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG39   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO39. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG9_b;
  } ;

  union {
    __IOM uint32_t OUTCFG10;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG40   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO40. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG41   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO41. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG42   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO42. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG43   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO43. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG10_b;
  } ;

  union {
    __IOM uint32_t OUTCFG11;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG44   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO44. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG45   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO45. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG46   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO46. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG47   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO47. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG11_b;
  } ;

  union {
    __IOM uint32_t OUTCFG12;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

