zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t OUTCFG68   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO68. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG69   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO69. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG70   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO70. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG71   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO71. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG17_b;
  } ;

  union {
    __IOM uint32_t OUTCFG18;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG72   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO72. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG73   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO73. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG74   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO74. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG75   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO75. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG18_b;
  } ;

  union {
    __IOM uint32_t OUTCFG19;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG76   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO76. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG77   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO77. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG78   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO78. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG79   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO79. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG19_b;
  } ;

  union {
    __IOM uint32_t OUTCFG20;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG80   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO80. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG81   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO81. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG82   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO82. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG83   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO83. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG20_b;
  } ;

  union {
    __IOM uint32_t OUTCFG21;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG84   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO84. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG85   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO85. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG86   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO86. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG87   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO87. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG21_b;
  } ;

  union {
    __IOM uint32_t OUTCFG22;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

