zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t OUTCFG88   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO88. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG89   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO89. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG90   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO90. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG91   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO91. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG22_b;
  } ;

  union {
    __IOM uint32_t OUTCFG23;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG92   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO92. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG93   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO93. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG94   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO94. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG95   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO95. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG23_b;
  } ;

  union {
    __IOM uint32_t OUTCFG24;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG96   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO96. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG97   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO97. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG98   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO98. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG99   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO99. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG24_b;
  } ;

  union {
    __IOM uint32_t OUTCFG25;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG100  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO100.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG101  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO101.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG102  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO102.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG103  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO103.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG25_b;
  } ;

  union {
    __IOM uint32_t OUTCFG26;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG104  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO104.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG105  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO105.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG106  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO106.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG107  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO107.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG26_b;
  } ;

  union {
    __IOM uint32_t OUTCFG27;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

