zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t OUTCFG168  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO168.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG169  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO169.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG170  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO170.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG171  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO171.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG42_b;
  } ;

  union {
    __IOM uint32_t OUTCFG43;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG172  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO172.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG173  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO173.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG174  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO174.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG175  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO175.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG43_b;
  } ;

  union {
    __IOM uint32_t OUTCFG44;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG176  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO176.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG177  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO177.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG178  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO178.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG179  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO179.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG44_b;
  } ;

  union {
    __IOM uint32_t OUTCFG45;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG180  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO180.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG181  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO181.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG182  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO182.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG183  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO183.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG45_b;
  } ;

  union {
    __IOM uint32_t OUTCFG46;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG184  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO184.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG185  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO185.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG186  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO186.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG187  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO187.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG46_b;
  } ;

  union {
    __IOM uint32_t OUTCFG47;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

