zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t OUTCFG208  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO208.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG209  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO209.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG210  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO210.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG211  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO211.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG52_b;
  } ;

  union {
    __IOM uint32_t OUTCFG53;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG212  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO212.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG213  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO213.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG214  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO214.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG215  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO215.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG53_b;
  } ;

  union {
    __IOM uint32_t OUTCFG54;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG216  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO216.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG217  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO217.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG218  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO218.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG219  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO219.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG54_b;
  } ;

  union {
    __IOM uint32_t OUTCFG55;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG220  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO220.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG221  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO221.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG222  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO222.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG223  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO223.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG55_b;
  } ;
  __IM  uint32_t  RESERVED3[40];

  union {
    __IOM uint32_t CTRL0;                       /*!< This includes the Control bit fields for timer 0.                         */

    struct {
      __IOM uint32_t TMR0EN     : 1;            /*!< Counter/Timer 0 Enable bit.                                               */
      __IOM uint32_t TMR0CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR0POL0   : 1;            /*!< Counter/Timer 0 output 0 polarity.                                        */
      __IOM uint32_t TMR0POL1   : 1;            /*!< Counter/Timer 0 output 1 polarity.                                        */
      __IOM uint32_t TMR0FN     : 4;            /*!< Counter/Timer 0 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR0CLK    : 9;            /*!< Counter/Timer 0 Clock Select. Note: Any GPIO can be used as
                                                     a clock source.                                                           */
      __IOM uint32_t TMR0TMODE  : 2;            /*!< Counter/Timer 0 Trigger Mode                                              */
            uint32_t            : 5;
      __IOM uint32_t TMR0LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     0. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL0_b;
  } ;

  union {
    __IOM uint32_t TIMER0;                      /*!< This register holds the running time or event count for timer
                                                     0.                                                                        */

