zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FESTAT     : 1;            /*!< Framing error. When set to 1, it indicates that the received
                                                     character did not have a valid stop bit (a valid stop bit
                                                     is 1). This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t PESTAT     : 1;            /*!< Parity error. When set to 1, it indicates that the parity of
                                                     the received data character does not match the parity that
                                                     the EPS and SPS bits in the Line Control Register, UARTLCRH
                                                     select. This bit is cleared to 0 by a write to UARTECR.
                                                     In FIFO mode, this error is associated with the character
                                                     at the top of the FIFO.                                                   */
      __IOM uint32_t BESTAT     : 1;            /*!< Break error. This bit is set to 1 if a break condition was detected,
                                                     indicating that the received data input was held LOW for
                                                     longer than a full-word transmission time (defined as start,
                                                     data, parity, and stop bits). This bit is cleared to 0
                                                     after a write to UARTECR. In FIFO mode, this error is associated
                                                     with the character at the top of the FIFO. When a break
                                                     occurs, only one 0 character is loaded into the FIFO. The
                                                     next character is only enabled after the receive data input
                                                     goes to a 1 (marking state) and the next valid start bit
                                                     is received.                                                              */
      __IOM uint32_t OESTAT     : 1;            /*!< Overrun error. This bit is set to 1 if data is received and
                                                     the FIFO is already full. This bit is cleared to 0 by a
                                                     write to UARTECR. The FIFO contents remain valid because
                                                     no more data is written when the FIFO is full, only the
                                                     contents of the shift register are overwritten. The CPU
                                                     must now read the data, to empty the FIFO.                                */
      __IOM uint32_t DMACPL     : 1;            /*!< This is the DMA transfer complete indicator.                              */
      __IOM uint32_t DMAERR     : 1;            /*!< This is the DMA transfer error indicator.                                 */
            uint32_t            : 26;
    } RSR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t FR;                          /*!< Flags                                                                     */

    struct {
      __IOM uint32_t CTS        : 1;            /*!< Clear to send. This bit is the complement of the UART clear
                                                     to send, nUARTCTS, modem status input. That is, the bit
                                                     is 1 when nUARTCTS is LOW.                                                */
      __IOM uint32_t DSR        : 1;            /*!< Data set ready. This bit is the complement of the UART data
                                                     set ready, nUARTDSR, modem status input. That is, the bit
                                                     is 1 when nUARTDSR is LOW.                                                */
      __IOM uint32_t DCD        : 1;            /*!< Data carrier detect. This bit is the complement of the UART
                                                     data carrier detect, nUARTDCD, modem status input. That
                                                     is, the bit is 1 when nUARTDCD is LOW.                                    */
      __IOM uint32_t BUSY       : 1;            /*!< UART busy. If this bit is set to 1, the UART is busy transmitting
                                                     data. This bit remains set until the complete byte, including
                                                     all the stop bits, has been sent from the shift register.
                                                     This bit is set as soon as the transmit FIFO becomes non-empty,
                                                     regardless of whether the UART is enabled or not.                         */
      __IOM uint32_t RXFE       : 1;            /*!< Receive FIFO empty. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCRH Register. If the FIFO is
                                                     disabled, this bit is set when the receive holding register
                                                     is empty. If the FIFO is enabled, the RXFE bit is set when
                                                     the receive FIFO is empty.                                                */
      __IOM uint32_t TXFF       : 1;            /*!< Transmit FIFO full. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCRH Register. If the FIFO is
                                                     disabled, this bit is set when the transmit holding register
                                                     is full. If the FIFO is enabled, the TXFF bit is set when
                                                     the transmit FIFO is full.                                                */
      __IOM uint32_t RXFF       : 1;            /*!< Receive FIFO full. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCRH Register. If the FIFO is
                                                     disabled, this bit is set when the receive holding register
                                                     is full. If the FIFO is enabled, the RXFF bit is set when
                                                     the receive FIFO is full.                                                 */
      __IOM uint32_t TXFE       : 1;            /*!< Transmit FIFO empty. The meaning of this bit depends on the
                                                     state of the FEN bit in the Line Control Register, UARTLCRH.
                                                     If the FIFO is disabled, this bit is set when the transmit
                                                     holding register is empty. If the FIFO is enabled, the
                                                     TXFE bit is set when the transmit FIFO is empty. This bit
                                                     does not indicate if there is data in the transmit shift
                                                     register.                                                                 */
      __IOM uint32_t TXBUSY     : 1;            /*!< This bit holds the transmit BUSY indicator.                               */
            uint32_t            : 23;
    } FR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ILPR;                        /*!< IrDA Counter                                                              */

