zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t ILPDVSR    : 8;            /*!< 8-bit low-power divisor value. These bits are cleared to 0 at
                                                     reset. Programming a zero value results in no IrLPBaud16
                                                     pulses being generated.                                                   */
            uint32_t            : 24;
    } ILPR_b;
  } ;

  union {
    __IOM uint32_t IBRD;                        /*!< Integer Baud Rate Divisor                                                 */

    struct {
      __IOM uint32_t DIVINT     : 16;           /*!< This field holds the integer baud rate divisor. It is set in
                                                     conjunction with the DIVFRAC field in the FBRD register
                                                     and the clock rate as set in the CLKSEL field of the CR
                                                     register. The field should be set to the integer part of
                                                     the ratio: Clock Rate / (16 x intended baud rate).                        */
            uint32_t            : 16;
    } IBRD_b;
  } ;

  union {
    __IOM uint32_t FBRD;                        /*!< Fractional Baud Rate Divisor                                              */

    struct {
      __IOM uint32_t DIVFRAC    : 6;            /*!< This field holds the fractional baud rate divisor. It is set
                                                     in conjunction with the DIVINT field in the IBRD register
                                                     and the clock rate as set in the CLKSEL field of the CR
                                                     register. The field should be set to the rounded value
                                                     of 64 x the fractional part of the ratio: Clock Rate /
                                                     (16 x intended baud rate).                                                */
            uint32_t            : 26;
    } FBRD_b;
  } ;

  union {
    __IOM uint32_t LCRH;                        /*!< Line Control High                                                         */

    struct {
      __IOM uint32_t BRK        : 1;            /*!< This bit holds the break set. If this bit is set to 1, a low-level
                                                     is continually output on the UARTTXD output, after completing
                                                     transmission of the current character. For the proper execution
                                                     of the break command, the software must set this bit for
                                                     at least two complete frames. For normal use, this bit
                                                     must be cleared to 0.                                                     */
      __IOM uint32_t PEN        : 1;            /*!< This bit holds the parity enable. 0 = parity is disabled and
                                                     no parity bit added to the data frame. 1 = parity checking
                                                     and generation is enabled.                                                */
      __IOM uint32_t EPS        : 1;            /*!< This bit holds the even parity select. Controls the type of
                                                     parity the UART uses during transmission and reception:
                                                     0 = odd parity. The UART generates or checks for an odd
                                                     number of 1s in the data and parity bits. 1 = even parity.
                                                     The UART generates or checks for an even number of 1s in
                                                     the data and parity bits. This bit has no effect when the
                                                     PEN bit disables parity checking and generation.                          */
      __IOM uint32_t STP2       : 1;            /*!< This bit holds the two stop bits select. If this bit is set
                                                     to 1, two stop bits are transmitted at the end of the frame.
                                                     The receive logic does not check for two stop bits being
                                                     received.                                                                 */
      __IOM uint32_t FEN        : 1;            /*!< This bit holds the FIFO enable. 0 = FIFOs are disabled (character
                                                     mode) that is, the FIFOs become 1-byte-deep holding registers.
                                                     1 = transmit and receive FIFO buffers are enabled (FIFO
                                                     mode).                                                                    */
      __IOM uint32_t WLEN       : 2;            /*!< These bits hold the write length. These bits indicate the number
                                                     of data bits transmitted or received in a frame as follows:
                                                     b11 = 8 bits, b10 = 7 bits, b01 = 6 bits, b00 = 5 bits.                   */
      __IOM uint32_t SPS        : 1;            /*!< This bit holds the stick parity select. If the EPS bit is 0
                                                     then the parity bit is transmitted and checked as a 1.
                                                     If the EPS bit is 1 then the parity bit is transmitted
                                                     and checked as a 0. This bit has no effect when the PEN
                                                     bit disables parity checking and generation.                              */
            uint32_t            : 24;
    } LCRH_b;
  } ;

  union {
    __IOM uint32_t CR;                          /*!< Control                                                                   */

