zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t TXIFLSEL   : 3;            /*!< These bits hold the transmit FIFO interrupt level.                        */
      __IOM uint32_t RXIFLSEL   : 3;            /*!< These bits hold the receive FIFO interrupt level.                         */
            uint32_t            : 26;
    } IFLS_b;
  } ;

  union {
    __IOM uint32_t IER;                         /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t TXCMPMIM   : 1;            /*!< This bit holds the modem TXCMP interrupt enable.                          */
      __IOM uint32_t CTSMIM     : 1;            /*!< This bit holds the modem CTS interrupt enable.                            */
      __IOM uint32_t DCDMIM     : 1;            /*!< This bit holds the modem DCD interrupt enable.                            */
      __IOM uint32_t DSRMIM     : 1;            /*!< This bit holds the modem DSR interrupt enable.                            */
      __IOM uint32_t RXIM       : 1;            /*!< This bit holds the receive interrupt enable.                              */
      __IOM uint32_t TXIM       : 1;            /*!< This bit holds the transmit interrupt enable.                             */
      __IOM uint32_t RTIM       : 1;            /*!< This bit holds the receive timeout interrupt enable.                      */
      __IOM uint32_t FEIM       : 1;            /*!< This bit holds the framing error interrupt enable.                        */
      __IOM uint32_t PEIM       : 1;            /*!< This bit holds the parity error interrupt enable.                         */
      __IOM uint32_t BEIM       : 1;            /*!< This bit holds the break error interrupt enable.                          */
      __IOM uint32_t OEIM       : 1;            /*!< This bit holds the overflow interrupt enable.                             */
      __IOM uint32_t DMACPIM    : 1;            /*!< This bit holds the DMA complete interrupt enable.                         */
      __IOM uint32_t DMAEIM     : 1;            /*!< This bit holds the DMA error interrupt enable.                            */
            uint32_t            : 19;
    } IER_b;
  } ;

  union {
    __IOM uint32_t IES;                         /*!< Interrupt Status                                                          */

    struct {
      __IOM uint32_t TXCMPMRIS  : 1;            /*!< This bit holds the modem TXCMP interrupt status.                          */
      __IOM uint32_t CTSMRIS    : 1;            /*!< This bit holds the nUARTCTS modem interrupt status. Returns
                                                     the raw interrupt state of the UARTCTSINTR interrupt.                     */
      __IOM uint32_t DCDMRIS    : 1;            /*!< This bit holds the nUARTDCD modem interrupt status. Returns
                                                     the raw interrupt state of the UARTDCDINTR interrupt.                     */
      __IOM uint32_t DSRMRIS    : 1;            /*!< This bit holds the nUARTDSR modem interrupt status. Returns
                                                     the raw interrupt state of the UARTDSRINTR interrupt.                     */
      __IOM uint32_t RXRIS      : 1;            /*!< This bit holds the receive interrupt status. Returns the raw
                                                     interrupt state of the UARTRXINTR interrupt.                              */
      __IOM uint32_t TXRIS      : 1;            /*!< This bit holds the transmit interrupt status. Returns the raw
                                                     interrupt state of the UARTTXINTR interrupt.                              */
      __IOM uint32_t RTRIS      : 1;            /*!< This bit holds the receive timeout interrupt status. Returns
                                                     the raw interrupt state of the UARTRTINTR interrupt.                      */
      __IOM uint32_t FERIS      : 1;            /*!< This bit holds the framing error interrupt status. Returns the
                                                     raw interrupt state of the UARTFEINTR interrupt.                          */
      __IOM uint32_t PERIS      : 1;            /*!< This bit holds the parity error interrupt status. Returns the
                                                     raw interrupt state of the UARTPEINTR interrupt.                          */
      __IOM uint32_t BERIS      : 1;            /*!< This bit holds the break error interrupt status. Returns the
                                                     raw interrupt state of the UARTBEINTR interrupt.                          */
      __IOM uint32_t OERIS      : 1;            /*!< This bit holds the overrun interrupt status. Returns the raw
                                                     interrupt state of the UARTOEINTR interrupt.                              */
      __IOM uint32_t DMACPRIS   : 1;            /*!< This bit holds the DMA complete interrupt status.                         */
      __IOM uint32_t DMAERIS    : 1;            /*!< This bit holds the DMA error interrupt status.                            */
            uint32_t            : 19;
    } IES_b;
  } ;

  union {
    __IOM uint32_t MIS;                         /*!< Masked Interrupt Status                                                   */

    struct {
      __IOM uint32_t TXCMPMMIS  : 1;            /*!< This bit holds the modem TXCMP interrupt status masked.                   */
      __IOM uint32_t CTSMMIS    : 1;            /*!< This bit holds the nUARTCTS modem masked interrupt status. Returns
                                                     the masked interrupt state of the UARTCTSINTR interrupt.                  */
      __IOM uint32_t DCDMMIS    : 1;            /*!< This bit holds the nUARTDCD modem masked interrupt status. Returns
                                                     the masked interrupt state of the UARTDCDINTR interrupt.                  */
      __IOM uint32_t DSRMMIS    : 1;            /*!< This bit holds the nUARTDSR modem masked interrupt status. Returns
                                                     the masked interrupt state of the UARTDSRINTR interrupt.                  */
      __IOM uint32_t RXMIS      : 1;            /*!< This bit holds the receive interrupt status masked. Returns
                                                     the masked interrupt state of the UARTRXINTR interrupt.                   */
      __IOM uint32_t TXMIS      : 1;            /*!< This bit holds the transmit interrupt status masked. Returns
                                                     the masked interrupt state of the UARTTXINTR interrupt.                   */
      __IOM uint32_t RTMIS      : 1;            /*!< This bit holds the receive timeout interrupt status masked.
                                                     Returns the masked interrupt state of the UARTRTINTR interrupt.           */
      __IOM uint32_t FEMIS      : 1;            /*!< This bit holds the framing error interrupt status masked. Returns
                                                     the masked interrupt state of the UARTFEINTR interrupt.                   */
      __IOM uint32_t PEMIS      : 1;            /*!< This bit holds the parity error interrupt status masked. Returns
                                                     the masked interrupt state of the UARTPEINTR interrupt.                   */
      __IOM uint32_t BEMIS      : 1;            /*!< This bit holds the break error interrupt status masked. Returns
                                                     the masked interrupt state of the UARTBEINTR interrupt.                   */
      __IOM uint32_t OEMIS      : 1;            /*!< This bit holds the overrun interrupt status masked. Returns
                                                     the masked interrupt state of the UARTOEINTR interrupt.                   */
      __IOM uint32_t DMACPMIS   : 1;            /*!< This bit holds the DMA complete interrupt status masked.                  */
      __IOM uint32_t DMAEMIS    : 1;            /*!< This bit holds the DMA error interrupt status masked.                     */
            uint32_t            : 19;
    } MIS_b;
  } ;

  union {
    __IOM uint32_t IEC;                         /*!< Interrupt Clear                                                           */

