zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t BF00       : 1;            /*!< Dflop output select signal delay compared with digital clock
                                                     enable signal 1'b0:3 clocks 1'b1:2 clocks                                 */
      __IOM uint32_t BF11       : 1;            /*!< PLL bandwidth option 1'b0 default 1'b1 increases the PLL bandwidth        */
      __IOM uint32_t BF42       : 3;            /*!< Tx HS pre-emphasis strength 3'b111 represents the strongest
                                                     , 3'b000 the weakest                                                      */
      __IOM uint32_t BF55       : 1;            /*!< PLL feedback divider ratio option.                                        */
      __IOM uint32_t BF66       : 1;            /*!< FIXME (description needed).                                               */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG14_b;
  } ;

  union {
    __IOM uint32_t REG18;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< HS receiver bias current tuning. 2'b00 represents the minimum
                                                     bias current 2'b11 represents the maximum bias current                    */
      __IOM uint32_t BF22       : 1;            /*!< Clk60m, clk12m and clk48m enable. 1'b0:disables the clocks 1'b1:enables
                                                     the clocks                                                                */
      __IOM uint32_t BF73       : 5;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG18_b;
  } ;

  union {
    __IOM uint32_t REG1C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Set IO high-Z state. Active high                                          */
      __IOM uint32_t BF11       : 1;            /*!< Tx power down in suspend state. Active low.                               */
      __IOM uint32_t BF22       : 1;            /*!< PLL enable bypass from suspend module. 1'b1: bypass enable 1'b0:bypass
                                                     disable                                                                   */
      __IOM uint32_t BF33       : 1;            /*!< PLL enable value from suspend module. 1'b1:pll enable                     */
      __IOM uint32_t BF44       : 1;            /*!< 480M clock out enable. 1'b0:pll disable 1'b1: 480M clock out
                                                     enable 1'b0: 480M clock out disable                                       */
      __IOM uint32_t BF55       : 1;            /*!< BG power down control bit, active high 1: power down band-gap
                                                     0: normal operation mode                                                  */
      __IOM uint32_t BF66       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG1C_b;
  } ;

  union {
    __IOM uint32_t REG20;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< Rx enable delay select. 3'b000: 4 clocks (480Mhz clock) 3'b001:
                                                     5 clocks 3'b010: 6 clocks 3'b011: 7 clocks 3'b100: 8 clocks
                                                     3'b101: 9 clocks 3'b110: 10 clocks 3'b111: 12 clocks                      */
      __IOM uint32_t BF33       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF54       : 2;            /*!< Analog observation port select. for detailed information, please
                                                     refer to section 10.3 , Table 30 : Debug and OBS port                     */
      __IOM uint32_t BF76       : 2;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG20_b;
  } ;

  union {
    __IOM uint32_t REG24;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< it0                                                                       */
      __IOM uint32_t BF71       : 7;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG24_b;
  } ;

  union {
    __IOM uint32_t REG28;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG28_b;
  } ;

  union {
    __IOM uint32_t REG2C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< All port z bypass value. 1'b1: bypass enable 1'b0:bypass disable          */
      __IOM uint32_t BF11       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF22       : 1;            /*!< HS keep alive enable. 1'b1: HS keep alive enable 1'b0: HS keep
                                                     alive disable                                                             */
      __IOM uint32_t BF33       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF44       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF75       : 3;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG2C_b;
  } ;

  union {
    __IOM uint32_t REG30;                       /*!< Register description here                                                 */

