zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< Writing to this register loads data into the IN FIFO and reading
                                                     from this register unloads data from the OUT FIFO for endpoint
                                                     3.                                                                        */
    } FIFO3_b;
  } ;

  union {
    __IOM uint32_t FIFO4;                       /*!< Endpoint 4 FIFO register                                                  */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< Writing to this register loads data into the IN FIFO and reading
                                                     from this register unloads data from the OUT FIFO for endpoint
                                                     4.                                                                        */
    } FIFO4_b;
  } ;

  union {
    __IOM uint32_t FIFO5;                       /*!< Endpoint 5 FIFO register                                                  */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< Writing to this register loads data into the IN FIFO and reading
                                                     from this register unloads data from the OUT FIFO for endpoint
                                                     5.                                                                        */
    } FIFO5_b;
  } ;
  __IM  uint32_t  RESERVED[13];

  union {
    __IOM uint32_t HWVERS;                      /*!< Read-only register that returns version number (xx.yyy) of the
                                                     core hardware.                                                            */

    struct {
      __IOM uint32_t yyy        : 10;           /*!< Minor Version Number (Range 0 - 999).                                     */
      __IOM uint32_t xx         : 5;            /*!< Major Version Number (Range 0 - 31).                                      */
      __IOM uint32_t RC         : 1;            /*!< Unused                                                                    */
            uint32_t            : 16;
    } HWVERS_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t INFO;                        /*!< Contains read-only info of the number of IN and OUT endpoints
                                                     included in the design, width of the RAM, the ability to
                                                     reset the USB Controller via software, a soft reset bit
                                                     for the CLK clock domain and a soft reset bit for the XCLK
                                                     clock domain.                                                             */

    struct {
      __IOM uint32_t InEndPoints : 4;           /*!< Provides the number of implemented IN Endpoints.                          */
      __IOM uint32_t OutEndPoints : 4;          /*!< Provides the number of implemented OUT Endpoints.                         */
      __IOM uint32_t RamBits    : 4;            /*!< Provides the width of the RAM address bus.                                */
      __IOM uint32_t DMAChains  : 4;            /*!< Provides the number of implemented DMA channels.                          */
      __IOM uint32_t RSTS       : 1;            /*!< Soft reset for the CLK domain. cause the output signal NRSTO
                                                     to be asserted low. This bit is self-clearing. For reset
                                                     to actually occur, the output NRSTO must be connected to
                                                     the input NRST.                                                           */
      __IOM uint32_t RSTXS      : 1;            /*!< Soft reset for the XCLK domain. will cause the output signal
                                                     NRSTXO to be asserted low. This bit is self-clearing. For
                                                     reset to actually occur, the output NRSTXO must be connected
                                                     to the input NRSTX.                                                       */
            uint32_t            : 6;
      __IOM uint32_t EDMAOUT    : 1;            /*!< DMA_REQ deassert for all OUT Endpoints.                                   */
      __IOM uint32_t EDMAIN     : 1;            /*!< DMA_REQ deassert for all IN endpoints.                                    */
            uint32_t            : 6;
    } INFO_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t TIMEOUT1;                    /*!< Holds the configurable chirp timeout value.                               */

    struct {
      __IOM uint32_t CTUCH      : 16;           /*!< Configurable Chirp Timeout timer; default value of 0x4074 corresponds
                                                     to a delay of 1.1ms (60Mhz clock cycles * 4 * 0x4074).                    */
            uint32_t            : 16;
    } TIMEOUT1_b;
  } ;

  union {
    __IOM uint32_t TIMEOUT2;                    /*!< Holds the configurable delay from the end of High Speed resume
                                                     signal to enable UTM normal operating mode.                               */

    struct {
      __IOM uint32_t CTHRSTN    : 16;           /*!< Configurable delay from the end of High Speed resume signaling
                                                     to enabling UTM normal operating mode. Default value of
                                                     0x32 corresponds to a delay of 3us. This programmed delay
                                                     is equivalent to the number of 60MHz clock cycles * 4.                    */
            uint32_t            : 16;
    } TIMEOUT2_b;
  } ;
  __IM  uint32_t  RESERVED3[2014];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< Provides optional control for turning off the interface clocks
                                                     to USB Controller and PHY as well as the reference clock
                                                     to the USB PHY.                                                           */

