zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t CHARGEDETBYP : 1;          /*!< BC detection bypass                                                       */
      __IOM uint32_t FORCEDPATTACHED : 1;       /*!< Force output dp_attached                                                  */
      __IOM uint32_t FORCECPDET : 1;            /*!< Force output charging port detected                                       */
      __IOM uint32_t FORCEDCPDET : 1;           /*!< Force output dedicated charging port detected                             */
            uint32_t            : 4;
      __IOM uint32_t BCWEAKPULLUPTUNE : 2;      /*!< Weak source resistor to both DP and DM tuning. Trimmable.                 */
      __IOM uint32_t BCWEAKPULLDOWNTUNE : 2;    /*!< Weak sink resistor to both DP and DM tuning. Trimmable.                   */
            uint32_t            : 20;
    } BCDETCRTL2_b;
  } ;

  union {
    __IOM uint32_t DMACTRL;                     /*!< DMA Control                                                               */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< enable USB DMA                                                            */
      __IOM uint32_t DMAEP      : 3;            /*!< USB DMA endpoint selection                                                */
      __IOM uint32_t DMADIR     : 1;            /*!< USB DMA direction                                                         */
      __IOM uint32_t DMAPRI     : 1;            /*!< USB DMA priority                                                          */
            uint32_t            : 10;
      __IOM uint32_t TOTCOUNT   : 12;           /*!< total transfer count in bytes                                             */
            uint32_t            : 4;
    } DMACTRL_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< USB DMA Target Address                                                    */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Target byte address for source of DMA (either read or write).
                                                     In cases of non-word aligned addresses, the DMA logic will
                                                     take care for ensuring only the target bytes are read/written.            */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error Interrupt                                                       */
            uint32_t            : 30;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t DMAINTSTAT;                  /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error Interrupt                                                       */
            uint32_t            : 30;
    } DMAINTSTAT_b;
  } ;

  union {
    __IOM uint32_t DMAINTCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error Interrupt                                                       */
            uint32_t            : 30;
    } DMAINTCLR_b;
  } ;

  union {
    __IOM uint32_t DMAINTSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error Interrupt                                                       */
            uint32_t            : 30;
    } DMAINTSET_b;
  } ;

  union {
    __IOM uint32_t ADMACTRL;                    /*!< Auto-DMA Control                                                          */

    struct {
      __IOM uint32_t DMAMODE    : 1;            /*!< 0 - Legacy DMA mode, 1 - Auto-DMA mode                                    */
            uint32_t            : 31;
    } ADMACTRL_b;
  } ;

  union {
    __IOM uint32_t ADMAEN;                      /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMAEN     : 10;           /*!< Set ADMAEN[i] to 1 to enable auto-DMA for USB DMA request line
                                                     [i].                                                                      */
            uint32_t            : 22;
    } ADMAEN_b;
  } ;

  union {
    __IOM uint32_t ADMADIR;                     /*!< Auto DMA Direction Select Register                                        */

    struct {
      __IOM uint32_t ADMADIR    : 10;           /*!< Set ADMADIR[i] to 0 for OUT, and 1 for IN direction for auto-DMA
                                                     for USB DMA request line [i].                                             */
            uint32_t            : 22;
    } ADMADIR_b;
  } ;

  union {
    __IOM uint32_t ADMAPRI;                     /*!< Auto DMA Priority Select Register                                         */

