zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t ADMATOTCOUNT0 : 24;        /*!< Auto DMA Total Count for USB DMA request line 0                           */
            uint32_t            : 8;
    } ADMATOTCOUNT0_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT1;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT1 : 24;        /*!< Auto DMA Total Count for USB DMA request line 1                           */
            uint32_t            : 8;
    } ADMATOTCOUNT1_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT2;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT2 : 24;        /*!< Auto DMA Total Count for USB DMA request line 2                           */
            uint32_t            : 8;
    } ADMATOTCOUNT2_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT3;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT3 : 24;        /*!< Auto DMA Total Count for USB DMA request line 3                           */
            uint32_t            : 8;
    } ADMATOTCOUNT3_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT4;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT4 : 24;        /*!< Auto DMA Total Count for USB DMA request line 4                           */
            uint32_t            : 8;
    } ADMATOTCOUNT4_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT5;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT5 : 24;        /*!< Auto DMA Total Count for USB DMA request line 5                           */
            uint32_t            : 8;
    } ADMATOTCOUNT5_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT6;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT6 : 24;        /*!< Auto DMA Total Count for USB DMA request line 6                           */
            uint32_t            : 8;
    } ADMATOTCOUNT6_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT7;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT7 : 24;        /*!< Auto DMA Total Count for USB DMA request line 7                           */
            uint32_t            : 8;
    } ADMATOTCOUNT7_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT8;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT8 : 24;        /*!< Auto DMA Total Count for USB DMA request line 8                           */
            uint32_t            : 8;
    } ADMATOTCOUNT8_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT9;               /*!< Auto DMA Enable Register                                                  */

    struct {
      __IOM uint32_t ADMATOTCOUNT9 : 24;        /*!< Auto DMA Total Count for USB DMA request line 9                           */
            uint32_t            : 8;
    } ADMATOTCOUNT9_b;
  } ;
  __IM  uint32_t  RESERVED7[54];

  union {
    __IOM uint32_t ADMATARGADDR0;               /*!< Auto DMA Target Address 0                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR0 : 32;        /*!< Auto DMA Target Address for USB DMA request line 0                        */
    } ADMATARGADDR0_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR1;               /*!< Auto DMA Target Address 1                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR1 : 32;        /*!< Auto DMA Target Address for USB DMA request line 1                        */
    } ADMATARGADDR1_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR2;               /*!< Auto DMA Target Address 2                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR2 : 32;        /*!< Auto DMA Target Address for USB DMA request line 2                        */
    } ADMATARGADDR2_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR3;               /*!< Auto DMA Target Address 3                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR3 : 32;        /*!< Auto DMA Target Address for USB DMA request line 3                        */
    } ADMATARGADDR3_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR4;               /*!< Auto DMA Target Address 4                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR4 : 32;        /*!< Auto DMA Target Address for USB DMA request line 4                        */
    } ADMATARGADDR4_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR5;               /*!< Auto DMA Target Address 5                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR5 : 32;        /*!< Auto DMA Target Address for USB DMA request line 5                        */
    } ADMATARGADDR5_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR6;               /*!< Auto DMA Target Address 6                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR6 : 32;        /*!< Auto DMA Target Address for USB DMA request line 6                        */
    } ADMATARGADDR6_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR7;               /*!< Auto DMA Target Address 7                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR7 : 32;        /*!< Auto DMA Target Address for USB DMA request line 7                        */
    } ADMATARGADDR7_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR8;               /*!< Auto DMA Target Address 8                                                 */

