zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
    struct {
      __IOM uint32_t ADMATARGADDR8 : 32;        /*!< Auto DMA Target Address for USB DMA request line 8                        */
    } ADMATARGADDR8_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR9;               /*!< Auto DMA Target Address 9                                                 */

    struct {
      __IOM uint32_t ADMATARGADDR9 : 32;        /*!< Auto DMA Target Address for USB DMA request line 9                        */
    } ADMATARGADDR9_b;
  } ;
  __IM  uint32_t  RESERVED8[54];

  union {
    __IOM uint32_t ADMAEP0;                     /*!< Auto DMA EP Number 0                                                      */

    struct {
      __IOM uint32_t ADMAEP0    : 3;            /*!< Auto DMA EP Number for USB DMA request line 0                             */
            uint32_t            : 29;
    } ADMAEP0_b;
  } ;

  union {
    __IOM uint32_t ADMAEP1;                     /*!< Auto DMA EP Number 1                                                      */

    struct {
      __IOM uint32_t ADMAEP1    : 3;            /*!< Auto DMA EP Number for USB DMA request line 1                             */
            uint32_t            : 29;
    } ADMAEP1_b;
  } ;

  union {
    __IOM uint32_t ADMAEP2;                     /*!< Auto DMA EP Number 2                                                      */

    struct {
      __IOM uint32_t ADMAEP2    : 3;            /*!< Auto DMA EP Number for USB DMA request line 2                             */
            uint32_t            : 29;
    } ADMAEP2_b;
  } ;

  union {
    __IOM uint32_t ADMAEP3;                     /*!< Auto DMA EP Number 3                                                      */

    struct {
      __IOM uint32_t ADMAEP3    : 3;            /*!< Auto DMA EP Number for USB DMA request line 3                             */
            uint32_t            : 29;
    } ADMAEP3_b;
  } ;

  union {
    __IOM uint32_t ADMAEP4;                     /*!< Auto DMA EP Number 4                                                      */

    struct {
      __IOM uint32_t ADMAEP4    : 3;            /*!< Auto DMA EP Number for USB DMA request line 4                             */
            uint32_t            : 29;
    } ADMAEP4_b;
  } ;

  union {
    __IOM uint32_t ADMAEP5;                     /*!< Auto DMA EP Number 5                                                      */

    struct {
      __IOM uint32_t ADMAEP5    : 3;            /*!< Auto DMA EP Number for USB DMA request line 5                             */
            uint32_t            : 29;
    } ADMAEP5_b;
  } ;

  union {
    __IOM uint32_t ADMAEP6;                     /*!< Auto DMA EP Number 6                                                      */

    struct {
      __IOM uint32_t ADMAEP6    : 3;            /*!< Auto DMA EP Number for USB DMA request line 6                             */
            uint32_t            : 29;
    } ADMAEP6_b;
  } ;

  union {
    __IOM uint32_t ADMAEP7;                     /*!< Auto DMA EP Number 7                                                      */

    struct {
      __IOM uint32_t ADMAEP7    : 3;            /*!< Auto DMA EP Number for USB DMA request line 7                             */
            uint32_t            : 29;
    } ADMAEP7_b;
  } ;

  union {
    __IOM uint32_t ADMAEP8;                     /*!< Auto DMA EP Number 8                                                      */

    struct {
      __IOM uint32_t ADMAEP8    : 3;            /*!< Auto DMA EP Number for USB DMA request line 8                             */
            uint32_t            : 29;
    } ADMAEP8_b;
  } ;

  union {
    __IOM uint32_t ADMAEP9;                     /*!< Auto DMA EP Number 9                                                      */

    struct {
      __IOM uint32_t ADMAEP9    : 3;            /*!< Auto DMA EP Number for USB DMA request line 9                             */
            uint32_t            : 29;
    } ADMAEP9_b;
  } ;
  __IM  uint32_t  RESERVED9[54];

  union {
    __IOM uint32_t ADMAREQSIZE0;                /*!< Auto DMA Request Size 0                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE0 : 12;         /*!< Auto DMA Request Size for USB DMA request line 0                          */
            uint32_t            : 20;
    } ADMAREQSIZE0_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE1;                /*!< Auto DMA Request Size 1                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE1 : 12;         /*!< Auto DMA Request Size for USB DMA request line 1                          */
            uint32_t            : 20;
    } ADMAREQSIZE1_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE2;                /*!< Auto DMA Request Size 2                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE2 : 12;         /*!< Auto DMA Request Size for USB DMA request line 2                          */
            uint32_t            : 20;
    } ADMAREQSIZE2_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE3;                /*!< Auto DMA Request Size 3                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE3 : 12;         /*!< Auto DMA Request Size for USB DMA request line 3                          */
            uint32_t            : 20;
    } ADMAREQSIZE3_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE4;                /*!< Auto DMA Request Size 4                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE4 : 12;         /*!< Auto DMA Request Size for USB DMA request line 4                          */
            uint32_t            : 20;
    } ADMAREQSIZE4_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE5;                /*!< Auto DMA Request Size 5                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE5 : 12;         /*!< Auto DMA Request Size for USB DMA request line 5                          */
            uint32_t            : 20;
    } ADMAREQSIZE5_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE6;                /*!< Auto DMA Request Size 6                                                   */

