zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG110_PULLCFG110_Msk     (0xe000UL)                /*!< PULLCFG110 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG110_SR110_Pos          (12UL)                    /*!< SR110 (Bit 12)                                        */
#define GPIO_PINCFG110_SR110_Msk          (0x1000UL)                /*!< SR110 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG110_DS110_Pos          (10UL)                    /*!< DS110 (Bit 10)                                        */
#define GPIO_PINCFG110_DS110_Msk          (0xc00UL)                 /*!< DS110 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG110_OUTCFG110_Pos      (8UL)                     /*!< OUTCFG110 (Bit 8)                                     */
#define GPIO_PINCFG110_OUTCFG110_Msk      (0x300UL)                 /*!< OUTCFG110 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG110_IRPTEN110_Pos      (6UL)                     /*!< IRPTEN110 (Bit 6)                                     */
#define GPIO_PINCFG110_IRPTEN110_Msk      (0xc0UL)                  /*!< IRPTEN110 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG110_RDZERO110_Pos      (5UL)                     /*!< RDZERO110 (Bit 5)                                     */
#define GPIO_PINCFG110_RDZERO110_Msk      (0x20UL)                  /*!< RDZERO110 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG110_INPEN110_Pos       (4UL)                     /*!< INPEN110 (Bit 4)                                      */
#define GPIO_PINCFG110_INPEN110_Msk       (0x10UL)                  /*!< INPEN110 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG110_FNCSEL110_Pos      (0UL)                     /*!< FNCSEL110 (Bit 0)                                     */
#define GPIO_PINCFG110_FNCSEL110_Msk      (0xfUL)                   /*!< FNCSEL110 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG111  ======================================================= */
#define GPIO_PINCFG111_FOEN111_Pos        (27UL)                    /*!< FOEN111 (Bit 27)                                      */
#define GPIO_PINCFG111_FOEN111_Msk        (0x8000000UL)             /*!< FOEN111 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG111_FIEN111_Pos        (26UL)                    /*!< FIEN111 (Bit 26)                                      */
#define GPIO_PINCFG111_FIEN111_Msk        (0x4000000UL)             /*!< FIEN111 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG111_NCEPOL111_Pos      (22UL)                    /*!< NCEPOL111 (Bit 22)                                    */
#define GPIO_PINCFG111_NCEPOL111_Msk      (0x400000UL)              /*!< NCEPOL111 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG111_NCESRC111_Pos      (16UL)                    /*!< NCESRC111 (Bit 16)                                    */
#define GPIO_PINCFG111_NCESRC111_Msk      (0x3f0000UL)              /*!< NCESRC111 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG111_PULLCFG111_Pos     (13UL)                    /*!< PULLCFG111 (Bit 13)                                   */
#define GPIO_PINCFG111_PULLCFG111_Msk     (0xe000UL)                /*!< PULLCFG111 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG111_SR111_Pos          (12UL)                    /*!< SR111 (Bit 12)                                        */
#define GPIO_PINCFG111_SR111_Msk          (0x1000UL)                /*!< SR111 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG111_DS111_Pos          (10UL)                    /*!< DS111 (Bit 10)                                        */
#define GPIO_PINCFG111_DS111_Msk          (0xc00UL)                 /*!< DS111 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG111_OUTCFG111_Pos      (8UL)                     /*!< OUTCFG111 (Bit 8)                                     */
#define GPIO_PINCFG111_OUTCFG111_Msk      (0x300UL)                 /*!< OUTCFG111 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG111_IRPTEN111_Pos      (6UL)                     /*!< IRPTEN111 (Bit 6)                                     */
#define GPIO_PINCFG111_IRPTEN111_Msk      (0xc0UL)                  /*!< IRPTEN111 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG111_RDZERO111_Pos      (5UL)                     /*!< RDZERO111 (Bit 5)                                     */
#define GPIO_PINCFG111_RDZERO111_Msk      (0x20UL)                  /*!< RDZERO111 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG111_INPEN111_Pos       (4UL)                     /*!< INPEN111 (Bit 4)                                      */
#define GPIO_PINCFG111_INPEN111_Msk       (0x10UL)                  /*!< INPEN111 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG111_FNCSEL111_Pos      (0UL)                     /*!< FNCSEL111 (Bit 0)                                     */
#define GPIO_PINCFG111_FNCSEL111_Msk      (0xfUL)                   /*!< FNCSEL111 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG112  ======================================================= */
#define GPIO_PINCFG112_FOEN112_Pos        (27UL)                    /*!< FOEN112 (Bit 27)                                      */
#define GPIO_PINCFG112_FOEN112_Msk        (0x8000000UL)             /*!< FOEN112 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG112_FIEN112_Pos        (26UL)                    /*!< FIEN112 (Bit 26)                                      */
#define GPIO_PINCFG112_FIEN112_Msk        (0x4000000UL)             /*!< FIEN112 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG112_NCEPOL112_Pos      (22UL)                    /*!< NCEPOL112 (Bit 22)                                    */
#define GPIO_PINCFG112_NCEPOL112_Msk      (0x400000UL)              /*!< NCEPOL112 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG112_NCESRC112_Pos      (16UL)                    /*!< NCESRC112 (Bit 16)                                    */
#define GPIO_PINCFG112_NCESRC112_Msk      (0x3f0000UL)              /*!< NCESRC112 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG112_PULLCFG112_Pos     (13UL)                    /*!< PULLCFG112 (Bit 13)                                   */
#define GPIO_PINCFG112_PULLCFG112_Msk     (0xe000UL)                /*!< PULLCFG112 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG112_SR112_Pos          (12UL)                    /*!< SR112 (Bit 12)                                        */
#define GPIO_PINCFG112_SR112_Msk          (0x1000UL)                /*!< SR112 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG112_DS112_Pos          (10UL)                    /*!< DS112 (Bit 10)                                        */
#define GPIO_PINCFG112_DS112_Msk          (0xc00UL)                 /*!< DS112 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG112_OUTCFG112_Pos      (8UL)                     /*!< OUTCFG112 (Bit 8)                                     */
#define GPIO_PINCFG112_OUTCFG112_Msk      (0x300UL)                 /*!< OUTCFG112 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG112_IRPTEN112_Pos      (6UL)                     /*!< IRPTEN112 (Bit 6)                                     */
#define GPIO_PINCFG112_IRPTEN112_Msk      (0xc0UL)                  /*!< IRPTEN112 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG112_RDZERO112_Pos      (5UL)                     /*!< RDZERO112 (Bit 5)                                     */
#define GPIO_PINCFG112_RDZERO112_Msk      (0x20UL)                  /*!< RDZERO112 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG112_INPEN112_Pos       (4UL)                     /*!< INPEN112 (Bit 4)                                      */
#define GPIO_PINCFG112_INPEN112_Msk       (0x10UL)                  /*!< INPEN112 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG112_FNCSEL112_Pos      (0UL)                     /*!< FNCSEL112 (Bit 0)                                     */
#define GPIO_PINCFG112_FNCSEL112_Msk      (0xfUL)                   /*!< FNCSEL112 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG113  ======================================================= */
#define GPIO_PINCFG113_FOEN113_Pos        (27UL)                    /*!< FOEN113 (Bit 27)                                      */
#define GPIO_PINCFG113_FOEN113_Msk        (0x8000000UL)             /*!< FOEN113 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG113_FIEN113_Pos        (26UL)                    /*!< FIEN113 (Bit 26)                                      */
#define GPIO_PINCFG113_FIEN113_Msk        (0x4000000UL)             /*!< FIEN113 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG113_NCEPOL113_Pos      (22UL)                    /*!< NCEPOL113 (Bit 22)                                    */
#define GPIO_PINCFG113_NCEPOL113_Msk      (0x400000UL)              /*!< NCEPOL113 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG113_NCESRC113_Pos      (16UL)                    /*!< NCESRC113 (Bit 16)                                    */
#define GPIO_PINCFG113_NCESRC113_Msk      (0x3f0000UL)              /*!< NCESRC113 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG113_PULLCFG113_Pos     (13UL)                    /*!< PULLCFG113 (Bit 13)                                   */
#define GPIO_PINCFG113_PULLCFG113_Msk     (0xe000UL)                /*!< PULLCFG113 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG113_SR113_Pos          (12UL)                    /*!< SR113 (Bit 12)                                        */
#define GPIO_PINCFG113_SR113_Msk          (0x1000UL)                /*!< SR113 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG113_DS113_Pos          (10UL)                    /*!< DS113 (Bit 10)                                        */
#define GPIO_PINCFG113_DS113_Msk          (0xc00UL)                 /*!< DS113 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG113_OUTCFG113_Pos      (8UL)                     /*!< OUTCFG113 (Bit 8)                                     */
#define GPIO_PINCFG113_OUTCFG113_Msk      (0x300UL)                 /*!< OUTCFG113 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG113_IRPTEN113_Pos      (6UL)                     /*!< IRPTEN113 (Bit 6)                                     */
#define GPIO_PINCFG113_IRPTEN113_Msk      (0xc0UL)                  /*!< IRPTEN113 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG113_RDZERO113_Pos      (5UL)                     /*!< RDZERO113 (Bit 5)                                     */
#define GPIO_PINCFG113_RDZERO113_Msk      (0x20UL)                  /*!< RDZERO113 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG113_INPEN113_Pos       (4UL)                     /*!< INPEN113 (Bit 4)                                      */
#define GPIO_PINCFG113_INPEN113_Msk       (0x10UL)                  /*!< INPEN113 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG113_FNCSEL113_Pos      (0UL)                     /*!< FNCSEL113 (Bit 0)                                     */
#define GPIO_PINCFG113_FNCSEL113_Msk      (0xfUL)                   /*!< FNCSEL113 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG114  ======================================================= */
#define GPIO_PINCFG114_FOEN114_Pos        (27UL)                    /*!< FOEN114 (Bit 27)                                      */
#define GPIO_PINCFG114_FOEN114_Msk        (0x8000000UL)             /*!< FOEN114 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG114_FIEN114_Pos        (26UL)                    /*!< FIEN114 (Bit 26)                                      */
#define GPIO_PINCFG114_FIEN114_Msk        (0x4000000UL)             /*!< FIEN114 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG114_NCEPOL114_Pos      (22UL)                    /*!< NCEPOL114 (Bit 22)                                    */
#define GPIO_PINCFG114_NCEPOL114_Msk      (0x400000UL)              /*!< NCEPOL114 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG114_NCESRC114_Pos      (16UL)                    /*!< NCESRC114 (Bit 16)                                    */
#define GPIO_PINCFG114_NCESRC114_Msk      (0x3f0000UL)              /*!< NCESRC114 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG114_PULLCFG114_Pos     (13UL)                    /*!< PULLCFG114 (Bit 13)                                   */
#define GPIO_PINCFG114_PULLCFG114_Msk     (0xe000UL)                /*!< PULLCFG114 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG114_SR114_Pos          (12UL)                    /*!< SR114 (Bit 12)                                        */
#define GPIO_PINCFG114_SR114_Msk          (0x1000UL)                /*!< SR114 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG114_DS114_Pos          (10UL)                    /*!< DS114 (Bit 10)                                        */
#define GPIO_PINCFG114_DS114_Msk          (0xc00UL)                 /*!< DS114 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG114_OUTCFG114_Pos      (8UL)                     /*!< OUTCFG114 (Bit 8)                                     */
#define GPIO_PINCFG114_OUTCFG114_Msk      (0x300UL)                 /*!< OUTCFG114 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG114_IRPTEN114_Pos      (6UL)                     /*!< IRPTEN114 (Bit 6)                                     */
#define GPIO_PINCFG114_IRPTEN114_Msk      (0xc0UL)                  /*!< IRPTEN114 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG114_RDZERO114_Pos      (5UL)                     /*!< RDZERO114 (Bit 5)                                     */
#define GPIO_PINCFG114_RDZERO114_Msk      (0x20UL)                  /*!< RDZERO114 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG114_INPEN114_Pos       (4UL)                     /*!< INPEN114 (Bit 4)                                      */
#define GPIO_PINCFG114_INPEN114_Msk       (0x10UL)                  /*!< INPEN114 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG114_FNCSEL114_Pos      (0UL)                     /*!< FNCSEL114 (Bit 0)                                     */
#define GPIO_PINCFG114_FNCSEL114_Msk      (0xfUL)                   /*!< FNCSEL114 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG115  ======================================================= */
#define GPIO_PINCFG115_FOEN115_Pos        (27UL)                    /*!< FOEN115 (Bit 27)                                      */
#define GPIO_PINCFG115_FOEN115_Msk        (0x8000000UL)             /*!< FOEN115 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG115_FIEN115_Pos        (26UL)                    /*!< FIEN115 (Bit 26)                                      */
#define GPIO_PINCFG115_FIEN115_Msk        (0x4000000UL)             /*!< FIEN115 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG115_NCEPOL115_Pos      (22UL)                    /*!< NCEPOL115 (Bit 22)                                    */
#define GPIO_PINCFG115_NCEPOL115_Msk      (0x400000UL)              /*!< NCEPOL115 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG115_NCESRC115_Pos      (16UL)                    /*!< NCESRC115 (Bit 16)                                    */
#define GPIO_PINCFG115_NCESRC115_Msk      (0x3f0000UL)              /*!< NCESRC115 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG115_PULLCFG115_Pos     (13UL)                    /*!< PULLCFG115 (Bit 13)                                   */
#define GPIO_PINCFG115_PULLCFG115_Msk     (0xe000UL)                /*!< PULLCFG115 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG115_SR115_Pos          (12UL)                    /*!< SR115 (Bit 12)                                        */
#define GPIO_PINCFG115_SR115_Msk          (0x1000UL)                /*!< SR115 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG115_DS115_Pos          (10UL)                    /*!< DS115 (Bit 10)                                        */
#define GPIO_PINCFG115_DS115_Msk          (0xc00UL)                 /*!< DS115 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG115_OUTCFG115_Pos      (8UL)                     /*!< OUTCFG115 (Bit 8)                                     */
#define GPIO_PINCFG115_OUTCFG115_Msk      (0x300UL)                 /*!< OUTCFG115 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG115_IRPTEN115_Pos      (6UL)                     /*!< IRPTEN115 (Bit 6)                                     */
#define GPIO_PINCFG115_IRPTEN115_Msk      (0xc0UL)                  /*!< IRPTEN115 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG115_RDZERO115_Pos      (5UL)                     /*!< RDZERO115 (Bit 5)                                     */
#define GPIO_PINCFG115_RDZERO115_Msk      (0x20UL)                  /*!< RDZERO115 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG115_INPEN115_Pos       (4UL)                     /*!< INPEN115 (Bit 4)                                      */
#define GPIO_PINCFG115_INPEN115_Msk       (0x10UL)                  /*!< INPEN115 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG115_FNCSEL115_Pos      (0UL)                     /*!< FNCSEL115 (Bit 0)                                     */
#define GPIO_PINCFG115_FNCSEL115_Msk      (0xfUL)                   /*!< FNCSEL115 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG116  ======================================================= */
#define GPIO_PINCFG116_FOEN116_Pos        (27UL)                    /*!< FOEN116 (Bit 27)                                      */
#define GPIO_PINCFG116_FOEN116_Msk        (0x8000000UL)             /*!< FOEN116 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG116_FIEN116_Pos        (26UL)                    /*!< FIEN116 (Bit 26)                                      */
#define GPIO_PINCFG116_FIEN116_Msk        (0x4000000UL)             /*!< FIEN116 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG116_NCEPOL116_Pos      (22UL)                    /*!< NCEPOL116 (Bit 22)                                    */
#define GPIO_PINCFG116_NCEPOL116_Msk      (0x400000UL)              /*!< NCEPOL116 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG116_NCESRC116_Pos      (16UL)                    /*!< NCESRC116 (Bit 16)                                    */
#define GPIO_PINCFG116_NCESRC116_Msk      (0x3f0000UL)              /*!< NCESRC116 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG116_PULLCFG116_Pos     (13UL)                    /*!< PULLCFG116 (Bit 13)                                   */
#define GPIO_PINCFG116_PULLCFG116_Msk     (0xe000UL)                /*!< PULLCFG116 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG116_SR116_Pos          (12UL)                    /*!< SR116 (Bit 12)                                        */
#define GPIO_PINCFG116_SR116_Msk          (0x1000UL)                /*!< SR116 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG116_DS116_Pos          (10UL)                    /*!< DS116 (Bit 10)                                        */
#define GPIO_PINCFG116_DS116_Msk          (0xc00UL)                 /*!< DS116 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG116_OUTCFG116_Pos      (8UL)                     /*!< OUTCFG116 (Bit 8)                                     */
#define GPIO_PINCFG116_OUTCFG116_Msk      (0x300UL)                 /*!< OUTCFG116 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG116_IRPTEN116_Pos      (6UL)                     /*!< IRPTEN116 (Bit 6)                                     */
#define GPIO_PINCFG116_IRPTEN116_Msk      (0xc0UL)                  /*!< IRPTEN116 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG116_RDZERO116_Pos      (5UL)                     /*!< RDZERO116 (Bit 5)                                     */
#define GPIO_PINCFG116_RDZERO116_Msk      (0x20UL)                  /*!< RDZERO116 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG116_INPEN116_Pos       (4UL)                     /*!< INPEN116 (Bit 4)                                      */
#define GPIO_PINCFG116_INPEN116_Msk       (0x10UL)                  /*!< INPEN116 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG116_FNCSEL116_Pos      (0UL)                     /*!< FNCSEL116 (Bit 0)                                     */
#define GPIO_PINCFG116_FNCSEL116_Msk      (0xfUL)                   /*!< FNCSEL116 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG117  ======================================================= */
#define GPIO_PINCFG117_FOEN117_Pos        (27UL)                    /*!< FOEN117 (Bit 27)                                      */
#define GPIO_PINCFG117_FOEN117_Msk        (0x8000000UL)             /*!< FOEN117 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG117_FIEN117_Pos        (26UL)                    /*!< FIEN117 (Bit 26)                                      */
#define GPIO_PINCFG117_FIEN117_Msk        (0x4000000UL)             /*!< FIEN117 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG117_NCEPOL117_Pos      (22UL)                    /*!< NCEPOL117 (Bit 22)                                    */
#define GPIO_PINCFG117_NCEPOL117_Msk      (0x400000UL)              /*!< NCEPOL117 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG117_NCESRC117_Pos      (16UL)                    /*!< NCESRC117 (Bit 16)                                    */
#define GPIO_PINCFG117_NCESRC117_Msk      (0x3f0000UL)              /*!< NCESRC117 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG117_PULLCFG117_Pos     (13UL)                    /*!< PULLCFG117 (Bit 13)                                   */
#define GPIO_PINCFG117_PULLCFG117_Msk     (0xe000UL)                /*!< PULLCFG117 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG117_SR117_Pos          (12UL)                    /*!< SR117 (Bit 12)                                        */
#define GPIO_PINCFG117_SR117_Msk          (0x1000UL)                /*!< SR117 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG117_DS117_Pos          (10UL)                    /*!< DS117 (Bit 10)                                        */
#define GPIO_PINCFG117_DS117_Msk          (0xc00UL)                 /*!< DS117 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG117_OUTCFG117_Pos      (8UL)                     /*!< OUTCFG117 (Bit 8)                                     */
#define GPIO_PINCFG117_OUTCFG117_Msk      (0x300UL)                 /*!< OUTCFG117 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG117_IRPTEN117_Pos      (6UL)                     /*!< IRPTEN117 (Bit 6)                                     */
#define GPIO_PINCFG117_IRPTEN117_Msk      (0xc0UL)                  /*!< IRPTEN117 (Bitfield-Mask: 0x03)                       */
