zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG117_RDZERO117_Pos      (5UL)                     /*!< RDZERO117 (Bit 5)                                     */
#define GPIO_PINCFG117_RDZERO117_Msk      (0x20UL)                  /*!< RDZERO117 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG117_INPEN117_Pos       (4UL)                     /*!< INPEN117 (Bit 4)                                      */
#define GPIO_PINCFG117_INPEN117_Msk       (0x10UL)                  /*!< INPEN117 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG117_FNCSEL117_Pos      (0UL)                     /*!< FNCSEL117 (Bit 0)                                     */
#define GPIO_PINCFG117_FNCSEL117_Msk      (0xfUL)                   /*!< FNCSEL117 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG118  ======================================================= */
#define GPIO_PINCFG118_FOEN118_Pos        (27UL)                    /*!< FOEN118 (Bit 27)                                      */
#define GPIO_PINCFG118_FOEN118_Msk        (0x8000000UL)             /*!< FOEN118 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG118_FIEN118_Pos        (26UL)                    /*!< FIEN118 (Bit 26)                                      */
#define GPIO_PINCFG118_FIEN118_Msk        (0x4000000UL)             /*!< FIEN118 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG118_NCEPOL118_Pos      (22UL)                    /*!< NCEPOL118 (Bit 22)                                    */
#define GPIO_PINCFG118_NCEPOL118_Msk      (0x400000UL)              /*!< NCEPOL118 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG118_NCESRC118_Pos      (16UL)                    /*!< NCESRC118 (Bit 16)                                    */
#define GPIO_PINCFG118_NCESRC118_Msk      (0x3f0000UL)              /*!< NCESRC118 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG118_PULLCFG118_Pos     (13UL)                    /*!< PULLCFG118 (Bit 13)                                   */
#define GPIO_PINCFG118_PULLCFG118_Msk     (0xe000UL)                /*!< PULLCFG118 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG118_SR118_Pos          (12UL)                    /*!< SR118 (Bit 12)                                        */
#define GPIO_PINCFG118_SR118_Msk          (0x1000UL)                /*!< SR118 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG118_DS118_Pos          (10UL)                    /*!< DS118 (Bit 10)                                        */
#define GPIO_PINCFG118_DS118_Msk          (0xc00UL)                 /*!< DS118 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG118_OUTCFG118_Pos      (8UL)                     /*!< OUTCFG118 (Bit 8)                                     */
#define GPIO_PINCFG118_OUTCFG118_Msk      (0x300UL)                 /*!< OUTCFG118 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG118_IRPTEN118_Pos      (6UL)                     /*!< IRPTEN118 (Bit 6)                                     */
#define GPIO_PINCFG118_IRPTEN118_Msk      (0xc0UL)                  /*!< IRPTEN118 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG118_RDZERO118_Pos      (5UL)                     /*!< RDZERO118 (Bit 5)                                     */
#define GPIO_PINCFG118_RDZERO118_Msk      (0x20UL)                  /*!< RDZERO118 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG118_INPEN118_Pos       (4UL)                     /*!< INPEN118 (Bit 4)                                      */
#define GPIO_PINCFG118_INPEN118_Msk       (0x10UL)                  /*!< INPEN118 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG118_FNCSEL118_Pos      (0UL)                     /*!< FNCSEL118 (Bit 0)                                     */
#define GPIO_PINCFG118_FNCSEL118_Msk      (0xfUL)                   /*!< FNCSEL118 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG119  ======================================================= */
#define GPIO_PINCFG119_FOEN119_Pos        (27UL)                    /*!< FOEN119 (Bit 27)                                      */
#define GPIO_PINCFG119_FOEN119_Msk        (0x8000000UL)             /*!< FOEN119 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG119_FIEN119_Pos        (26UL)                    /*!< FIEN119 (Bit 26)                                      */
#define GPIO_PINCFG119_FIEN119_Msk        (0x4000000UL)             /*!< FIEN119 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG119_NCEPOL119_Pos      (22UL)                    /*!< NCEPOL119 (Bit 22)                                    */
#define GPIO_PINCFG119_NCEPOL119_Msk      (0x400000UL)              /*!< NCEPOL119 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG119_NCESRC119_Pos      (16UL)                    /*!< NCESRC119 (Bit 16)                                    */
#define GPIO_PINCFG119_NCESRC119_Msk      (0x3f0000UL)              /*!< NCESRC119 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG119_PULLCFG119_Pos     (13UL)                    /*!< PULLCFG119 (Bit 13)                                   */
#define GPIO_PINCFG119_PULLCFG119_Msk     (0xe000UL)                /*!< PULLCFG119 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG119_SR119_Pos          (12UL)                    /*!< SR119 (Bit 12)                                        */
#define GPIO_PINCFG119_SR119_Msk          (0x1000UL)                /*!< SR119 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG119_DS119_Pos          (10UL)                    /*!< DS119 (Bit 10)                                        */
#define GPIO_PINCFG119_DS119_Msk          (0xc00UL)                 /*!< DS119 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG119_OUTCFG119_Pos      (8UL)                     /*!< OUTCFG119 (Bit 8)                                     */
#define GPIO_PINCFG119_OUTCFG119_Msk      (0x300UL)                 /*!< OUTCFG119 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG119_IRPTEN119_Pos      (6UL)                     /*!< IRPTEN119 (Bit 6)                                     */
#define GPIO_PINCFG119_IRPTEN119_Msk      (0xc0UL)                  /*!< IRPTEN119 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG119_RDZERO119_Pos      (5UL)                     /*!< RDZERO119 (Bit 5)                                     */
#define GPIO_PINCFG119_RDZERO119_Msk      (0x20UL)                  /*!< RDZERO119 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG119_INPEN119_Pos       (4UL)                     /*!< INPEN119 (Bit 4)                                      */
#define GPIO_PINCFG119_INPEN119_Msk       (0x10UL)                  /*!< INPEN119 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG119_FNCSEL119_Pos      (0UL)                     /*!< FNCSEL119 (Bit 0)                                     */
#define GPIO_PINCFG119_FNCSEL119_Msk      (0xfUL)                   /*!< FNCSEL119 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG120  ======================================================= */
#define GPIO_PINCFG120_FOEN120_Pos        (27UL)                    /*!< FOEN120 (Bit 27)                                      */
#define GPIO_PINCFG120_FOEN120_Msk        (0x8000000UL)             /*!< FOEN120 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG120_FIEN120_Pos        (26UL)                    /*!< FIEN120 (Bit 26)                                      */
#define GPIO_PINCFG120_FIEN120_Msk        (0x4000000UL)             /*!< FIEN120 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG120_NCEPOL120_Pos      (22UL)                    /*!< NCEPOL120 (Bit 22)                                    */
#define GPIO_PINCFG120_NCEPOL120_Msk      (0x400000UL)              /*!< NCEPOL120 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG120_NCESRC120_Pos      (16UL)                    /*!< NCESRC120 (Bit 16)                                    */
#define GPIO_PINCFG120_NCESRC120_Msk      (0x3f0000UL)              /*!< NCESRC120 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG120_PULLCFG120_Pos     (13UL)                    /*!< PULLCFG120 (Bit 13)                                   */
#define GPIO_PINCFG120_PULLCFG120_Msk     (0xe000UL)                /*!< PULLCFG120 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG120_SR120_Pos          (12UL)                    /*!< SR120 (Bit 12)                                        */
#define GPIO_PINCFG120_SR120_Msk          (0x1000UL)                /*!< SR120 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG120_DS120_Pos          (10UL)                    /*!< DS120 (Bit 10)                                        */
#define GPIO_PINCFG120_DS120_Msk          (0xc00UL)                 /*!< DS120 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG120_OUTCFG120_Pos      (8UL)                     /*!< OUTCFG120 (Bit 8)                                     */
#define GPIO_PINCFG120_OUTCFG120_Msk      (0x300UL)                 /*!< OUTCFG120 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG120_IRPTEN120_Pos      (6UL)                     /*!< IRPTEN120 (Bit 6)                                     */
#define GPIO_PINCFG120_IRPTEN120_Msk      (0xc0UL)                  /*!< IRPTEN120 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG120_RDZERO120_Pos      (5UL)                     /*!< RDZERO120 (Bit 5)                                     */
#define GPIO_PINCFG120_RDZERO120_Msk      (0x20UL)                  /*!< RDZERO120 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG120_INPEN120_Pos       (4UL)                     /*!< INPEN120 (Bit 4)                                      */
#define GPIO_PINCFG120_INPEN120_Msk       (0x10UL)                  /*!< INPEN120 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG120_FNCSEL120_Pos      (0UL)                     /*!< FNCSEL120 (Bit 0)                                     */
#define GPIO_PINCFG120_FNCSEL120_Msk      (0xfUL)                   /*!< FNCSEL120 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG121  ======================================================= */
#define GPIO_PINCFG121_FOEN121_Pos        (27UL)                    /*!< FOEN121 (Bit 27)                                      */
#define GPIO_PINCFG121_FOEN121_Msk        (0x8000000UL)             /*!< FOEN121 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG121_FIEN121_Pos        (26UL)                    /*!< FIEN121 (Bit 26)                                      */
#define GPIO_PINCFG121_FIEN121_Msk        (0x4000000UL)             /*!< FIEN121 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG121_NCEPOL121_Pos      (22UL)                    /*!< NCEPOL121 (Bit 22)                                    */
#define GPIO_PINCFG121_NCEPOL121_Msk      (0x400000UL)              /*!< NCEPOL121 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG121_NCESRC121_Pos      (16UL)                    /*!< NCESRC121 (Bit 16)                                    */
#define GPIO_PINCFG121_NCESRC121_Msk      (0x3f0000UL)              /*!< NCESRC121 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG121_PULLCFG121_Pos     (13UL)                    /*!< PULLCFG121 (Bit 13)                                   */
#define GPIO_PINCFG121_PULLCFG121_Msk     (0xe000UL)                /*!< PULLCFG121 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG121_SR121_Pos          (12UL)                    /*!< SR121 (Bit 12)                                        */
#define GPIO_PINCFG121_SR121_Msk          (0x1000UL)                /*!< SR121 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG121_DS121_Pos          (10UL)                    /*!< DS121 (Bit 10)                                        */
#define GPIO_PINCFG121_DS121_Msk          (0xc00UL)                 /*!< DS121 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG121_OUTCFG121_Pos      (8UL)                     /*!< OUTCFG121 (Bit 8)                                     */
#define GPIO_PINCFG121_OUTCFG121_Msk      (0x300UL)                 /*!< OUTCFG121 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG121_IRPTEN121_Pos      (6UL)                     /*!< IRPTEN121 (Bit 6)                                     */
#define GPIO_PINCFG121_IRPTEN121_Msk      (0xc0UL)                  /*!< IRPTEN121 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG121_RDZERO121_Pos      (5UL)                     /*!< RDZERO121 (Bit 5)                                     */
#define GPIO_PINCFG121_RDZERO121_Msk      (0x20UL)                  /*!< RDZERO121 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG121_INPEN121_Pos       (4UL)                     /*!< INPEN121 (Bit 4)                                      */
#define GPIO_PINCFG121_INPEN121_Msk       (0x10UL)                  /*!< INPEN121 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG121_FNCSEL121_Pos      (0UL)                     /*!< FNCSEL121 (Bit 0)                                     */
#define GPIO_PINCFG121_FNCSEL121_Msk      (0xfUL)                   /*!< FNCSEL121 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG122  ======================================================= */
#define GPIO_PINCFG122_FOEN122_Pos        (27UL)                    /*!< FOEN122 (Bit 27)                                      */
#define GPIO_PINCFG122_FOEN122_Msk        (0x8000000UL)             /*!< FOEN122 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG122_FIEN122_Pos        (26UL)                    /*!< FIEN122 (Bit 26)                                      */
#define GPIO_PINCFG122_FIEN122_Msk        (0x4000000UL)             /*!< FIEN122 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG122_NCEPOL122_Pos      (22UL)                    /*!< NCEPOL122 (Bit 22)                                    */
#define GPIO_PINCFG122_NCEPOL122_Msk      (0x400000UL)              /*!< NCEPOL122 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG122_NCESRC122_Pos      (16UL)                    /*!< NCESRC122 (Bit 16)                                    */
#define GPIO_PINCFG122_NCESRC122_Msk      (0x3f0000UL)              /*!< NCESRC122 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG122_PULLCFG122_Pos     (13UL)                    /*!< PULLCFG122 (Bit 13)                                   */
#define GPIO_PINCFG122_PULLCFG122_Msk     (0xe000UL)                /*!< PULLCFG122 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG122_SR122_Pos          (12UL)                    /*!< SR122 (Bit 12)                                        */
#define GPIO_PINCFG122_SR122_Msk          (0x1000UL)                /*!< SR122 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG122_DS122_Pos          (10UL)                    /*!< DS122 (Bit 10)                                        */
#define GPIO_PINCFG122_DS122_Msk          (0xc00UL)                 /*!< DS122 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG122_OUTCFG122_Pos      (8UL)                     /*!< OUTCFG122 (Bit 8)                                     */
#define GPIO_PINCFG122_OUTCFG122_Msk      (0x300UL)                 /*!< OUTCFG122 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG122_IRPTEN122_Pos      (6UL)                     /*!< IRPTEN122 (Bit 6)                                     */
#define GPIO_PINCFG122_IRPTEN122_Msk      (0xc0UL)                  /*!< IRPTEN122 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG122_RDZERO122_Pos      (5UL)                     /*!< RDZERO122 (Bit 5)                                     */
#define GPIO_PINCFG122_RDZERO122_Msk      (0x20UL)                  /*!< RDZERO122 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG122_INPEN122_Pos       (4UL)                     /*!< INPEN122 (Bit 4)                                      */
#define GPIO_PINCFG122_INPEN122_Msk       (0x10UL)                  /*!< INPEN122 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG122_FNCSEL122_Pos      (0UL)                     /*!< FNCSEL122 (Bit 0)                                     */
#define GPIO_PINCFG122_FNCSEL122_Msk      (0xfUL)                   /*!< FNCSEL122 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG123  ======================================================= */
#define GPIO_PINCFG123_FOEN123_Pos        (27UL)                    /*!< FOEN123 (Bit 27)                                      */
#define GPIO_PINCFG123_FOEN123_Msk        (0x8000000UL)             /*!< FOEN123 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG123_FIEN123_Pos        (26UL)                    /*!< FIEN123 (Bit 26)                                      */
#define GPIO_PINCFG123_FIEN123_Msk        (0x4000000UL)             /*!< FIEN123 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG123_NCEPOL123_Pos      (22UL)                    /*!< NCEPOL123 (Bit 22)                                    */
#define GPIO_PINCFG123_NCEPOL123_Msk      (0x400000UL)              /*!< NCEPOL123 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG123_NCESRC123_Pos      (16UL)                    /*!< NCESRC123 (Bit 16)                                    */
#define GPIO_PINCFG123_NCESRC123_Msk      (0x3f0000UL)              /*!< NCESRC123 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG123_PULLCFG123_Pos     (13UL)                    /*!< PULLCFG123 (Bit 13)                                   */
#define GPIO_PINCFG123_PULLCFG123_Msk     (0xe000UL)                /*!< PULLCFG123 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG123_SR123_Pos          (12UL)                    /*!< SR123 (Bit 12)                                        */
#define GPIO_PINCFG123_SR123_Msk          (0x1000UL)                /*!< SR123 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG123_DS123_Pos          (10UL)                    /*!< DS123 (Bit 10)                                        */
#define GPIO_PINCFG123_DS123_Msk          (0xc00UL)                 /*!< DS123 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG123_OUTCFG123_Pos      (8UL)                     /*!< OUTCFG123 (Bit 8)                                     */
#define GPIO_PINCFG123_OUTCFG123_Msk      (0x300UL)                 /*!< OUTCFG123 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG123_IRPTEN123_Pos      (6UL)                     /*!< IRPTEN123 (Bit 6)                                     */
#define GPIO_PINCFG123_IRPTEN123_Msk      (0xc0UL)                  /*!< IRPTEN123 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG123_RDZERO123_Pos      (5UL)                     /*!< RDZERO123 (Bit 5)                                     */
#define GPIO_PINCFG123_RDZERO123_Msk      (0x20UL)                  /*!< RDZERO123 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG123_INPEN123_Pos       (4UL)                     /*!< INPEN123 (Bit 4)                                      */
#define GPIO_PINCFG123_INPEN123_Msk       (0x10UL)                  /*!< INPEN123 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG123_FNCSEL123_Pos      (0UL)                     /*!< FNCSEL123 (Bit 0)                                     */
#define GPIO_PINCFG123_FNCSEL123_Msk      (0xfUL)                   /*!< FNCSEL123 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG124  ======================================================= */
#define GPIO_PINCFG124_FOEN124_Pos        (27UL)                    /*!< FOEN124 (Bit 27)                                      */
#define GPIO_PINCFG124_FOEN124_Msk        (0x8000000UL)             /*!< FOEN124 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG124_FIEN124_Pos        (26UL)                    /*!< FIEN124 (Bit 26)                                      */
#define GPIO_PINCFG124_FIEN124_Msk        (0x4000000UL)             /*!< FIEN124 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG124_NCEPOL124_Pos      (22UL)                    /*!< NCEPOL124 (Bit 22)                                    */
#define GPIO_PINCFG124_NCEPOL124_Msk      (0x400000UL)              /*!< NCEPOL124 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG124_NCESRC124_Pos      (16UL)                    /*!< NCESRC124 (Bit 16)                                    */
#define GPIO_PINCFG124_NCESRC124_Msk      (0x3f0000UL)              /*!< NCESRC124 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG124_PULLCFG124_Pos     (13UL)                    /*!< PULLCFG124 (Bit 13)                                   */
#define GPIO_PINCFG124_PULLCFG124_Msk     (0xe000UL)                /*!< PULLCFG124 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG124_SR124_Pos          (12UL)                    /*!< SR124 (Bit 12)                                        */
#define GPIO_PINCFG124_SR124_Msk          (0x1000UL)                /*!< SR124 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG124_DS124_Pos          (10UL)                    /*!< DS124 (Bit 10)                                        */
#define GPIO_PINCFG124_DS124_Msk          (0xc00UL)                 /*!< DS124 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG124_OUTCFG124_Pos      (8UL)                     /*!< OUTCFG124 (Bit 8)                                     */
#define GPIO_PINCFG124_OUTCFG124_Msk      (0x300UL)                 /*!< OUTCFG124 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG124_IRPTEN124_Pos      (6UL)                     /*!< IRPTEN124 (Bit 6)                                     */
#define GPIO_PINCFG124_IRPTEN124_Msk      (0xc0UL)                  /*!< IRPTEN124 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG124_RDZERO124_Pos      (5UL)                     /*!< RDZERO124 (Bit 5)                                     */
#define GPIO_PINCFG124_RDZERO124_Msk      (0x20UL)                  /*!< RDZERO124 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG124_INPEN124_Pos       (4UL)                     /*!< INPEN124 (Bit 4)                                      */
#define GPIO_PINCFG124_INPEN124_Msk       (0x10UL)                  /*!< INPEN124 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG124_FNCSEL124_Pos      (0UL)                     /*!< FNCSEL124 (Bit 0)                                     */
#define GPIO_PINCFG124_FNCSEL124_Msk      (0xfUL)                   /*!< FNCSEL124 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG125  ======================================================= */
#define GPIO_PINCFG125_FOEN125_Pos        (27UL)                    /*!< FOEN125 (Bit 27)                                      */
#define GPIO_PINCFG125_FOEN125_Msk        (0x8000000UL)             /*!< FOEN125 (Bitfield-Mask: 0x01)                         */
