zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG139_INPEN139_Pos       (4UL)                     /*!< INPEN139 (Bit 4)                                      */
#define GPIO_PINCFG139_INPEN139_Msk       (0x10UL)                  /*!< INPEN139 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG139_FNCSEL139_Pos      (0UL)                     /*!< FNCSEL139 (Bit 0)                                     */
#define GPIO_PINCFG139_FNCSEL139_Msk      (0xfUL)                   /*!< FNCSEL139 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG140  ======================================================= */
#define GPIO_PINCFG140_FOEN140_Pos        (27UL)                    /*!< FOEN140 (Bit 27)                                      */
#define GPIO_PINCFG140_FOEN140_Msk        (0x8000000UL)             /*!< FOEN140 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG140_FIEN140_Pos        (26UL)                    /*!< FIEN140 (Bit 26)                                      */
#define GPIO_PINCFG140_FIEN140_Msk        (0x4000000UL)             /*!< FIEN140 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG140_NCEPOL140_Pos      (22UL)                    /*!< NCEPOL140 (Bit 22)                                    */
#define GPIO_PINCFG140_NCEPOL140_Msk      (0x400000UL)              /*!< NCEPOL140 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG140_NCESRC140_Pos      (16UL)                    /*!< NCESRC140 (Bit 16)                                    */
#define GPIO_PINCFG140_NCESRC140_Msk      (0x3f0000UL)              /*!< NCESRC140 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG140_PULLCFG140_Pos     (13UL)                    /*!< PULLCFG140 (Bit 13)                                   */
#define GPIO_PINCFG140_PULLCFG140_Msk     (0xe000UL)                /*!< PULLCFG140 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG140_SR140_Pos          (12UL)                    /*!< SR140 (Bit 12)                                        */
#define GPIO_PINCFG140_SR140_Msk          (0x1000UL)                /*!< SR140 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG140_DS140_Pos          (10UL)                    /*!< DS140 (Bit 10)                                        */
#define GPIO_PINCFG140_DS140_Msk          (0xc00UL)                 /*!< DS140 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG140_OUTCFG140_Pos      (8UL)                     /*!< OUTCFG140 (Bit 8)                                     */
#define GPIO_PINCFG140_OUTCFG140_Msk      (0x300UL)                 /*!< OUTCFG140 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG140_IRPTEN140_Pos      (6UL)                     /*!< IRPTEN140 (Bit 6)                                     */
#define GPIO_PINCFG140_IRPTEN140_Msk      (0xc0UL)                  /*!< IRPTEN140 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG140_RDZERO140_Pos      (5UL)                     /*!< RDZERO140 (Bit 5)                                     */
#define GPIO_PINCFG140_RDZERO140_Msk      (0x20UL)                  /*!< RDZERO140 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG140_INPEN140_Pos       (4UL)                     /*!< INPEN140 (Bit 4)                                      */
#define GPIO_PINCFG140_INPEN140_Msk       (0x10UL)                  /*!< INPEN140 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG140_FNCSEL140_Pos      (0UL)                     /*!< FNCSEL140 (Bit 0)                                     */
#define GPIO_PINCFG140_FNCSEL140_Msk      (0xfUL)                   /*!< FNCSEL140 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG141  ======================================================= */
#define GPIO_PINCFG141_FOEN141_Pos        (27UL)                    /*!< FOEN141 (Bit 27)                                      */
#define GPIO_PINCFG141_FOEN141_Msk        (0x8000000UL)             /*!< FOEN141 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG141_FIEN141_Pos        (26UL)                    /*!< FIEN141 (Bit 26)                                      */
#define GPIO_PINCFG141_FIEN141_Msk        (0x4000000UL)             /*!< FIEN141 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG141_NCEPOL141_Pos      (22UL)                    /*!< NCEPOL141 (Bit 22)                                    */
#define GPIO_PINCFG141_NCEPOL141_Msk      (0x400000UL)              /*!< NCEPOL141 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG141_NCESRC141_Pos      (16UL)                    /*!< NCESRC141 (Bit 16)                                    */
#define GPIO_PINCFG141_NCESRC141_Msk      (0x3f0000UL)              /*!< NCESRC141 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG141_PULLCFG141_Pos     (13UL)                    /*!< PULLCFG141 (Bit 13)                                   */
#define GPIO_PINCFG141_PULLCFG141_Msk     (0xe000UL)                /*!< PULLCFG141 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG141_SR141_Pos          (12UL)                    /*!< SR141 (Bit 12)                                        */
#define GPIO_PINCFG141_SR141_Msk          (0x1000UL)                /*!< SR141 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG141_DS141_Pos          (10UL)                    /*!< DS141 (Bit 10)                                        */
#define GPIO_PINCFG141_DS141_Msk          (0xc00UL)                 /*!< DS141 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG141_OUTCFG141_Pos      (8UL)                     /*!< OUTCFG141 (Bit 8)                                     */
#define GPIO_PINCFG141_OUTCFG141_Msk      (0x300UL)                 /*!< OUTCFG141 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG141_IRPTEN141_Pos      (6UL)                     /*!< IRPTEN141 (Bit 6)                                     */
#define GPIO_PINCFG141_IRPTEN141_Msk      (0xc0UL)                  /*!< IRPTEN141 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG141_RDZERO141_Pos      (5UL)                     /*!< RDZERO141 (Bit 5)                                     */
#define GPIO_PINCFG141_RDZERO141_Msk      (0x20UL)                  /*!< RDZERO141 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG141_INPEN141_Pos       (4UL)                     /*!< INPEN141 (Bit 4)                                      */
#define GPIO_PINCFG141_INPEN141_Msk       (0x10UL)                  /*!< INPEN141 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG141_FNCSEL141_Pos      (0UL)                     /*!< FNCSEL141 (Bit 0)                                     */
#define GPIO_PINCFG141_FNCSEL141_Msk      (0xfUL)                   /*!< FNCSEL141 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG142  ======================================================= */
#define GPIO_PINCFG142_FOEN142_Pos        (27UL)                    /*!< FOEN142 (Bit 27)                                      */
#define GPIO_PINCFG142_FOEN142_Msk        (0x8000000UL)             /*!< FOEN142 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG142_FIEN142_Pos        (26UL)                    /*!< FIEN142 (Bit 26)                                      */
#define GPIO_PINCFG142_FIEN142_Msk        (0x4000000UL)             /*!< FIEN142 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG142_NCEPOL142_Pos      (22UL)                    /*!< NCEPOL142 (Bit 22)                                    */
#define GPIO_PINCFG142_NCEPOL142_Msk      (0x400000UL)              /*!< NCEPOL142 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG142_NCESRC142_Pos      (16UL)                    /*!< NCESRC142 (Bit 16)                                    */
#define GPIO_PINCFG142_NCESRC142_Msk      (0x3f0000UL)              /*!< NCESRC142 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG142_PULLCFG142_Pos     (13UL)                    /*!< PULLCFG142 (Bit 13)                                   */
#define GPIO_PINCFG142_PULLCFG142_Msk     (0xe000UL)                /*!< PULLCFG142 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG142_SR142_Pos          (12UL)                    /*!< SR142 (Bit 12)                                        */
#define GPIO_PINCFG142_SR142_Msk          (0x1000UL)                /*!< SR142 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG142_DS142_Pos          (10UL)                    /*!< DS142 (Bit 10)                                        */
#define GPIO_PINCFG142_DS142_Msk          (0xc00UL)                 /*!< DS142 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG142_OUTCFG142_Pos      (8UL)                     /*!< OUTCFG142 (Bit 8)                                     */
#define GPIO_PINCFG142_OUTCFG142_Msk      (0x300UL)                 /*!< OUTCFG142 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG142_IRPTEN142_Pos      (6UL)                     /*!< IRPTEN142 (Bit 6)                                     */
#define GPIO_PINCFG142_IRPTEN142_Msk      (0xc0UL)                  /*!< IRPTEN142 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG142_RDZERO142_Pos      (5UL)                     /*!< RDZERO142 (Bit 5)                                     */
#define GPIO_PINCFG142_RDZERO142_Msk      (0x20UL)                  /*!< RDZERO142 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG142_INPEN142_Pos       (4UL)                     /*!< INPEN142 (Bit 4)                                      */
#define GPIO_PINCFG142_INPEN142_Msk       (0x10UL)                  /*!< INPEN142 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG142_FNCSEL142_Pos      (0UL)                     /*!< FNCSEL142 (Bit 0)                                     */
#define GPIO_PINCFG142_FNCSEL142_Msk      (0xfUL)                   /*!< FNCSEL142 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG143  ======================================================= */
#define GPIO_PINCFG143_FOEN143_Pos        (27UL)                    /*!< FOEN143 (Bit 27)                                      */
#define GPIO_PINCFG143_FOEN143_Msk        (0x8000000UL)             /*!< FOEN143 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG143_FIEN143_Pos        (26UL)                    /*!< FIEN143 (Bit 26)                                      */
#define GPIO_PINCFG143_FIEN143_Msk        (0x4000000UL)             /*!< FIEN143 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG143_NCEPOL143_Pos      (22UL)                    /*!< NCEPOL143 (Bit 22)                                    */
#define GPIO_PINCFG143_NCEPOL143_Msk      (0x400000UL)              /*!< NCEPOL143 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG143_NCESRC143_Pos      (16UL)                    /*!< NCESRC143 (Bit 16)                                    */
#define GPIO_PINCFG143_NCESRC143_Msk      (0x3f0000UL)              /*!< NCESRC143 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG143_PULLCFG143_Pos     (13UL)                    /*!< PULLCFG143 (Bit 13)                                   */
#define GPIO_PINCFG143_PULLCFG143_Msk     (0xe000UL)                /*!< PULLCFG143 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG143_SR143_Pos          (12UL)                    /*!< SR143 (Bit 12)                                        */
#define GPIO_PINCFG143_SR143_Msk          (0x1000UL)                /*!< SR143 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG143_DS143_Pos          (10UL)                    /*!< DS143 (Bit 10)                                        */
#define GPIO_PINCFG143_DS143_Msk          (0xc00UL)                 /*!< DS143 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG143_OUTCFG143_Pos      (8UL)                     /*!< OUTCFG143 (Bit 8)                                     */
#define GPIO_PINCFG143_OUTCFG143_Msk      (0x300UL)                 /*!< OUTCFG143 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG143_IRPTEN143_Pos      (6UL)                     /*!< IRPTEN143 (Bit 6)                                     */
#define GPIO_PINCFG143_IRPTEN143_Msk      (0xc0UL)                  /*!< IRPTEN143 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG143_RDZERO143_Pos      (5UL)                     /*!< RDZERO143 (Bit 5)                                     */
#define GPIO_PINCFG143_RDZERO143_Msk      (0x20UL)                  /*!< RDZERO143 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG143_INPEN143_Pos       (4UL)                     /*!< INPEN143 (Bit 4)                                      */
#define GPIO_PINCFG143_INPEN143_Msk       (0x10UL)                  /*!< INPEN143 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG143_FNCSEL143_Pos      (0UL)                     /*!< FNCSEL143 (Bit 0)                                     */
#define GPIO_PINCFG143_FNCSEL143_Msk      (0xfUL)                   /*!< FNCSEL143 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG144  ======================================================= */
#define GPIO_PINCFG144_FOEN144_Pos        (27UL)                    /*!< FOEN144 (Bit 27)                                      */
#define GPIO_PINCFG144_FOEN144_Msk        (0x8000000UL)             /*!< FOEN144 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG144_FIEN144_Pos        (26UL)                    /*!< FIEN144 (Bit 26)                                      */
#define GPIO_PINCFG144_FIEN144_Msk        (0x4000000UL)             /*!< FIEN144 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG144_NCEPOL144_Pos      (22UL)                    /*!< NCEPOL144 (Bit 22)                                    */
#define GPIO_PINCFG144_NCEPOL144_Msk      (0x400000UL)              /*!< NCEPOL144 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG144_NCESRC144_Pos      (16UL)                    /*!< NCESRC144 (Bit 16)                                    */
#define GPIO_PINCFG144_NCESRC144_Msk      (0x3f0000UL)              /*!< NCESRC144 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG144_PULLCFG144_Pos     (13UL)                    /*!< PULLCFG144 (Bit 13)                                   */
#define GPIO_PINCFG144_PULLCFG144_Msk     (0xe000UL)                /*!< PULLCFG144 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG144_SR144_Pos          (12UL)                    /*!< SR144 (Bit 12)                                        */
#define GPIO_PINCFG144_SR144_Msk          (0x1000UL)                /*!< SR144 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG144_DS144_Pos          (10UL)                    /*!< DS144 (Bit 10)                                        */
#define GPIO_PINCFG144_DS144_Msk          (0xc00UL)                 /*!< DS144 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG144_OUTCFG144_Pos      (8UL)                     /*!< OUTCFG144 (Bit 8)                                     */
#define GPIO_PINCFG144_OUTCFG144_Msk      (0x300UL)                 /*!< OUTCFG144 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG144_IRPTEN144_Pos      (6UL)                     /*!< IRPTEN144 (Bit 6)                                     */
#define GPIO_PINCFG144_IRPTEN144_Msk      (0xc0UL)                  /*!< IRPTEN144 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG144_RDZERO144_Pos      (5UL)                     /*!< RDZERO144 (Bit 5)                                     */
#define GPIO_PINCFG144_RDZERO144_Msk      (0x20UL)                  /*!< RDZERO144 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG144_INPEN144_Pos       (4UL)                     /*!< INPEN144 (Bit 4)                                      */
#define GPIO_PINCFG144_INPEN144_Msk       (0x10UL)                  /*!< INPEN144 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG144_FNCSEL144_Pos      (0UL)                     /*!< FNCSEL144 (Bit 0)                                     */
#define GPIO_PINCFG144_FNCSEL144_Msk      (0xfUL)                   /*!< FNCSEL144 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG145  ======================================================= */
#define GPIO_PINCFG145_FOEN145_Pos        (27UL)                    /*!< FOEN145 (Bit 27)                                      */
#define GPIO_PINCFG145_FOEN145_Msk        (0x8000000UL)             /*!< FOEN145 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG145_FIEN145_Pos        (26UL)                    /*!< FIEN145 (Bit 26)                                      */
#define GPIO_PINCFG145_FIEN145_Msk        (0x4000000UL)             /*!< FIEN145 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG145_NCEPOL145_Pos      (22UL)                    /*!< NCEPOL145 (Bit 22)                                    */
#define GPIO_PINCFG145_NCEPOL145_Msk      (0x400000UL)              /*!< NCEPOL145 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG145_NCESRC145_Pos      (16UL)                    /*!< NCESRC145 (Bit 16)                                    */
#define GPIO_PINCFG145_NCESRC145_Msk      (0x3f0000UL)              /*!< NCESRC145 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG145_PULLCFG145_Pos     (13UL)                    /*!< PULLCFG145 (Bit 13)                                   */
#define GPIO_PINCFG145_PULLCFG145_Msk     (0xe000UL)                /*!< PULLCFG145 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG145_SR145_Pos          (12UL)                    /*!< SR145 (Bit 12)                                        */
#define GPIO_PINCFG145_SR145_Msk          (0x1000UL)                /*!< SR145 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG145_DS145_Pos          (10UL)                    /*!< DS145 (Bit 10)                                        */
#define GPIO_PINCFG145_DS145_Msk          (0xc00UL)                 /*!< DS145 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG145_OUTCFG145_Pos      (8UL)                     /*!< OUTCFG145 (Bit 8)                                     */
#define GPIO_PINCFG145_OUTCFG145_Msk      (0x300UL)                 /*!< OUTCFG145 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG145_IRPTEN145_Pos      (6UL)                     /*!< IRPTEN145 (Bit 6)                                     */
#define GPIO_PINCFG145_IRPTEN145_Msk      (0xc0UL)                  /*!< IRPTEN145 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG145_RDZERO145_Pos      (5UL)                     /*!< RDZERO145 (Bit 5)                                     */
#define GPIO_PINCFG145_RDZERO145_Msk      (0x20UL)                  /*!< RDZERO145 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG145_INPEN145_Pos       (4UL)                     /*!< INPEN145 (Bit 4)                                      */
#define GPIO_PINCFG145_INPEN145_Msk       (0x10UL)                  /*!< INPEN145 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG145_FNCSEL145_Pos      (0UL)                     /*!< FNCSEL145 (Bit 0)                                     */
#define GPIO_PINCFG145_FNCSEL145_Msk      (0xfUL)                   /*!< FNCSEL145 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG146  ======================================================= */
#define GPIO_PINCFG146_FOEN146_Pos        (27UL)                    /*!< FOEN146 (Bit 27)                                      */
#define GPIO_PINCFG146_FOEN146_Msk        (0x8000000UL)             /*!< FOEN146 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG146_FIEN146_Pos        (26UL)                    /*!< FIEN146 (Bit 26)                                      */
#define GPIO_PINCFG146_FIEN146_Msk        (0x4000000UL)             /*!< FIEN146 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG146_NCEPOL146_Pos      (22UL)                    /*!< NCEPOL146 (Bit 22)                                    */
#define GPIO_PINCFG146_NCEPOL146_Msk      (0x400000UL)              /*!< NCEPOL146 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG146_NCESRC146_Pos      (16UL)                    /*!< NCESRC146 (Bit 16)                                    */
#define GPIO_PINCFG146_NCESRC146_Msk      (0x3f0000UL)              /*!< NCESRC146 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG146_PULLCFG146_Pos     (13UL)                    /*!< PULLCFG146 (Bit 13)                                   */
#define GPIO_PINCFG146_PULLCFG146_Msk     (0xe000UL)                /*!< PULLCFG146 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG146_SR146_Pos          (12UL)                    /*!< SR146 (Bit 12)                                        */
#define GPIO_PINCFG146_SR146_Msk          (0x1000UL)                /*!< SR146 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG146_DS146_Pos          (10UL)                    /*!< DS146 (Bit 10)                                        */
#define GPIO_PINCFG146_DS146_Msk          (0xc00UL)                 /*!< DS146 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG146_OUTCFG146_Pos      (8UL)                     /*!< OUTCFG146 (Bit 8)                                     */
#define GPIO_PINCFG146_OUTCFG146_Msk      (0x300UL)                 /*!< OUTCFG146 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG146_IRPTEN146_Pos      (6UL)                     /*!< IRPTEN146 (Bit 6)                                     */
#define GPIO_PINCFG146_IRPTEN146_Msk      (0xc0UL)                  /*!< IRPTEN146 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG146_RDZERO146_Pos      (5UL)                     /*!< RDZERO146 (Bit 5)                                     */
#define GPIO_PINCFG146_RDZERO146_Msk      (0x20UL)                  /*!< RDZERO146 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG146_INPEN146_Pos       (4UL)                     /*!< INPEN146 (Bit 4)                                      */
#define GPIO_PINCFG146_INPEN146_Msk       (0x10UL)                  /*!< INPEN146 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG146_FNCSEL146_Pos      (0UL)                     /*!< FNCSEL146 (Bit 0)                                     */
#define GPIO_PINCFG146_FNCSEL146_Msk      (0xfUL)                   /*!< FNCSEL146 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG147  ======================================================= */
#define GPIO_PINCFG147_FOEN147_Pos        (27UL)                    /*!< FOEN147 (Bit 27)                                      */
#define GPIO_PINCFG147_FOEN147_Msk        (0x8000000UL)             /*!< FOEN147 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG147_FIEN147_Pos        (26UL)                    /*!< FIEN147 (Bit 26)                                      */
#define GPIO_PINCFG147_FIEN147_Msk        (0x4000000UL)             /*!< FIEN147 (Bitfield-Mask: 0x01)                         */
