zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG147_NCEPOL147_Pos      (22UL)                    /*!< NCEPOL147 (Bit 22)                                    */
#define GPIO_PINCFG147_NCEPOL147_Msk      (0x400000UL)              /*!< NCEPOL147 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG147_NCESRC147_Pos      (16UL)                    /*!< NCESRC147 (Bit 16)                                    */
#define GPIO_PINCFG147_NCESRC147_Msk      (0x3f0000UL)              /*!< NCESRC147 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG147_PULLCFG147_Pos     (13UL)                    /*!< PULLCFG147 (Bit 13)                                   */
#define GPIO_PINCFG147_PULLCFG147_Msk     (0xe000UL)                /*!< PULLCFG147 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG147_SR147_Pos          (12UL)                    /*!< SR147 (Bit 12)                                        */
#define GPIO_PINCFG147_SR147_Msk          (0x1000UL)                /*!< SR147 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG147_DS147_Pos          (10UL)                    /*!< DS147 (Bit 10)                                        */
#define GPIO_PINCFG147_DS147_Msk          (0xc00UL)                 /*!< DS147 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG147_OUTCFG147_Pos      (8UL)                     /*!< OUTCFG147 (Bit 8)                                     */
#define GPIO_PINCFG147_OUTCFG147_Msk      (0x300UL)                 /*!< OUTCFG147 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG147_IRPTEN147_Pos      (6UL)                     /*!< IRPTEN147 (Bit 6)                                     */
#define GPIO_PINCFG147_IRPTEN147_Msk      (0xc0UL)                  /*!< IRPTEN147 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG147_RDZERO147_Pos      (5UL)                     /*!< RDZERO147 (Bit 5)                                     */
#define GPIO_PINCFG147_RDZERO147_Msk      (0x20UL)                  /*!< RDZERO147 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG147_INPEN147_Pos       (4UL)                     /*!< INPEN147 (Bit 4)                                      */
#define GPIO_PINCFG147_INPEN147_Msk       (0x10UL)                  /*!< INPEN147 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG147_FNCSEL147_Pos      (0UL)                     /*!< FNCSEL147 (Bit 0)                                     */
#define GPIO_PINCFG147_FNCSEL147_Msk      (0xfUL)                   /*!< FNCSEL147 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG148  ======================================================= */
#define GPIO_PINCFG148_FOEN148_Pos        (27UL)                    /*!< FOEN148 (Bit 27)                                      */
#define GPIO_PINCFG148_FOEN148_Msk        (0x8000000UL)             /*!< FOEN148 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG148_FIEN148_Pos        (26UL)                    /*!< FIEN148 (Bit 26)                                      */
#define GPIO_PINCFG148_FIEN148_Msk        (0x4000000UL)             /*!< FIEN148 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG148_NCEPOL148_Pos      (22UL)                    /*!< NCEPOL148 (Bit 22)                                    */
#define GPIO_PINCFG148_NCEPOL148_Msk      (0x400000UL)              /*!< NCEPOL148 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG148_NCESRC148_Pos      (16UL)                    /*!< NCESRC148 (Bit 16)                                    */
#define GPIO_PINCFG148_NCESRC148_Msk      (0x3f0000UL)              /*!< NCESRC148 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG148_PULLCFG148_Pos     (13UL)                    /*!< PULLCFG148 (Bit 13)                                   */
#define GPIO_PINCFG148_PULLCFG148_Msk     (0xe000UL)                /*!< PULLCFG148 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG148_SR148_Pos          (12UL)                    /*!< SR148 (Bit 12)                                        */
#define GPIO_PINCFG148_SR148_Msk          (0x1000UL)                /*!< SR148 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG148_DS148_Pos          (10UL)                    /*!< DS148 (Bit 10)                                        */
#define GPIO_PINCFG148_DS148_Msk          (0xc00UL)                 /*!< DS148 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG148_OUTCFG148_Pos      (8UL)                     /*!< OUTCFG148 (Bit 8)                                     */
#define GPIO_PINCFG148_OUTCFG148_Msk      (0x300UL)                 /*!< OUTCFG148 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG148_IRPTEN148_Pos      (6UL)                     /*!< IRPTEN148 (Bit 6)                                     */
#define GPIO_PINCFG148_IRPTEN148_Msk      (0xc0UL)                  /*!< IRPTEN148 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG148_RDZERO148_Pos      (5UL)                     /*!< RDZERO148 (Bit 5)                                     */
#define GPIO_PINCFG148_RDZERO148_Msk      (0x20UL)                  /*!< RDZERO148 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG148_INPEN148_Pos       (4UL)                     /*!< INPEN148 (Bit 4)                                      */
#define GPIO_PINCFG148_INPEN148_Msk       (0x10UL)                  /*!< INPEN148 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG148_FNCSEL148_Pos      (0UL)                     /*!< FNCSEL148 (Bit 0)                                     */
#define GPIO_PINCFG148_FNCSEL148_Msk      (0xfUL)                   /*!< FNCSEL148 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG149  ======================================================= */
#define GPIO_PINCFG149_FOEN149_Pos        (27UL)                    /*!< FOEN149 (Bit 27)                                      */
#define GPIO_PINCFG149_FOEN149_Msk        (0x8000000UL)             /*!< FOEN149 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG149_FIEN149_Pos        (26UL)                    /*!< FIEN149 (Bit 26)                                      */
#define GPIO_PINCFG149_FIEN149_Msk        (0x4000000UL)             /*!< FIEN149 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG149_NCEPOL149_Pos      (22UL)                    /*!< NCEPOL149 (Bit 22)                                    */
#define GPIO_PINCFG149_NCEPOL149_Msk      (0x400000UL)              /*!< NCEPOL149 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG149_NCESRC149_Pos      (16UL)                    /*!< NCESRC149 (Bit 16)                                    */
#define GPIO_PINCFG149_NCESRC149_Msk      (0x3f0000UL)              /*!< NCESRC149 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG149_PULLCFG149_Pos     (13UL)                    /*!< PULLCFG149 (Bit 13)                                   */
#define GPIO_PINCFG149_PULLCFG149_Msk     (0xe000UL)                /*!< PULLCFG149 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG149_SR149_Pos          (12UL)                    /*!< SR149 (Bit 12)                                        */
#define GPIO_PINCFG149_SR149_Msk          (0x1000UL)                /*!< SR149 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG149_DS149_Pos          (10UL)                    /*!< DS149 (Bit 10)                                        */
#define GPIO_PINCFG149_DS149_Msk          (0xc00UL)                 /*!< DS149 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG149_OUTCFG149_Pos      (8UL)                     /*!< OUTCFG149 (Bit 8)                                     */
#define GPIO_PINCFG149_OUTCFG149_Msk      (0x300UL)                 /*!< OUTCFG149 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG149_IRPTEN149_Pos      (6UL)                     /*!< IRPTEN149 (Bit 6)                                     */
#define GPIO_PINCFG149_IRPTEN149_Msk      (0xc0UL)                  /*!< IRPTEN149 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG149_RDZERO149_Pos      (5UL)                     /*!< RDZERO149 (Bit 5)                                     */
#define GPIO_PINCFG149_RDZERO149_Msk      (0x20UL)                  /*!< RDZERO149 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG149_INPEN149_Pos       (4UL)                     /*!< INPEN149 (Bit 4)                                      */
#define GPIO_PINCFG149_INPEN149_Msk       (0x10UL)                  /*!< INPEN149 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG149_FNCSEL149_Pos      (0UL)                     /*!< FNCSEL149 (Bit 0)                                     */
#define GPIO_PINCFG149_FNCSEL149_Msk      (0xfUL)                   /*!< FNCSEL149 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG150  ======================================================= */
#define GPIO_PINCFG150_FOEN150_Pos        (27UL)                    /*!< FOEN150 (Bit 27)                                      */
#define GPIO_PINCFG150_FOEN150_Msk        (0x8000000UL)             /*!< FOEN150 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG150_FIEN150_Pos        (26UL)                    /*!< FIEN150 (Bit 26)                                      */
#define GPIO_PINCFG150_FIEN150_Msk        (0x4000000UL)             /*!< FIEN150 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG150_NCEPOL150_Pos      (22UL)                    /*!< NCEPOL150 (Bit 22)                                    */
#define GPIO_PINCFG150_NCEPOL150_Msk      (0x400000UL)              /*!< NCEPOL150 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG150_NCESRC150_Pos      (16UL)                    /*!< NCESRC150 (Bit 16)                                    */
#define GPIO_PINCFG150_NCESRC150_Msk      (0x3f0000UL)              /*!< NCESRC150 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG150_PULLCFG150_Pos     (13UL)                    /*!< PULLCFG150 (Bit 13)                                   */
#define GPIO_PINCFG150_PULLCFG150_Msk     (0xe000UL)                /*!< PULLCFG150 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG150_SR150_Pos          (12UL)                    /*!< SR150 (Bit 12)                                        */
#define GPIO_PINCFG150_SR150_Msk          (0x1000UL)                /*!< SR150 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG150_DS150_Pos          (10UL)                    /*!< DS150 (Bit 10)                                        */
#define GPIO_PINCFG150_DS150_Msk          (0xc00UL)                 /*!< DS150 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG150_OUTCFG150_Pos      (8UL)                     /*!< OUTCFG150 (Bit 8)                                     */
#define GPIO_PINCFG150_OUTCFG150_Msk      (0x300UL)                 /*!< OUTCFG150 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG150_IRPTEN150_Pos      (6UL)                     /*!< IRPTEN150 (Bit 6)                                     */
#define GPIO_PINCFG150_IRPTEN150_Msk      (0xc0UL)                  /*!< IRPTEN150 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG150_RDZERO150_Pos      (5UL)                     /*!< RDZERO150 (Bit 5)                                     */
#define GPIO_PINCFG150_RDZERO150_Msk      (0x20UL)                  /*!< RDZERO150 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG150_INPEN150_Pos       (4UL)                     /*!< INPEN150 (Bit 4)                                      */
#define GPIO_PINCFG150_INPEN150_Msk       (0x10UL)                  /*!< INPEN150 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG150_FNCSEL150_Pos      (0UL)                     /*!< FNCSEL150 (Bit 0)                                     */
#define GPIO_PINCFG150_FNCSEL150_Msk      (0xfUL)                   /*!< FNCSEL150 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG151  ======================================================= */
#define GPIO_PINCFG151_FOEN151_Pos        (27UL)                    /*!< FOEN151 (Bit 27)                                      */
#define GPIO_PINCFG151_FOEN151_Msk        (0x8000000UL)             /*!< FOEN151 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG151_FIEN151_Pos        (26UL)                    /*!< FIEN151 (Bit 26)                                      */
#define GPIO_PINCFG151_FIEN151_Msk        (0x4000000UL)             /*!< FIEN151 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG151_NCEPOL151_Pos      (22UL)                    /*!< NCEPOL151 (Bit 22)                                    */
#define GPIO_PINCFG151_NCEPOL151_Msk      (0x400000UL)              /*!< NCEPOL151 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG151_NCESRC151_Pos      (16UL)                    /*!< NCESRC151 (Bit 16)                                    */
#define GPIO_PINCFG151_NCESRC151_Msk      (0x3f0000UL)              /*!< NCESRC151 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG151_PULLCFG151_Pos     (13UL)                    /*!< PULLCFG151 (Bit 13)                                   */
#define GPIO_PINCFG151_PULLCFG151_Msk     (0xe000UL)                /*!< PULLCFG151 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG151_SR151_Pos          (12UL)                    /*!< SR151 (Bit 12)                                        */
#define GPIO_PINCFG151_SR151_Msk          (0x1000UL)                /*!< SR151 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG151_DS151_Pos          (10UL)                    /*!< DS151 (Bit 10)                                        */
#define GPIO_PINCFG151_DS151_Msk          (0xc00UL)                 /*!< DS151 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG151_OUTCFG151_Pos      (8UL)                     /*!< OUTCFG151 (Bit 8)                                     */
#define GPIO_PINCFG151_OUTCFG151_Msk      (0x300UL)                 /*!< OUTCFG151 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG151_IRPTEN151_Pos      (6UL)                     /*!< IRPTEN151 (Bit 6)                                     */
#define GPIO_PINCFG151_IRPTEN151_Msk      (0xc0UL)                  /*!< IRPTEN151 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG151_RDZERO151_Pos      (5UL)                     /*!< RDZERO151 (Bit 5)                                     */
#define GPIO_PINCFG151_RDZERO151_Msk      (0x20UL)                  /*!< RDZERO151 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG151_INPEN151_Pos       (4UL)                     /*!< INPEN151 (Bit 4)                                      */
#define GPIO_PINCFG151_INPEN151_Msk       (0x10UL)                  /*!< INPEN151 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG151_FNCSEL151_Pos      (0UL)                     /*!< FNCSEL151 (Bit 0)                                     */
#define GPIO_PINCFG151_FNCSEL151_Msk      (0xfUL)                   /*!< FNCSEL151 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG152  ======================================================= */
#define GPIO_PINCFG152_FOEN152_Pos        (27UL)                    /*!< FOEN152 (Bit 27)                                      */
#define GPIO_PINCFG152_FOEN152_Msk        (0x8000000UL)             /*!< FOEN152 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG152_FIEN152_Pos        (26UL)                    /*!< FIEN152 (Bit 26)                                      */
#define GPIO_PINCFG152_FIEN152_Msk        (0x4000000UL)             /*!< FIEN152 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG152_NCEPOL152_Pos      (22UL)                    /*!< NCEPOL152 (Bit 22)                                    */
#define GPIO_PINCFG152_NCEPOL152_Msk      (0x400000UL)              /*!< NCEPOL152 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG152_NCESRC152_Pos      (16UL)                    /*!< NCESRC152 (Bit 16)                                    */
#define GPIO_PINCFG152_NCESRC152_Msk      (0x3f0000UL)              /*!< NCESRC152 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG152_PULLCFG152_Pos     (13UL)                    /*!< PULLCFG152 (Bit 13)                                   */
#define GPIO_PINCFG152_PULLCFG152_Msk     (0xe000UL)                /*!< PULLCFG152 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG152_SR152_Pos          (12UL)                    /*!< SR152 (Bit 12)                                        */
#define GPIO_PINCFG152_SR152_Msk          (0x1000UL)                /*!< SR152 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG152_DS152_Pos          (10UL)                    /*!< DS152 (Bit 10)                                        */
#define GPIO_PINCFG152_DS152_Msk          (0xc00UL)                 /*!< DS152 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG152_OUTCFG152_Pos      (8UL)                     /*!< OUTCFG152 (Bit 8)                                     */
#define GPIO_PINCFG152_OUTCFG152_Msk      (0x300UL)                 /*!< OUTCFG152 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG152_IRPTEN152_Pos      (6UL)                     /*!< IRPTEN152 (Bit 6)                                     */
#define GPIO_PINCFG152_IRPTEN152_Msk      (0xc0UL)                  /*!< IRPTEN152 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG152_RDZERO152_Pos      (5UL)                     /*!< RDZERO152 (Bit 5)                                     */
#define GPIO_PINCFG152_RDZERO152_Msk      (0x20UL)                  /*!< RDZERO152 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG152_INPEN152_Pos       (4UL)                     /*!< INPEN152 (Bit 4)                                      */
#define GPIO_PINCFG152_INPEN152_Msk       (0x10UL)                  /*!< INPEN152 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG152_FNCSEL152_Pos      (0UL)                     /*!< FNCSEL152 (Bit 0)                                     */
#define GPIO_PINCFG152_FNCSEL152_Msk      (0xfUL)                   /*!< FNCSEL152 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG153  ======================================================= */
#define GPIO_PINCFG153_FOEN153_Pos        (27UL)                    /*!< FOEN153 (Bit 27)                                      */
#define GPIO_PINCFG153_FOEN153_Msk        (0x8000000UL)             /*!< FOEN153 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG153_FIEN153_Pos        (26UL)                    /*!< FIEN153 (Bit 26)                                      */
#define GPIO_PINCFG153_FIEN153_Msk        (0x4000000UL)             /*!< FIEN153 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG153_NCEPOL153_Pos      (22UL)                    /*!< NCEPOL153 (Bit 22)                                    */
#define GPIO_PINCFG153_NCEPOL153_Msk      (0x400000UL)              /*!< NCEPOL153 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG153_NCESRC153_Pos      (16UL)                    /*!< NCESRC153 (Bit 16)                                    */
#define GPIO_PINCFG153_NCESRC153_Msk      (0x3f0000UL)              /*!< NCESRC153 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG153_PULLCFG153_Pos     (13UL)                    /*!< PULLCFG153 (Bit 13)                                   */
#define GPIO_PINCFG153_PULLCFG153_Msk     (0xe000UL)                /*!< PULLCFG153 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG153_SR153_Pos          (12UL)                    /*!< SR153 (Bit 12)                                        */
#define GPIO_PINCFG153_SR153_Msk          (0x1000UL)                /*!< SR153 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG153_DS153_Pos          (10UL)                    /*!< DS153 (Bit 10)                                        */
#define GPIO_PINCFG153_DS153_Msk          (0xc00UL)                 /*!< DS153 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG153_OUTCFG153_Pos      (8UL)                     /*!< OUTCFG153 (Bit 8)                                     */
#define GPIO_PINCFG153_OUTCFG153_Msk      (0x300UL)                 /*!< OUTCFG153 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG153_IRPTEN153_Pos      (6UL)                     /*!< IRPTEN153 (Bit 6)                                     */
#define GPIO_PINCFG153_IRPTEN153_Msk      (0xc0UL)                  /*!< IRPTEN153 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG153_RDZERO153_Pos      (5UL)                     /*!< RDZERO153 (Bit 5)                                     */
#define GPIO_PINCFG153_RDZERO153_Msk      (0x20UL)                  /*!< RDZERO153 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG153_INPEN153_Pos       (4UL)                     /*!< INPEN153 (Bit 4)                                      */
#define GPIO_PINCFG153_INPEN153_Msk       (0x10UL)                  /*!< INPEN153 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG153_FNCSEL153_Pos      (0UL)                     /*!< FNCSEL153 (Bit 0)                                     */
#define GPIO_PINCFG153_FNCSEL153_Msk      (0xfUL)                   /*!< FNCSEL153 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG154  ======================================================= */
#define GPIO_PINCFG154_FOEN154_Pos        (27UL)                    /*!< FOEN154 (Bit 27)                                      */
#define GPIO_PINCFG154_FOEN154_Msk        (0x8000000UL)             /*!< FOEN154 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG154_FIEN154_Pos        (26UL)                    /*!< FIEN154 (Bit 26)                                      */
#define GPIO_PINCFG154_FIEN154_Msk        (0x4000000UL)             /*!< FIEN154 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG154_NCEPOL154_Pos      (22UL)                    /*!< NCEPOL154 (Bit 22)                                    */
#define GPIO_PINCFG154_NCEPOL154_Msk      (0x400000UL)              /*!< NCEPOL154 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG154_NCESRC154_Pos      (16UL)                    /*!< NCESRC154 (Bit 16)                                    */
#define GPIO_PINCFG154_NCESRC154_Msk      (0x3f0000UL)              /*!< NCESRC154 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG154_PULLCFG154_Pos     (13UL)                    /*!< PULLCFG154 (Bit 13)                                   */
#define GPIO_PINCFG154_PULLCFG154_Msk     (0xe000UL)                /*!< PULLCFG154 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG154_SR154_Pos          (12UL)                    /*!< SR154 (Bit 12)                                        */
#define GPIO_PINCFG154_SR154_Msk          (0x1000UL)                /*!< SR154 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG154_DS154_Pos          (10UL)                    /*!< DS154 (Bit 10)                                        */
