zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG169_NCESRC169_Pos      (16UL)                    /*!< NCESRC169 (Bit 16)                                    */
#define GPIO_PINCFG169_NCESRC169_Msk      (0x3f0000UL)              /*!< NCESRC169 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG169_PULLCFG169_Pos     (13UL)                    /*!< PULLCFG169 (Bit 13)                                   */
#define GPIO_PINCFG169_PULLCFG169_Msk     (0xe000UL)                /*!< PULLCFG169 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG169_SR169_Pos          (12UL)                    /*!< SR169 (Bit 12)                                        */
#define GPIO_PINCFG169_SR169_Msk          (0x1000UL)                /*!< SR169 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG169_DS169_Pos          (10UL)                    /*!< DS169 (Bit 10)                                        */
#define GPIO_PINCFG169_DS169_Msk          (0xc00UL)                 /*!< DS169 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG169_OUTCFG169_Pos      (8UL)                     /*!< OUTCFG169 (Bit 8)                                     */
#define GPIO_PINCFG169_OUTCFG169_Msk      (0x300UL)                 /*!< OUTCFG169 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG169_IRPTEN169_Pos      (6UL)                     /*!< IRPTEN169 (Bit 6)                                     */
#define GPIO_PINCFG169_IRPTEN169_Msk      (0xc0UL)                  /*!< IRPTEN169 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG169_RDZERO169_Pos      (5UL)                     /*!< RDZERO169 (Bit 5)                                     */
#define GPIO_PINCFG169_RDZERO169_Msk      (0x20UL)                  /*!< RDZERO169 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG169_INPEN169_Pos       (4UL)                     /*!< INPEN169 (Bit 4)                                      */
#define GPIO_PINCFG169_INPEN169_Msk       (0x10UL)                  /*!< INPEN169 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG169_FNCSEL169_Pos      (0UL)                     /*!< FNCSEL169 (Bit 0)                                     */
#define GPIO_PINCFG169_FNCSEL169_Msk      (0xfUL)                   /*!< FNCSEL169 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG170  ======================================================= */
#define GPIO_PINCFG170_FOEN170_Pos        (27UL)                    /*!< FOEN170 (Bit 27)                                      */
#define GPIO_PINCFG170_FOEN170_Msk        (0x8000000UL)             /*!< FOEN170 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG170_FIEN170_Pos        (26UL)                    /*!< FIEN170 (Bit 26)                                      */
#define GPIO_PINCFG170_FIEN170_Msk        (0x4000000UL)             /*!< FIEN170 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG170_NCEPOL170_Pos      (22UL)                    /*!< NCEPOL170 (Bit 22)                                    */
#define GPIO_PINCFG170_NCEPOL170_Msk      (0x400000UL)              /*!< NCEPOL170 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG170_NCESRC170_Pos      (16UL)                    /*!< NCESRC170 (Bit 16)                                    */
#define GPIO_PINCFG170_NCESRC170_Msk      (0x3f0000UL)              /*!< NCESRC170 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG170_PULLCFG170_Pos     (13UL)                    /*!< PULLCFG170 (Bit 13)                                   */
#define GPIO_PINCFG170_PULLCFG170_Msk     (0xe000UL)                /*!< PULLCFG170 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG170_SR170_Pos          (12UL)                    /*!< SR170 (Bit 12)                                        */
#define GPIO_PINCFG170_SR170_Msk          (0x1000UL)                /*!< SR170 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG170_DS170_Pos          (10UL)                    /*!< DS170 (Bit 10)                                        */
#define GPIO_PINCFG170_DS170_Msk          (0xc00UL)                 /*!< DS170 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG170_OUTCFG170_Pos      (8UL)                     /*!< OUTCFG170 (Bit 8)                                     */
#define GPIO_PINCFG170_OUTCFG170_Msk      (0x300UL)                 /*!< OUTCFG170 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG170_IRPTEN170_Pos      (6UL)                     /*!< IRPTEN170 (Bit 6)                                     */
#define GPIO_PINCFG170_IRPTEN170_Msk      (0xc0UL)                  /*!< IRPTEN170 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG170_RDZERO170_Pos      (5UL)                     /*!< RDZERO170 (Bit 5)                                     */
#define GPIO_PINCFG170_RDZERO170_Msk      (0x20UL)                  /*!< RDZERO170 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG170_INPEN170_Pos       (4UL)                     /*!< INPEN170 (Bit 4)                                      */
#define GPIO_PINCFG170_INPEN170_Msk       (0x10UL)                  /*!< INPEN170 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG170_FNCSEL170_Pos      (0UL)                     /*!< FNCSEL170 (Bit 0)                                     */
#define GPIO_PINCFG170_FNCSEL170_Msk      (0xfUL)                   /*!< FNCSEL170 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG171  ======================================================= */
#define GPIO_PINCFG171_FOEN171_Pos        (27UL)                    /*!< FOEN171 (Bit 27)                                      */
#define GPIO_PINCFG171_FOEN171_Msk        (0x8000000UL)             /*!< FOEN171 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG171_FIEN171_Pos        (26UL)                    /*!< FIEN171 (Bit 26)                                      */
#define GPIO_PINCFG171_FIEN171_Msk        (0x4000000UL)             /*!< FIEN171 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG171_NCEPOL171_Pos      (22UL)                    /*!< NCEPOL171 (Bit 22)                                    */
#define GPIO_PINCFG171_NCEPOL171_Msk      (0x400000UL)              /*!< NCEPOL171 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG171_NCESRC171_Pos      (16UL)                    /*!< NCESRC171 (Bit 16)                                    */
#define GPIO_PINCFG171_NCESRC171_Msk      (0x3f0000UL)              /*!< NCESRC171 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG171_PULLCFG171_Pos     (13UL)                    /*!< PULLCFG171 (Bit 13)                                   */
#define GPIO_PINCFG171_PULLCFG171_Msk     (0xe000UL)                /*!< PULLCFG171 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG171_SR171_Pos          (12UL)                    /*!< SR171 (Bit 12)                                        */
#define GPIO_PINCFG171_SR171_Msk          (0x1000UL)                /*!< SR171 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG171_DS171_Pos          (10UL)                    /*!< DS171 (Bit 10)                                        */
#define GPIO_PINCFG171_DS171_Msk          (0xc00UL)                 /*!< DS171 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG171_OUTCFG171_Pos      (8UL)                     /*!< OUTCFG171 (Bit 8)                                     */
#define GPIO_PINCFG171_OUTCFG171_Msk      (0x300UL)                 /*!< OUTCFG171 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG171_IRPTEN171_Pos      (6UL)                     /*!< IRPTEN171 (Bit 6)                                     */
#define GPIO_PINCFG171_IRPTEN171_Msk      (0xc0UL)                  /*!< IRPTEN171 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG171_RDZERO171_Pos      (5UL)                     /*!< RDZERO171 (Bit 5)                                     */
#define GPIO_PINCFG171_RDZERO171_Msk      (0x20UL)                  /*!< RDZERO171 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG171_INPEN171_Pos       (4UL)                     /*!< INPEN171 (Bit 4)                                      */
#define GPIO_PINCFG171_INPEN171_Msk       (0x10UL)                  /*!< INPEN171 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG171_FNCSEL171_Pos      (0UL)                     /*!< FNCSEL171 (Bit 0)                                     */
#define GPIO_PINCFG171_FNCSEL171_Msk      (0xfUL)                   /*!< FNCSEL171 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG172  ======================================================= */
#define GPIO_PINCFG172_FOEN172_Pos        (27UL)                    /*!< FOEN172 (Bit 27)                                      */
#define GPIO_PINCFG172_FOEN172_Msk        (0x8000000UL)             /*!< FOEN172 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG172_FIEN172_Pos        (26UL)                    /*!< FIEN172 (Bit 26)                                      */
#define GPIO_PINCFG172_FIEN172_Msk        (0x4000000UL)             /*!< FIEN172 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG172_NCEPOL172_Pos      (22UL)                    /*!< NCEPOL172 (Bit 22)                                    */
#define GPIO_PINCFG172_NCEPOL172_Msk      (0x400000UL)              /*!< NCEPOL172 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG172_NCESRC172_Pos      (16UL)                    /*!< NCESRC172 (Bit 16)                                    */
#define GPIO_PINCFG172_NCESRC172_Msk      (0x3f0000UL)              /*!< NCESRC172 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG172_PULLCFG172_Pos     (13UL)                    /*!< PULLCFG172 (Bit 13)                                   */
#define GPIO_PINCFG172_PULLCFG172_Msk     (0xe000UL)                /*!< PULLCFG172 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG172_SR172_Pos          (12UL)                    /*!< SR172 (Bit 12)                                        */
#define GPIO_PINCFG172_SR172_Msk          (0x1000UL)                /*!< SR172 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG172_DS172_Pos          (10UL)                    /*!< DS172 (Bit 10)                                        */
#define GPIO_PINCFG172_DS172_Msk          (0xc00UL)                 /*!< DS172 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG172_OUTCFG172_Pos      (8UL)                     /*!< OUTCFG172 (Bit 8)                                     */
#define GPIO_PINCFG172_OUTCFG172_Msk      (0x300UL)                 /*!< OUTCFG172 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG172_IRPTEN172_Pos      (6UL)                     /*!< IRPTEN172 (Bit 6)                                     */
#define GPIO_PINCFG172_IRPTEN172_Msk      (0xc0UL)                  /*!< IRPTEN172 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG172_RDZERO172_Pos      (5UL)                     /*!< RDZERO172 (Bit 5)                                     */
#define GPIO_PINCFG172_RDZERO172_Msk      (0x20UL)                  /*!< RDZERO172 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG172_INPEN172_Pos       (4UL)                     /*!< INPEN172 (Bit 4)                                      */
#define GPIO_PINCFG172_INPEN172_Msk       (0x10UL)                  /*!< INPEN172 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG172_FNCSEL172_Pos      (0UL)                     /*!< FNCSEL172 (Bit 0)                                     */
#define GPIO_PINCFG172_FNCSEL172_Msk      (0xfUL)                   /*!< FNCSEL172 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG173  ======================================================= */
#define GPIO_PINCFG173_FOEN173_Pos        (27UL)                    /*!< FOEN173 (Bit 27)                                      */
#define GPIO_PINCFG173_FOEN173_Msk        (0x8000000UL)             /*!< FOEN173 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG173_FIEN173_Pos        (26UL)                    /*!< FIEN173 (Bit 26)                                      */
#define GPIO_PINCFG173_FIEN173_Msk        (0x4000000UL)             /*!< FIEN173 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG173_NCEPOL173_Pos      (22UL)                    /*!< NCEPOL173 (Bit 22)                                    */
#define GPIO_PINCFG173_NCEPOL173_Msk      (0x400000UL)              /*!< NCEPOL173 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG173_NCESRC173_Pos      (16UL)                    /*!< NCESRC173 (Bit 16)                                    */
#define GPIO_PINCFG173_NCESRC173_Msk      (0x3f0000UL)              /*!< NCESRC173 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG173_PULLCFG173_Pos     (13UL)                    /*!< PULLCFG173 (Bit 13)                                   */
#define GPIO_PINCFG173_PULLCFG173_Msk     (0xe000UL)                /*!< PULLCFG173 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG173_SR173_Pos          (12UL)                    /*!< SR173 (Bit 12)                                        */
#define GPIO_PINCFG173_SR173_Msk          (0x1000UL)                /*!< SR173 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG173_DS173_Pos          (10UL)                    /*!< DS173 (Bit 10)                                        */
#define GPIO_PINCFG173_DS173_Msk          (0xc00UL)                 /*!< DS173 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG173_OUTCFG173_Pos      (8UL)                     /*!< OUTCFG173 (Bit 8)                                     */
#define GPIO_PINCFG173_OUTCFG173_Msk      (0x300UL)                 /*!< OUTCFG173 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG173_IRPTEN173_Pos      (6UL)                     /*!< IRPTEN173 (Bit 6)                                     */
#define GPIO_PINCFG173_IRPTEN173_Msk      (0xc0UL)                  /*!< IRPTEN173 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG173_RDZERO173_Pos      (5UL)                     /*!< RDZERO173 (Bit 5)                                     */
#define GPIO_PINCFG173_RDZERO173_Msk      (0x20UL)                  /*!< RDZERO173 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG173_INPEN173_Pos       (4UL)                     /*!< INPEN173 (Bit 4)                                      */
#define GPIO_PINCFG173_INPEN173_Msk       (0x10UL)                  /*!< INPEN173 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG173_FNCSEL173_Pos      (0UL)                     /*!< FNCSEL173 (Bit 0)                                     */
#define GPIO_PINCFG173_FNCSEL173_Msk      (0xfUL)                   /*!< FNCSEL173 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG174  ======================================================= */
#define GPIO_PINCFG174_FOEN174_Pos        (27UL)                    /*!< FOEN174 (Bit 27)                                      */
#define GPIO_PINCFG174_FOEN174_Msk        (0x8000000UL)             /*!< FOEN174 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG174_FIEN174_Pos        (26UL)                    /*!< FIEN174 (Bit 26)                                      */
#define GPIO_PINCFG174_FIEN174_Msk        (0x4000000UL)             /*!< FIEN174 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG174_NCEPOL174_Pos      (22UL)                    /*!< NCEPOL174 (Bit 22)                                    */
#define GPIO_PINCFG174_NCEPOL174_Msk      (0x400000UL)              /*!< NCEPOL174 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG174_NCESRC174_Pos      (16UL)                    /*!< NCESRC174 (Bit 16)                                    */
#define GPIO_PINCFG174_NCESRC174_Msk      (0x3f0000UL)              /*!< NCESRC174 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG174_PULLCFG174_Pos     (13UL)                    /*!< PULLCFG174 (Bit 13)                                   */
#define GPIO_PINCFG174_PULLCFG174_Msk     (0xe000UL)                /*!< PULLCFG174 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG174_SR174_Pos          (12UL)                    /*!< SR174 (Bit 12)                                        */
#define GPIO_PINCFG174_SR174_Msk          (0x1000UL)                /*!< SR174 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG174_DS174_Pos          (10UL)                    /*!< DS174 (Bit 10)                                        */
#define GPIO_PINCFG174_DS174_Msk          (0xc00UL)                 /*!< DS174 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG174_OUTCFG174_Pos      (8UL)                     /*!< OUTCFG174 (Bit 8)                                     */
#define GPIO_PINCFG174_OUTCFG174_Msk      (0x300UL)                 /*!< OUTCFG174 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG174_IRPTEN174_Pos      (6UL)                     /*!< IRPTEN174 (Bit 6)                                     */
#define GPIO_PINCFG174_IRPTEN174_Msk      (0xc0UL)                  /*!< IRPTEN174 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG174_RDZERO174_Pos      (5UL)                     /*!< RDZERO174 (Bit 5)                                     */
#define GPIO_PINCFG174_RDZERO174_Msk      (0x20UL)                  /*!< RDZERO174 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG174_INPEN174_Pos       (4UL)                     /*!< INPEN174 (Bit 4)                                      */
#define GPIO_PINCFG174_INPEN174_Msk       (0x10UL)                  /*!< INPEN174 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG174_FNCSEL174_Pos      (0UL)                     /*!< FNCSEL174 (Bit 0)                                     */
#define GPIO_PINCFG174_FNCSEL174_Msk      (0xfUL)                   /*!< FNCSEL174 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG175  ======================================================= */
#define GPIO_PINCFG175_FOEN175_Pos        (27UL)                    /*!< FOEN175 (Bit 27)                                      */
#define GPIO_PINCFG175_FOEN175_Msk        (0x8000000UL)             /*!< FOEN175 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG175_FIEN175_Pos        (26UL)                    /*!< FIEN175 (Bit 26)                                      */
#define GPIO_PINCFG175_FIEN175_Msk        (0x4000000UL)             /*!< FIEN175 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG175_NCEPOL175_Pos      (22UL)                    /*!< NCEPOL175 (Bit 22)                                    */
#define GPIO_PINCFG175_NCEPOL175_Msk      (0x400000UL)              /*!< NCEPOL175 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG175_NCESRC175_Pos      (16UL)                    /*!< NCESRC175 (Bit 16)                                    */
#define GPIO_PINCFG175_NCESRC175_Msk      (0x3f0000UL)              /*!< NCESRC175 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG175_PULLCFG175_Pos     (13UL)                    /*!< PULLCFG175 (Bit 13)                                   */
#define GPIO_PINCFG175_PULLCFG175_Msk     (0xe000UL)                /*!< PULLCFG175 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG175_SR175_Pos          (12UL)                    /*!< SR175 (Bit 12)                                        */
#define GPIO_PINCFG175_SR175_Msk          (0x1000UL)                /*!< SR175 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG175_DS175_Pos          (10UL)                    /*!< DS175 (Bit 10)                                        */
#define GPIO_PINCFG175_DS175_Msk          (0xc00UL)                 /*!< DS175 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG175_OUTCFG175_Pos      (8UL)                     /*!< OUTCFG175 (Bit 8)                                     */
#define GPIO_PINCFG175_OUTCFG175_Msk      (0x300UL)                 /*!< OUTCFG175 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG175_IRPTEN175_Pos      (6UL)                     /*!< IRPTEN175 (Bit 6)                                     */
#define GPIO_PINCFG175_IRPTEN175_Msk      (0xc0UL)                  /*!< IRPTEN175 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG175_RDZERO175_Pos      (5UL)                     /*!< RDZERO175 (Bit 5)                                     */
#define GPIO_PINCFG175_RDZERO175_Msk      (0x20UL)                  /*!< RDZERO175 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG175_INPEN175_Pos       (4UL)                     /*!< INPEN175 (Bit 4)                                      */
#define GPIO_PINCFG175_INPEN175_Msk       (0x10UL)                  /*!< INPEN175 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG175_FNCSEL175_Pos      (0UL)                     /*!< FNCSEL175 (Bit 0)                                     */
#define GPIO_PINCFG175_FNCSEL175_Msk      (0xfUL)                   /*!< FNCSEL175 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG176  ======================================================= */
#define GPIO_PINCFG176_FOEN176_Pos        (27UL)                    /*!< FOEN176 (Bit 27)                                      */
#define GPIO_PINCFG176_FOEN176_Msk        (0x8000000UL)             /*!< FOEN176 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG176_FIEN176_Pos        (26UL)                    /*!< FIEN176 (Bit 26)                                      */
#define GPIO_PINCFG176_FIEN176_Msk        (0x4000000UL)             /*!< FIEN176 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG176_NCEPOL176_Pos      (22UL)                    /*!< NCEPOL176 (Bit 22)                                    */
#define GPIO_PINCFG176_NCEPOL176_Msk      (0x400000UL)              /*!< NCEPOL176 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG176_NCESRC176_Pos      (16UL)                    /*!< NCESRC176 (Bit 16)                                    */
#define GPIO_PINCFG176_NCESRC176_Msk      (0x3f0000UL)              /*!< NCESRC176 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG176_PULLCFG176_Pos     (13UL)                    /*!< PULLCFG176 (Bit 13)                                   */
#define GPIO_PINCFG176_PULLCFG176_Msk     (0xe000UL)                /*!< PULLCFG176 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG176_SR176_Pos          (12UL)                    /*!< SR176 (Bit 12)                                        */
#define GPIO_PINCFG176_SR176_Msk          (0x1000UL)                /*!< SR176 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG176_DS176_Pos          (10UL)                    /*!< DS176 (Bit 10)                                        */
#define GPIO_PINCFG176_DS176_Msk          (0xc00UL)                 /*!< DS176 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG176_OUTCFG176_Pos      (8UL)                     /*!< OUTCFG176 (Bit 8)                                     */
