zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =======================================================  PINCFG184  ======================================================= */
#define GPIO_PINCFG184_FOEN184_Pos        (27UL)                    /*!< FOEN184 (Bit 27)                                      */
#define GPIO_PINCFG184_FOEN184_Msk        (0x8000000UL)             /*!< FOEN184 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG184_FIEN184_Pos        (26UL)                    /*!< FIEN184 (Bit 26)                                      */
#define GPIO_PINCFG184_FIEN184_Msk        (0x4000000UL)             /*!< FIEN184 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG184_NCEPOL184_Pos      (22UL)                    /*!< NCEPOL184 (Bit 22)                                    */
#define GPIO_PINCFG184_NCEPOL184_Msk      (0x400000UL)              /*!< NCEPOL184 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG184_NCESRC184_Pos      (16UL)                    /*!< NCESRC184 (Bit 16)                                    */
#define GPIO_PINCFG184_NCESRC184_Msk      (0x3f0000UL)              /*!< NCESRC184 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG184_PULLCFG184_Pos     (13UL)                    /*!< PULLCFG184 (Bit 13)                                   */
#define GPIO_PINCFG184_PULLCFG184_Msk     (0xe000UL)                /*!< PULLCFG184 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG184_SR184_Pos          (12UL)                    /*!< SR184 (Bit 12)                                        */
#define GPIO_PINCFG184_SR184_Msk          (0x1000UL)                /*!< SR184 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG184_DS184_Pos          (10UL)                    /*!< DS184 (Bit 10)                                        */
#define GPIO_PINCFG184_DS184_Msk          (0xc00UL)                 /*!< DS184 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG184_OUTCFG184_Pos      (8UL)                     /*!< OUTCFG184 (Bit 8)                                     */
#define GPIO_PINCFG184_OUTCFG184_Msk      (0x300UL)                 /*!< OUTCFG184 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG184_IRPTEN184_Pos      (6UL)                     /*!< IRPTEN184 (Bit 6)                                     */
#define GPIO_PINCFG184_IRPTEN184_Msk      (0xc0UL)                  /*!< IRPTEN184 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG184_RDZERO184_Pos      (5UL)                     /*!< RDZERO184 (Bit 5)                                     */
#define GPIO_PINCFG184_RDZERO184_Msk      (0x20UL)                  /*!< RDZERO184 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG184_INPEN184_Pos       (4UL)                     /*!< INPEN184 (Bit 4)                                      */
#define GPIO_PINCFG184_INPEN184_Msk       (0x10UL)                  /*!< INPEN184 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG184_FNCSEL184_Pos      (0UL)                     /*!< FNCSEL184 (Bit 0)                                     */
#define GPIO_PINCFG184_FNCSEL184_Msk      (0xfUL)                   /*!< FNCSEL184 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG185  ======================================================= */
#define GPIO_PINCFG185_FOEN185_Pos        (27UL)                    /*!< FOEN185 (Bit 27)                                      */
#define GPIO_PINCFG185_FOEN185_Msk        (0x8000000UL)             /*!< FOEN185 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG185_FIEN185_Pos        (26UL)                    /*!< FIEN185 (Bit 26)                                      */
#define GPIO_PINCFG185_FIEN185_Msk        (0x4000000UL)             /*!< FIEN185 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG185_NCEPOL185_Pos      (22UL)                    /*!< NCEPOL185 (Bit 22)                                    */
#define GPIO_PINCFG185_NCEPOL185_Msk      (0x400000UL)              /*!< NCEPOL185 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG185_NCESRC185_Pos      (16UL)                    /*!< NCESRC185 (Bit 16)                                    */
#define GPIO_PINCFG185_NCESRC185_Msk      (0x3f0000UL)              /*!< NCESRC185 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG185_PULLCFG185_Pos     (13UL)                    /*!< PULLCFG185 (Bit 13)                                   */
#define GPIO_PINCFG185_PULLCFG185_Msk     (0xe000UL)                /*!< PULLCFG185 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG185_SR185_Pos          (12UL)                    /*!< SR185 (Bit 12)                                        */
#define GPIO_PINCFG185_SR185_Msk          (0x1000UL)                /*!< SR185 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG185_DS185_Pos          (10UL)                    /*!< DS185 (Bit 10)                                        */
#define GPIO_PINCFG185_DS185_Msk          (0xc00UL)                 /*!< DS185 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG185_OUTCFG185_Pos      (8UL)                     /*!< OUTCFG185 (Bit 8)                                     */
#define GPIO_PINCFG185_OUTCFG185_Msk      (0x300UL)                 /*!< OUTCFG185 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG185_IRPTEN185_Pos      (6UL)                     /*!< IRPTEN185 (Bit 6)                                     */
#define GPIO_PINCFG185_IRPTEN185_Msk      (0xc0UL)                  /*!< IRPTEN185 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG185_RDZERO185_Pos      (5UL)                     /*!< RDZERO185 (Bit 5)                                     */
#define GPIO_PINCFG185_RDZERO185_Msk      (0x20UL)                  /*!< RDZERO185 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG185_INPEN185_Pos       (4UL)                     /*!< INPEN185 (Bit 4)                                      */
#define GPIO_PINCFG185_INPEN185_Msk       (0x10UL)                  /*!< INPEN185 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG185_FNCSEL185_Pos      (0UL)                     /*!< FNCSEL185 (Bit 0)                                     */
#define GPIO_PINCFG185_FNCSEL185_Msk      (0xfUL)                   /*!< FNCSEL185 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG186  ======================================================= */
#define GPIO_PINCFG186_FOEN186_Pos        (27UL)                    /*!< FOEN186 (Bit 27)                                      */
#define GPIO_PINCFG186_FOEN186_Msk        (0x8000000UL)             /*!< FOEN186 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG186_FIEN186_Pos        (26UL)                    /*!< FIEN186 (Bit 26)                                      */
#define GPIO_PINCFG186_FIEN186_Msk        (0x4000000UL)             /*!< FIEN186 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG186_NCEPOL186_Pos      (22UL)                    /*!< NCEPOL186 (Bit 22)                                    */
#define GPIO_PINCFG186_NCEPOL186_Msk      (0x400000UL)              /*!< NCEPOL186 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG186_NCESRC186_Pos      (16UL)                    /*!< NCESRC186 (Bit 16)                                    */
#define GPIO_PINCFG186_NCESRC186_Msk      (0x3f0000UL)              /*!< NCESRC186 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG186_PULLCFG186_Pos     (13UL)                    /*!< PULLCFG186 (Bit 13)                                   */
#define GPIO_PINCFG186_PULLCFG186_Msk     (0xe000UL)                /*!< PULLCFG186 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG186_SR186_Pos          (12UL)                    /*!< SR186 (Bit 12)                                        */
#define GPIO_PINCFG186_SR186_Msk          (0x1000UL)                /*!< SR186 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG186_DS186_Pos          (10UL)                    /*!< DS186 (Bit 10)                                        */
#define GPIO_PINCFG186_DS186_Msk          (0xc00UL)                 /*!< DS186 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG186_OUTCFG186_Pos      (8UL)                     /*!< OUTCFG186 (Bit 8)                                     */
#define GPIO_PINCFG186_OUTCFG186_Msk      (0x300UL)                 /*!< OUTCFG186 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG186_IRPTEN186_Pos      (6UL)                     /*!< IRPTEN186 (Bit 6)                                     */
#define GPIO_PINCFG186_IRPTEN186_Msk      (0xc0UL)                  /*!< IRPTEN186 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG186_RDZERO186_Pos      (5UL)                     /*!< RDZERO186 (Bit 5)                                     */
#define GPIO_PINCFG186_RDZERO186_Msk      (0x20UL)                  /*!< RDZERO186 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG186_INPEN186_Pos       (4UL)                     /*!< INPEN186 (Bit 4)                                      */
#define GPIO_PINCFG186_INPEN186_Msk       (0x10UL)                  /*!< INPEN186 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG186_FNCSEL186_Pos      (0UL)                     /*!< FNCSEL186 (Bit 0)                                     */
#define GPIO_PINCFG186_FNCSEL186_Msk      (0xfUL)                   /*!< FNCSEL186 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG187  ======================================================= */
#define GPIO_PINCFG187_FOEN187_Pos        (27UL)                    /*!< FOEN187 (Bit 27)                                      */
#define GPIO_PINCFG187_FOEN187_Msk        (0x8000000UL)             /*!< FOEN187 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG187_FIEN187_Pos        (26UL)                    /*!< FIEN187 (Bit 26)                                      */
#define GPIO_PINCFG187_FIEN187_Msk        (0x4000000UL)             /*!< FIEN187 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG187_NCEPOL187_Pos      (22UL)                    /*!< NCEPOL187 (Bit 22)                                    */
#define GPIO_PINCFG187_NCEPOL187_Msk      (0x400000UL)              /*!< NCEPOL187 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG187_NCESRC187_Pos      (16UL)                    /*!< NCESRC187 (Bit 16)                                    */
#define GPIO_PINCFG187_NCESRC187_Msk      (0x3f0000UL)              /*!< NCESRC187 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG187_PULLCFG187_Pos     (13UL)                    /*!< PULLCFG187 (Bit 13)                                   */
#define GPIO_PINCFG187_PULLCFG187_Msk     (0xe000UL)                /*!< PULLCFG187 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG187_SR187_Pos          (12UL)                    /*!< SR187 (Bit 12)                                        */
#define GPIO_PINCFG187_SR187_Msk          (0x1000UL)                /*!< SR187 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG187_DS187_Pos          (10UL)                    /*!< DS187 (Bit 10)                                        */
#define GPIO_PINCFG187_DS187_Msk          (0xc00UL)                 /*!< DS187 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG187_OUTCFG187_Pos      (8UL)                     /*!< OUTCFG187 (Bit 8)                                     */
#define GPIO_PINCFG187_OUTCFG187_Msk      (0x300UL)                 /*!< OUTCFG187 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG187_IRPTEN187_Pos      (6UL)                     /*!< IRPTEN187 (Bit 6)                                     */
#define GPIO_PINCFG187_IRPTEN187_Msk      (0xc0UL)                  /*!< IRPTEN187 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG187_RDZERO187_Pos      (5UL)                     /*!< RDZERO187 (Bit 5)                                     */
#define GPIO_PINCFG187_RDZERO187_Msk      (0x20UL)                  /*!< RDZERO187 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG187_INPEN187_Pos       (4UL)                     /*!< INPEN187 (Bit 4)                                      */
#define GPIO_PINCFG187_INPEN187_Msk       (0x10UL)                  /*!< INPEN187 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG187_FNCSEL187_Pos      (0UL)                     /*!< FNCSEL187 (Bit 0)                                     */
#define GPIO_PINCFG187_FNCSEL187_Msk      (0xfUL)                   /*!< FNCSEL187 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG188  ======================================================= */
#define GPIO_PINCFG188_FOEN188_Pos        (27UL)                    /*!< FOEN188 (Bit 27)                                      */
#define GPIO_PINCFG188_FOEN188_Msk        (0x8000000UL)             /*!< FOEN188 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG188_FIEN188_Pos        (26UL)                    /*!< FIEN188 (Bit 26)                                      */
#define GPIO_PINCFG188_FIEN188_Msk        (0x4000000UL)             /*!< FIEN188 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG188_NCEPOL188_Pos      (22UL)                    /*!< NCEPOL188 (Bit 22)                                    */
#define GPIO_PINCFG188_NCEPOL188_Msk      (0x400000UL)              /*!< NCEPOL188 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG188_NCESRC188_Pos      (16UL)                    /*!< NCESRC188 (Bit 16)                                    */
#define GPIO_PINCFG188_NCESRC188_Msk      (0x3f0000UL)              /*!< NCESRC188 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG188_PULLCFG188_Pos     (13UL)                    /*!< PULLCFG188 (Bit 13)                                   */
#define GPIO_PINCFG188_PULLCFG188_Msk     (0xe000UL)                /*!< PULLCFG188 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG188_SR188_Pos          (12UL)                    /*!< SR188 (Bit 12)                                        */
#define GPIO_PINCFG188_SR188_Msk          (0x1000UL)                /*!< SR188 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG188_DS188_Pos          (10UL)                    /*!< DS188 (Bit 10)                                        */
#define GPIO_PINCFG188_DS188_Msk          (0xc00UL)                 /*!< DS188 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG188_OUTCFG188_Pos      (8UL)                     /*!< OUTCFG188 (Bit 8)                                     */
#define GPIO_PINCFG188_OUTCFG188_Msk      (0x300UL)                 /*!< OUTCFG188 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG188_IRPTEN188_Pos      (6UL)                     /*!< IRPTEN188 (Bit 6)                                     */
#define GPIO_PINCFG188_IRPTEN188_Msk      (0xc0UL)                  /*!< IRPTEN188 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG188_RDZERO188_Pos      (5UL)                     /*!< RDZERO188 (Bit 5)                                     */
#define GPIO_PINCFG188_RDZERO188_Msk      (0x20UL)                  /*!< RDZERO188 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG188_INPEN188_Pos       (4UL)                     /*!< INPEN188 (Bit 4)                                      */
#define GPIO_PINCFG188_INPEN188_Msk       (0x10UL)                  /*!< INPEN188 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG188_FNCSEL188_Pos      (0UL)                     /*!< FNCSEL188 (Bit 0)                                     */
#define GPIO_PINCFG188_FNCSEL188_Msk      (0xfUL)                   /*!< FNCSEL188 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG189  ======================================================= */
#define GPIO_PINCFG189_FOEN189_Pos        (27UL)                    /*!< FOEN189 (Bit 27)                                      */
#define GPIO_PINCFG189_FOEN189_Msk        (0x8000000UL)             /*!< FOEN189 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG189_FIEN189_Pos        (26UL)                    /*!< FIEN189 (Bit 26)                                      */
#define GPIO_PINCFG189_FIEN189_Msk        (0x4000000UL)             /*!< FIEN189 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG189_NCEPOL189_Pos      (22UL)                    /*!< NCEPOL189 (Bit 22)                                    */
#define GPIO_PINCFG189_NCEPOL189_Msk      (0x400000UL)              /*!< NCEPOL189 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG189_NCESRC189_Pos      (16UL)                    /*!< NCESRC189 (Bit 16)                                    */
#define GPIO_PINCFG189_NCESRC189_Msk      (0x3f0000UL)              /*!< NCESRC189 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG189_PULLCFG189_Pos     (13UL)                    /*!< PULLCFG189 (Bit 13)                                   */
#define GPIO_PINCFG189_PULLCFG189_Msk     (0xe000UL)                /*!< PULLCFG189 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG189_SR189_Pos          (12UL)                    /*!< SR189 (Bit 12)                                        */
#define GPIO_PINCFG189_SR189_Msk          (0x1000UL)                /*!< SR189 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG189_DS189_Pos          (10UL)                    /*!< DS189 (Bit 10)                                        */
#define GPIO_PINCFG189_DS189_Msk          (0xc00UL)                 /*!< DS189 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG189_OUTCFG189_Pos      (8UL)                     /*!< OUTCFG189 (Bit 8)                                     */
#define GPIO_PINCFG189_OUTCFG189_Msk      (0x300UL)                 /*!< OUTCFG189 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG189_IRPTEN189_Pos      (6UL)                     /*!< IRPTEN189 (Bit 6)                                     */
#define GPIO_PINCFG189_IRPTEN189_Msk      (0xc0UL)                  /*!< IRPTEN189 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG189_RDZERO189_Pos      (5UL)                     /*!< RDZERO189 (Bit 5)                                     */
#define GPIO_PINCFG189_RDZERO189_Msk      (0x20UL)                  /*!< RDZERO189 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG189_INPEN189_Pos       (4UL)                     /*!< INPEN189 (Bit 4)                                      */
#define GPIO_PINCFG189_INPEN189_Msk       (0x10UL)                  /*!< INPEN189 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG189_FNCSEL189_Pos      (0UL)                     /*!< FNCSEL189 (Bit 0)                                     */
#define GPIO_PINCFG189_FNCSEL189_Msk      (0xfUL)                   /*!< FNCSEL189 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG190  ======================================================= */
#define GPIO_PINCFG190_FOEN190_Pos        (27UL)                    /*!< FOEN190 (Bit 27)                                      */
#define GPIO_PINCFG190_FOEN190_Msk        (0x8000000UL)             /*!< FOEN190 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG190_FIEN190_Pos        (26UL)                    /*!< FIEN190 (Bit 26)                                      */
#define GPIO_PINCFG190_FIEN190_Msk        (0x4000000UL)             /*!< FIEN190 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG190_NCEPOL190_Pos      (22UL)                    /*!< NCEPOL190 (Bit 22)                                    */
#define GPIO_PINCFG190_NCEPOL190_Msk      (0x400000UL)              /*!< NCEPOL190 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG190_NCESRC190_Pos      (16UL)                    /*!< NCESRC190 (Bit 16)                                    */
#define GPIO_PINCFG190_NCESRC190_Msk      (0x3f0000UL)              /*!< NCESRC190 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG190_PULLCFG190_Pos     (13UL)                    /*!< PULLCFG190 (Bit 13)                                   */
#define GPIO_PINCFG190_PULLCFG190_Msk     (0xe000UL)                /*!< PULLCFG190 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG190_SR190_Pos          (12UL)                    /*!< SR190 (Bit 12)                                        */
#define GPIO_PINCFG190_SR190_Msk          (0x1000UL)                /*!< SR190 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG190_DS190_Pos          (10UL)                    /*!< DS190 (Bit 10)                                        */
#define GPIO_PINCFG190_DS190_Msk          (0xc00UL)                 /*!< DS190 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG190_OUTCFG190_Pos      (8UL)                     /*!< OUTCFG190 (Bit 8)                                     */
#define GPIO_PINCFG190_OUTCFG190_Msk      (0x300UL)                 /*!< OUTCFG190 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG190_IRPTEN190_Pos      (6UL)                     /*!< IRPTEN190 (Bit 6)                                     */
#define GPIO_PINCFG190_IRPTEN190_Msk      (0xc0UL)                  /*!< IRPTEN190 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG190_RDZERO190_Pos      (5UL)                     /*!< RDZERO190 (Bit 5)                                     */
#define GPIO_PINCFG190_RDZERO190_Msk      (0x20UL)                  /*!< RDZERO190 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG190_INPEN190_Pos       (4UL)                     /*!< INPEN190 (Bit 4)                                      */
#define GPIO_PINCFG190_INPEN190_Msk       (0x10UL)                  /*!< INPEN190 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG190_FNCSEL190_Pos      (0UL)                     /*!< FNCSEL190 (Bit 0)                                     */
#define GPIO_PINCFG190_FNCSEL190_Msk      (0xfUL)                   /*!< FNCSEL190 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG191  ======================================================= */
#define GPIO_PINCFG191_FOEN191_Pos        (27UL)                    /*!< FOEN191 (Bit 27)                                      */
#define GPIO_PINCFG191_FOEN191_Msk        (0x8000000UL)             /*!< FOEN191 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG191_FIEN191_Pos        (26UL)                    /*!< FIEN191 (Bit 26)                                      */
#define GPIO_PINCFG191_FIEN191_Msk        (0x4000000UL)             /*!< FIEN191 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG191_NCEPOL191_Pos      (22UL)                    /*!< NCEPOL191 (Bit 22)                                    */
#define GPIO_PINCFG191_NCEPOL191_Msk      (0x400000UL)              /*!< NCEPOL191 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG191_NCESRC191_Pos      (16UL)                    /*!< NCESRC191 (Bit 16)                                    */
#define GPIO_PINCFG191_NCESRC191_Msk      (0x3f0000UL)              /*!< NCESRC191 (Bitfield-Mask: 0x3f)                       */
