zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_PINCFG198_IRPTEN198_Msk      (0xc0UL)                  /*!< IRPTEN198 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG198_RDZERO198_Pos      (5UL)                     /*!< RDZERO198 (Bit 5)                                     */
#define GPIO_PINCFG198_RDZERO198_Msk      (0x20UL)                  /*!< RDZERO198 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG198_INPEN198_Pos       (4UL)                     /*!< INPEN198 (Bit 4)                                      */
#define GPIO_PINCFG198_INPEN198_Msk       (0x10UL)                  /*!< INPEN198 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG198_FNCSEL198_Pos      (0UL)                     /*!< FNCSEL198 (Bit 0)                                     */
#define GPIO_PINCFG198_FNCSEL198_Msk      (0xfUL)                   /*!< FNCSEL198 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG199  ======================================================= */
#define GPIO_PINCFG199_FOEN199_Pos        (27UL)                    /*!< FOEN199 (Bit 27)                                      */
#define GPIO_PINCFG199_FOEN199_Msk        (0x8000000UL)             /*!< FOEN199 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG199_FIEN199_Pos        (26UL)                    /*!< FIEN199 (Bit 26)                                      */
#define GPIO_PINCFG199_FIEN199_Msk        (0x4000000UL)             /*!< FIEN199 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG199_NCEPOL199_Pos      (22UL)                    /*!< NCEPOL199 (Bit 22)                                    */
#define GPIO_PINCFG199_NCEPOL199_Msk      (0x400000UL)              /*!< NCEPOL199 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG199_NCESRC199_Pos      (16UL)                    /*!< NCESRC199 (Bit 16)                                    */
#define GPIO_PINCFG199_NCESRC199_Msk      (0x3f0000UL)              /*!< NCESRC199 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG199_PULLCFG199_Pos     (13UL)                    /*!< PULLCFG199 (Bit 13)                                   */
#define GPIO_PINCFG199_PULLCFG199_Msk     (0xe000UL)                /*!< PULLCFG199 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG199_SR199_Pos          (12UL)                    /*!< SR199 (Bit 12)                                        */
#define GPIO_PINCFG199_SR199_Msk          (0x1000UL)                /*!< SR199 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG199_DS199_Pos          (10UL)                    /*!< DS199 (Bit 10)                                        */
#define GPIO_PINCFG199_DS199_Msk          (0xc00UL)                 /*!< DS199 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG199_OUTCFG199_Pos      (8UL)                     /*!< OUTCFG199 (Bit 8)                                     */
#define GPIO_PINCFG199_OUTCFG199_Msk      (0x300UL)                 /*!< OUTCFG199 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG199_IRPTEN199_Pos      (6UL)                     /*!< IRPTEN199 (Bit 6)                                     */
#define GPIO_PINCFG199_IRPTEN199_Msk      (0xc0UL)                  /*!< IRPTEN199 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG199_RDZERO199_Pos      (5UL)                     /*!< RDZERO199 (Bit 5)                                     */
#define GPIO_PINCFG199_RDZERO199_Msk      (0x20UL)                  /*!< RDZERO199 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG199_INPEN199_Pos       (4UL)                     /*!< INPEN199 (Bit 4)                                      */
#define GPIO_PINCFG199_INPEN199_Msk       (0x10UL)                  /*!< INPEN199 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG199_FNCSEL199_Pos      (0UL)                     /*!< FNCSEL199 (Bit 0)                                     */
#define GPIO_PINCFG199_FNCSEL199_Msk      (0xfUL)                   /*!< FNCSEL199 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG200  ======================================================= */
#define GPIO_PINCFG200_FOEN200_Pos        (27UL)                    /*!< FOEN200 (Bit 27)                                      */
#define GPIO_PINCFG200_FOEN200_Msk        (0x8000000UL)             /*!< FOEN200 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG200_FIEN200_Pos        (26UL)                    /*!< FIEN200 (Bit 26)                                      */
#define GPIO_PINCFG200_FIEN200_Msk        (0x4000000UL)             /*!< FIEN200 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG200_NCEPOL200_Pos      (22UL)                    /*!< NCEPOL200 (Bit 22)                                    */
#define GPIO_PINCFG200_NCEPOL200_Msk      (0x400000UL)              /*!< NCEPOL200 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG200_NCESRC200_Pos      (16UL)                    /*!< NCESRC200 (Bit 16)                                    */
#define GPIO_PINCFG200_NCESRC200_Msk      (0x3f0000UL)              /*!< NCESRC200 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG200_PULLCFG200_Pos     (13UL)                    /*!< PULLCFG200 (Bit 13)                                   */
#define GPIO_PINCFG200_PULLCFG200_Msk     (0xe000UL)                /*!< PULLCFG200 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG200_SR200_Pos          (12UL)                    /*!< SR200 (Bit 12)                                        */
#define GPIO_PINCFG200_SR200_Msk          (0x1000UL)                /*!< SR200 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG200_DS200_Pos          (10UL)                    /*!< DS200 (Bit 10)                                        */
#define GPIO_PINCFG200_DS200_Msk          (0xc00UL)                 /*!< DS200 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG200_OUTCFG200_Pos      (8UL)                     /*!< OUTCFG200 (Bit 8)                                     */
#define GPIO_PINCFG200_OUTCFG200_Msk      (0x300UL)                 /*!< OUTCFG200 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG200_IRPTEN200_Pos      (6UL)                     /*!< IRPTEN200 (Bit 6)                                     */
#define GPIO_PINCFG200_IRPTEN200_Msk      (0xc0UL)                  /*!< IRPTEN200 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG200_RDZERO200_Pos      (5UL)                     /*!< RDZERO200 (Bit 5)                                     */
#define GPIO_PINCFG200_RDZERO200_Msk      (0x20UL)                  /*!< RDZERO200 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG200_INPEN200_Pos       (4UL)                     /*!< INPEN200 (Bit 4)                                      */
#define GPIO_PINCFG200_INPEN200_Msk       (0x10UL)                  /*!< INPEN200 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG200_FNCSEL200_Pos      (0UL)                     /*!< FNCSEL200 (Bit 0)                                     */
#define GPIO_PINCFG200_FNCSEL200_Msk      (0xfUL)                   /*!< FNCSEL200 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG201  ======================================================= */
#define GPIO_PINCFG201_FOEN201_Pos        (27UL)                    /*!< FOEN201 (Bit 27)                                      */
#define GPIO_PINCFG201_FOEN201_Msk        (0x8000000UL)             /*!< FOEN201 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG201_FIEN201_Pos        (26UL)                    /*!< FIEN201 (Bit 26)                                      */
#define GPIO_PINCFG201_FIEN201_Msk        (0x4000000UL)             /*!< FIEN201 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG201_NCEPOL201_Pos      (22UL)                    /*!< NCEPOL201 (Bit 22)                                    */
#define GPIO_PINCFG201_NCEPOL201_Msk      (0x400000UL)              /*!< NCEPOL201 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG201_NCESRC201_Pos      (16UL)                    /*!< NCESRC201 (Bit 16)                                    */
#define GPIO_PINCFG201_NCESRC201_Msk      (0x3f0000UL)              /*!< NCESRC201 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG201_PULLCFG201_Pos     (13UL)                    /*!< PULLCFG201 (Bit 13)                                   */
#define GPIO_PINCFG201_PULLCFG201_Msk     (0xe000UL)                /*!< PULLCFG201 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG201_SR201_Pos          (12UL)                    /*!< SR201 (Bit 12)                                        */
#define GPIO_PINCFG201_SR201_Msk          (0x1000UL)                /*!< SR201 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG201_DS201_Pos          (10UL)                    /*!< DS201 (Bit 10)                                        */
#define GPIO_PINCFG201_DS201_Msk          (0xc00UL)                 /*!< DS201 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG201_OUTCFG201_Pos      (8UL)                     /*!< OUTCFG201 (Bit 8)                                     */
#define GPIO_PINCFG201_OUTCFG201_Msk      (0x300UL)                 /*!< OUTCFG201 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG201_IRPTEN201_Pos      (6UL)                     /*!< IRPTEN201 (Bit 6)                                     */
#define GPIO_PINCFG201_IRPTEN201_Msk      (0xc0UL)                  /*!< IRPTEN201 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG201_RDZERO201_Pos      (5UL)                     /*!< RDZERO201 (Bit 5)                                     */
#define GPIO_PINCFG201_RDZERO201_Msk      (0x20UL)                  /*!< RDZERO201 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG201_INPEN201_Pos       (4UL)                     /*!< INPEN201 (Bit 4)                                      */
#define GPIO_PINCFG201_INPEN201_Msk       (0x10UL)                  /*!< INPEN201 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG201_FNCSEL201_Pos      (0UL)                     /*!< FNCSEL201 (Bit 0)                                     */
#define GPIO_PINCFG201_FNCSEL201_Msk      (0xfUL)                   /*!< FNCSEL201 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG202  ======================================================= */
#define GPIO_PINCFG202_FOEN202_Pos        (27UL)                    /*!< FOEN202 (Bit 27)                                      */
#define GPIO_PINCFG202_FOEN202_Msk        (0x8000000UL)             /*!< FOEN202 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG202_FIEN202_Pos        (26UL)                    /*!< FIEN202 (Bit 26)                                      */
#define GPIO_PINCFG202_FIEN202_Msk        (0x4000000UL)             /*!< FIEN202 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG202_NCEPOL202_Pos      (22UL)                    /*!< NCEPOL202 (Bit 22)                                    */
#define GPIO_PINCFG202_NCEPOL202_Msk      (0x400000UL)              /*!< NCEPOL202 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG202_NCESRC202_Pos      (16UL)                    /*!< NCESRC202 (Bit 16)                                    */
#define GPIO_PINCFG202_NCESRC202_Msk      (0x3f0000UL)              /*!< NCESRC202 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG202_PULLCFG202_Pos     (13UL)                    /*!< PULLCFG202 (Bit 13)                                   */
#define GPIO_PINCFG202_PULLCFG202_Msk     (0xe000UL)                /*!< PULLCFG202 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG202_SR202_Pos          (12UL)                    /*!< SR202 (Bit 12)                                        */
#define GPIO_PINCFG202_SR202_Msk          (0x1000UL)                /*!< SR202 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG202_DS202_Pos          (10UL)                    /*!< DS202 (Bit 10)                                        */
#define GPIO_PINCFG202_DS202_Msk          (0xc00UL)                 /*!< DS202 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG202_OUTCFG202_Pos      (8UL)                     /*!< OUTCFG202 (Bit 8)                                     */
#define GPIO_PINCFG202_OUTCFG202_Msk      (0x300UL)                 /*!< OUTCFG202 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG202_IRPTEN202_Pos      (6UL)                     /*!< IRPTEN202 (Bit 6)                                     */
#define GPIO_PINCFG202_IRPTEN202_Msk      (0xc0UL)                  /*!< IRPTEN202 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG202_RDZERO202_Pos      (5UL)                     /*!< RDZERO202 (Bit 5)                                     */
#define GPIO_PINCFG202_RDZERO202_Msk      (0x20UL)                  /*!< RDZERO202 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG202_INPEN202_Pos       (4UL)                     /*!< INPEN202 (Bit 4)                                      */
#define GPIO_PINCFG202_INPEN202_Msk       (0x10UL)                  /*!< INPEN202 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG202_FNCSEL202_Pos      (0UL)                     /*!< FNCSEL202 (Bit 0)                                     */
#define GPIO_PINCFG202_FNCSEL202_Msk      (0xfUL)                   /*!< FNCSEL202 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG203  ======================================================= */
#define GPIO_PINCFG203_FOEN203_Pos        (27UL)                    /*!< FOEN203 (Bit 27)                                      */
#define GPIO_PINCFG203_FOEN203_Msk        (0x8000000UL)             /*!< FOEN203 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG203_FIEN203_Pos        (26UL)                    /*!< FIEN203 (Bit 26)                                      */
#define GPIO_PINCFG203_FIEN203_Msk        (0x4000000UL)             /*!< FIEN203 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG203_NCEPOL203_Pos      (22UL)                    /*!< NCEPOL203 (Bit 22)                                    */
#define GPIO_PINCFG203_NCEPOL203_Msk      (0x400000UL)              /*!< NCEPOL203 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG203_NCESRC203_Pos      (16UL)                    /*!< NCESRC203 (Bit 16)                                    */
#define GPIO_PINCFG203_NCESRC203_Msk      (0x3f0000UL)              /*!< NCESRC203 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG203_PULLCFG203_Pos     (13UL)                    /*!< PULLCFG203 (Bit 13)                                   */
#define GPIO_PINCFG203_PULLCFG203_Msk     (0xe000UL)                /*!< PULLCFG203 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG203_SR203_Pos          (12UL)                    /*!< SR203 (Bit 12)                                        */
#define GPIO_PINCFG203_SR203_Msk          (0x1000UL)                /*!< SR203 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG203_DS203_Pos          (10UL)                    /*!< DS203 (Bit 10)                                        */
#define GPIO_PINCFG203_DS203_Msk          (0xc00UL)                 /*!< DS203 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG203_OUTCFG203_Pos      (8UL)                     /*!< OUTCFG203 (Bit 8)                                     */
#define GPIO_PINCFG203_OUTCFG203_Msk      (0x300UL)                 /*!< OUTCFG203 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG203_IRPTEN203_Pos      (6UL)                     /*!< IRPTEN203 (Bit 6)                                     */
#define GPIO_PINCFG203_IRPTEN203_Msk      (0xc0UL)                  /*!< IRPTEN203 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG203_RDZERO203_Pos      (5UL)                     /*!< RDZERO203 (Bit 5)                                     */
#define GPIO_PINCFG203_RDZERO203_Msk      (0x20UL)                  /*!< RDZERO203 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG203_INPEN203_Pos       (4UL)                     /*!< INPEN203 (Bit 4)                                      */
#define GPIO_PINCFG203_INPEN203_Msk       (0x10UL)                  /*!< INPEN203 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG203_FNCSEL203_Pos      (0UL)                     /*!< FNCSEL203 (Bit 0)                                     */
#define GPIO_PINCFG203_FNCSEL203_Msk      (0xfUL)                   /*!< FNCSEL203 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG204  ======================================================= */
#define GPIO_PINCFG204_FOEN204_Pos        (27UL)                    /*!< FOEN204 (Bit 27)                                      */
#define GPIO_PINCFG204_FOEN204_Msk        (0x8000000UL)             /*!< FOEN204 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG204_FIEN204_Pos        (26UL)                    /*!< FIEN204 (Bit 26)                                      */
#define GPIO_PINCFG204_FIEN204_Msk        (0x4000000UL)             /*!< FIEN204 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG204_NCEPOL204_Pos      (22UL)                    /*!< NCEPOL204 (Bit 22)                                    */
#define GPIO_PINCFG204_NCEPOL204_Msk      (0x400000UL)              /*!< NCEPOL204 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG204_NCESRC204_Pos      (16UL)                    /*!< NCESRC204 (Bit 16)                                    */
#define GPIO_PINCFG204_NCESRC204_Msk      (0x3f0000UL)              /*!< NCESRC204 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG204_PULLCFG204_Pos     (13UL)                    /*!< PULLCFG204 (Bit 13)                                   */
#define GPIO_PINCFG204_PULLCFG204_Msk     (0xe000UL)                /*!< PULLCFG204 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG204_SR204_Pos          (12UL)                    /*!< SR204 (Bit 12)                                        */
#define GPIO_PINCFG204_SR204_Msk          (0x1000UL)                /*!< SR204 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG204_DS204_Pos          (10UL)                    /*!< DS204 (Bit 10)                                        */
#define GPIO_PINCFG204_DS204_Msk          (0xc00UL)                 /*!< DS204 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG204_OUTCFG204_Pos      (8UL)                     /*!< OUTCFG204 (Bit 8)                                     */
#define GPIO_PINCFG204_OUTCFG204_Msk      (0x300UL)                 /*!< OUTCFG204 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG204_IRPTEN204_Pos      (6UL)                     /*!< IRPTEN204 (Bit 6)                                     */
#define GPIO_PINCFG204_IRPTEN204_Msk      (0xc0UL)                  /*!< IRPTEN204 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG204_RDZERO204_Pos      (5UL)                     /*!< RDZERO204 (Bit 5)                                     */
#define GPIO_PINCFG204_RDZERO204_Msk      (0x20UL)                  /*!< RDZERO204 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG204_INPEN204_Pos       (4UL)                     /*!< INPEN204 (Bit 4)                                      */
#define GPIO_PINCFG204_INPEN204_Msk       (0x10UL)                  /*!< INPEN204 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG204_FNCSEL204_Pos      (0UL)                     /*!< FNCSEL204 (Bit 0)                                     */
#define GPIO_PINCFG204_FNCSEL204_Msk      (0xfUL)                   /*!< FNCSEL204 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG205  ======================================================= */
#define GPIO_PINCFG205_FOEN205_Pos        (27UL)                    /*!< FOEN205 (Bit 27)                                      */
#define GPIO_PINCFG205_FOEN205_Msk        (0x8000000UL)             /*!< FOEN205 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG205_FIEN205_Pos        (26UL)                    /*!< FIEN205 (Bit 26)                                      */
#define GPIO_PINCFG205_FIEN205_Msk        (0x4000000UL)             /*!< FIEN205 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG205_NCEPOL205_Pos      (22UL)                    /*!< NCEPOL205 (Bit 22)                                    */
#define GPIO_PINCFG205_NCEPOL205_Msk      (0x400000UL)              /*!< NCEPOL205 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG205_NCESRC205_Pos      (16UL)                    /*!< NCESRC205 (Bit 16)                                    */
#define GPIO_PINCFG205_NCESRC205_Msk      (0x3f0000UL)              /*!< NCESRC205 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG205_PULLCFG205_Pos     (13UL)                    /*!< PULLCFG205 (Bit 13)                                   */
#define GPIO_PINCFG205_PULLCFG205_Msk     (0xe000UL)                /*!< PULLCFG205 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG205_SR205_Pos          (12UL)                    /*!< SR205 (Bit 12)                                        */
#define GPIO_PINCFG205_SR205_Msk          (0x1000UL)                /*!< SR205 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG205_DS205_Pos          (10UL)                    /*!< DS205 (Bit 10)                                        */
#define GPIO_PINCFG205_DS205_Msk          (0xc00UL)                 /*!< DS205 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG205_OUTCFG205_Pos      (8UL)                     /*!< OUTCFG205 (Bit 8)                                     */
#define GPIO_PINCFG205_OUTCFG205_Msk      (0x300UL)                 /*!< OUTCFG205 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG205_IRPTEN205_Pos      (6UL)                     /*!< IRPTEN205 (Bit 6)                                     */
#define GPIO_PINCFG205_IRPTEN205_Msk      (0xc0UL)                  /*!< IRPTEN205 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG205_RDZERO205_Pos      (5UL)                     /*!< RDZERO205 (Bit 5)                                     */
#define GPIO_PINCFG205_RDZERO205_Msk      (0x20UL)                  /*!< RDZERO205 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG205_INPEN205_Pos       (4UL)                     /*!< INPEN205 (Bit 4)                                      */
#define GPIO_PINCFG205_INPEN205_Msk       (0x10UL)                  /*!< INPEN205 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG205_FNCSEL205_Pos      (0UL)                     /*!< FNCSEL205 (Bit 0)                                     */
#define GPIO_PINCFG205_FNCSEL205_Msk      (0xfUL)                   /*!< FNCSEL205 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG206  ======================================================= */
#define GPIO_PINCFG206_FOEN206_Pos        (27UL)                    /*!< FOEN206 (Bit 27)                                      */
