zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_MCUN0INT4STAT_MCUN0GPIO131_Msk (0x8UL)                 /*!< MCUN0GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO130_Pos (2UL)                   /*!< MCUN0GPIO130 (Bit 2)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO130_Msk (0x4UL)                 /*!< MCUN0GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO129_Pos (1UL)                   /*!< MCUN0GPIO129 (Bit 1)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO129_Msk (0x2UL)                 /*!< MCUN0GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO128_Pos (0UL)                   /*!< MCUN0GPIO128 (Bit 0)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO128_Msk (0x1UL)                 /*!< MCUN0GPIO128 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT4CLR  ====================================================== */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO159_Pos (31UL)                   /*!< MCUN0GPIO159 (Bit 31)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO159_Msk (0x80000000UL)           /*!< MCUN0GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO158_Pos (30UL)                   /*!< MCUN0GPIO158 (Bit 30)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO158_Msk (0x40000000UL)           /*!< MCUN0GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO157_Pos (29UL)                   /*!< MCUN0GPIO157 (Bit 29)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO157_Msk (0x20000000UL)           /*!< MCUN0GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO156_Pos (28UL)                   /*!< MCUN0GPIO156 (Bit 28)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO156_Msk (0x10000000UL)           /*!< MCUN0GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO155_Pos (27UL)                   /*!< MCUN0GPIO155 (Bit 27)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO155_Msk (0x8000000UL)            /*!< MCUN0GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO154_Pos (26UL)                   /*!< MCUN0GPIO154 (Bit 26)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO154_Msk (0x4000000UL)            /*!< MCUN0GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO153_Pos (25UL)                   /*!< MCUN0GPIO153 (Bit 25)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO153_Msk (0x2000000UL)            /*!< MCUN0GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO152_Pos (24UL)                   /*!< MCUN0GPIO152 (Bit 24)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO152_Msk (0x1000000UL)            /*!< MCUN0GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO151_Pos (23UL)                   /*!< MCUN0GPIO151 (Bit 23)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO151_Msk (0x800000UL)             /*!< MCUN0GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO150_Pos (22UL)                   /*!< MCUN0GPIO150 (Bit 22)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO150_Msk (0x400000UL)             /*!< MCUN0GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO149_Pos (21UL)                   /*!< MCUN0GPIO149 (Bit 21)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO149_Msk (0x200000UL)             /*!< MCUN0GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO148_Pos (20UL)                   /*!< MCUN0GPIO148 (Bit 20)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO148_Msk (0x100000UL)             /*!< MCUN0GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO147_Pos (19UL)                   /*!< MCUN0GPIO147 (Bit 19)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO147_Msk (0x80000UL)              /*!< MCUN0GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO146_Pos (18UL)                   /*!< MCUN0GPIO146 (Bit 18)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO146_Msk (0x40000UL)              /*!< MCUN0GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO145_Pos (17UL)                   /*!< MCUN0GPIO145 (Bit 17)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO145_Msk (0x20000UL)              /*!< MCUN0GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO144_Pos (16UL)                   /*!< MCUN0GPIO144 (Bit 16)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO144_Msk (0x10000UL)              /*!< MCUN0GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO143_Pos (15UL)                   /*!< MCUN0GPIO143 (Bit 15)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO143_Msk (0x8000UL)               /*!< MCUN0GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO142_Pos (14UL)                   /*!< MCUN0GPIO142 (Bit 14)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO142_Msk (0x4000UL)               /*!< MCUN0GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO141_Pos (13UL)                   /*!< MCUN0GPIO141 (Bit 13)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO141_Msk (0x2000UL)               /*!< MCUN0GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO140_Pos (12UL)                   /*!< MCUN0GPIO140 (Bit 12)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO140_Msk (0x1000UL)               /*!< MCUN0GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO139_Pos (11UL)                   /*!< MCUN0GPIO139 (Bit 11)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO139_Msk (0x800UL)                /*!< MCUN0GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO138_Pos (10UL)                   /*!< MCUN0GPIO138 (Bit 10)                                 */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO138_Msk (0x400UL)                /*!< MCUN0GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO137_Pos (9UL)                    /*!< MCUN0GPIO137 (Bit 9)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO137_Msk (0x200UL)                /*!< MCUN0GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO136_Pos (8UL)                    /*!< MCUN0GPIO136 (Bit 8)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO136_Msk (0x100UL)                /*!< MCUN0GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO135_Pos (7UL)                    /*!< MCUN0GPIO135 (Bit 7)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO135_Msk (0x80UL)                 /*!< MCUN0GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO134_Pos (6UL)                    /*!< MCUN0GPIO134 (Bit 6)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO134_Msk (0x40UL)                 /*!< MCUN0GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO133_Pos (5UL)                    /*!< MCUN0GPIO133 (Bit 5)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO133_Msk (0x20UL)                 /*!< MCUN0GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO132_Pos (4UL)                    /*!< MCUN0GPIO132 (Bit 4)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO132_Msk (0x10UL)                 /*!< MCUN0GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO131_Pos (3UL)                    /*!< MCUN0GPIO131 (Bit 3)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO131_Msk (0x8UL)                  /*!< MCUN0GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO130_Pos (2UL)                    /*!< MCUN0GPIO130 (Bit 2)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO130_Msk (0x4UL)                  /*!< MCUN0GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO129_Pos (1UL)                    /*!< MCUN0GPIO129 (Bit 1)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO129_Msk (0x2UL)                  /*!< MCUN0GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO128_Pos (0UL)                    /*!< MCUN0GPIO128 (Bit 0)                                  */
#define GPIO_MCUN0INT4CLR_MCUN0GPIO128_Msk (0x1UL)                  /*!< MCUN0GPIO128 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT4SET  ====================================================== */
#define GPIO_MCUN0INT4SET_MCUN0GPIO159_Pos (31UL)                   /*!< MCUN0GPIO159 (Bit 31)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO159_Msk (0x80000000UL)           /*!< MCUN0GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO158_Pos (30UL)                   /*!< MCUN0GPIO158 (Bit 30)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO158_Msk (0x40000000UL)           /*!< MCUN0GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO157_Pos (29UL)                   /*!< MCUN0GPIO157 (Bit 29)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO157_Msk (0x20000000UL)           /*!< MCUN0GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO156_Pos (28UL)                   /*!< MCUN0GPIO156 (Bit 28)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO156_Msk (0x10000000UL)           /*!< MCUN0GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO155_Pos (27UL)                   /*!< MCUN0GPIO155 (Bit 27)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO155_Msk (0x8000000UL)            /*!< MCUN0GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO154_Pos (26UL)                   /*!< MCUN0GPIO154 (Bit 26)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO154_Msk (0x4000000UL)            /*!< MCUN0GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO153_Pos (25UL)                   /*!< MCUN0GPIO153 (Bit 25)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO153_Msk (0x2000000UL)            /*!< MCUN0GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO152_Pos (24UL)                   /*!< MCUN0GPIO152 (Bit 24)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO152_Msk (0x1000000UL)            /*!< MCUN0GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO151_Pos (23UL)                   /*!< MCUN0GPIO151 (Bit 23)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO151_Msk (0x800000UL)             /*!< MCUN0GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO150_Pos (22UL)                   /*!< MCUN0GPIO150 (Bit 22)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO150_Msk (0x400000UL)             /*!< MCUN0GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO149_Pos (21UL)                   /*!< MCUN0GPIO149 (Bit 21)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO149_Msk (0x200000UL)             /*!< MCUN0GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO148_Pos (20UL)                   /*!< MCUN0GPIO148 (Bit 20)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO148_Msk (0x100000UL)             /*!< MCUN0GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO147_Pos (19UL)                   /*!< MCUN0GPIO147 (Bit 19)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO147_Msk (0x80000UL)              /*!< MCUN0GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO146_Pos (18UL)                   /*!< MCUN0GPIO146 (Bit 18)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO146_Msk (0x40000UL)              /*!< MCUN0GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO145_Pos (17UL)                   /*!< MCUN0GPIO145 (Bit 17)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO145_Msk (0x20000UL)              /*!< MCUN0GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO144_Pos (16UL)                   /*!< MCUN0GPIO144 (Bit 16)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO144_Msk (0x10000UL)              /*!< MCUN0GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO143_Pos (15UL)                   /*!< MCUN0GPIO143 (Bit 15)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO143_Msk (0x8000UL)               /*!< MCUN0GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO142_Pos (14UL)                   /*!< MCUN0GPIO142 (Bit 14)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO142_Msk (0x4000UL)               /*!< MCUN0GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO141_Pos (13UL)                   /*!< MCUN0GPIO141 (Bit 13)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO141_Msk (0x2000UL)               /*!< MCUN0GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO140_Pos (12UL)                   /*!< MCUN0GPIO140 (Bit 12)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO140_Msk (0x1000UL)               /*!< MCUN0GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO139_Pos (11UL)                   /*!< MCUN0GPIO139 (Bit 11)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO139_Msk (0x800UL)                /*!< MCUN0GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO138_Pos (10UL)                   /*!< MCUN0GPIO138 (Bit 10)                                 */
#define GPIO_MCUN0INT4SET_MCUN0GPIO138_Msk (0x400UL)                /*!< MCUN0GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO137_Pos (9UL)                    /*!< MCUN0GPIO137 (Bit 9)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO137_Msk (0x200UL)                /*!< MCUN0GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO136_Pos (8UL)                    /*!< MCUN0GPIO136 (Bit 8)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO136_Msk (0x100UL)                /*!< MCUN0GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO135_Pos (7UL)                    /*!< MCUN0GPIO135 (Bit 7)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO135_Msk (0x80UL)                 /*!< MCUN0GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO134_Pos (6UL)                    /*!< MCUN0GPIO134 (Bit 6)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO134_Msk (0x40UL)                 /*!< MCUN0GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO133_Pos (5UL)                    /*!< MCUN0GPIO133 (Bit 5)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO133_Msk (0x20UL)                 /*!< MCUN0GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO132_Pos (4UL)                    /*!< MCUN0GPIO132 (Bit 4)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO132_Msk (0x10UL)                 /*!< MCUN0GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO131_Pos (3UL)                    /*!< MCUN0GPIO131 (Bit 3)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO131_Msk (0x8UL)                  /*!< MCUN0GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO130_Pos (2UL)                    /*!< MCUN0GPIO130 (Bit 2)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO130_Msk (0x4UL)                  /*!< MCUN0GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO129_Pos (1UL)                    /*!< MCUN0GPIO129 (Bit 1)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO129_Msk (0x2UL)                  /*!< MCUN0GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4SET_MCUN0GPIO128_Pos (0UL)                    /*!< MCUN0GPIO128 (Bit 0)                                  */
#define GPIO_MCUN0INT4SET_MCUN0GPIO128_Msk (0x1UL)                  /*!< MCUN0GPIO128 (Bitfield-Mask: 0x01)                    */
/* ======================================================  MCUN0INT5EN  ====================================================== */
#define GPIO_MCUN0INT5EN_MCUN0GPIO191_Pos (31UL)                    /*!< MCUN0GPIO191 (Bit 31)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO191_Msk (0x80000000UL)            /*!< MCUN0GPIO191 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO190_Pos (30UL)                    /*!< MCUN0GPIO190 (Bit 30)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO190_Msk (0x40000000UL)            /*!< MCUN0GPIO190 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO189_Pos (29UL)                    /*!< MCUN0GPIO189 (Bit 29)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO189_Msk (0x20000000UL)            /*!< MCUN0GPIO189 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO188_Pos (28UL)                    /*!< MCUN0GPIO188 (Bit 28)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO188_Msk (0x10000000UL)            /*!< MCUN0GPIO188 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO187_Pos (27UL)                    /*!< MCUN0GPIO187 (Bit 27)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO187_Msk (0x8000000UL)             /*!< MCUN0GPIO187 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO186_Pos (26UL)                    /*!< MCUN0GPIO186 (Bit 26)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO186_Msk (0x4000000UL)             /*!< MCUN0GPIO186 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO185_Pos (25UL)                    /*!< MCUN0GPIO185 (Bit 25)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO185_Msk (0x2000000UL)             /*!< MCUN0GPIO185 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO184_Pos (24UL)                    /*!< MCUN0GPIO184 (Bit 24)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO184_Msk (0x1000000UL)             /*!< MCUN0GPIO184 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO183_Pos (23UL)                    /*!< MCUN0GPIO183 (Bit 23)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO183_Msk (0x800000UL)              /*!< MCUN0GPIO183 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO182_Pos (22UL)                    /*!< MCUN0GPIO182 (Bit 22)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO182_Msk (0x400000UL)              /*!< MCUN0GPIO182 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO181_Pos (21UL)                    /*!< MCUN0GPIO181 (Bit 21)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO181_Msk (0x200000UL)              /*!< MCUN0GPIO181 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO180_Pos (20UL)                    /*!< MCUN0GPIO180 (Bit 20)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO180_Msk (0x100000UL)              /*!< MCUN0GPIO180 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO179_Pos (19UL)                    /*!< MCUN0GPIO179 (Bit 19)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO179_Msk (0x80000UL)               /*!< MCUN0GPIO179 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO178_Pos (18UL)                    /*!< MCUN0GPIO178 (Bit 18)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO178_Msk (0x40000UL)               /*!< MCUN0GPIO178 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO177_Pos (17UL)                    /*!< MCUN0GPIO177 (Bit 17)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO177_Msk (0x20000UL)               /*!< MCUN0GPIO177 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO176_Pos (16UL)                    /*!< MCUN0GPIO176 (Bit 16)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO176_Msk (0x10000UL)               /*!< MCUN0GPIO176 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO175_Pos (15UL)                    /*!< MCUN0GPIO175 (Bit 15)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO175_Msk (0x8000UL)                /*!< MCUN0GPIO175 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO174_Pos (14UL)                    /*!< MCUN0GPIO174 (Bit 14)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO174_Msk (0x4000UL)                /*!< MCUN0GPIO174 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO173_Pos (13UL)                    /*!< MCUN0GPIO173 (Bit 13)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO173_Msk (0x2000UL)                /*!< MCUN0GPIO173 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO172_Pos (12UL)                    /*!< MCUN0GPIO172 (Bit 12)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO172_Msk (0x1000UL)                /*!< MCUN0GPIO172 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO171_Pos (11UL)                    /*!< MCUN0GPIO171 (Bit 11)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO171_Msk (0x800UL)                 /*!< MCUN0GPIO171 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO170_Pos (10UL)                    /*!< MCUN0GPIO170 (Bit 10)                                 */
#define GPIO_MCUN0INT5EN_MCUN0GPIO170_Msk (0x400UL)                 /*!< MCUN0GPIO170 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5EN_MCUN0GPIO169_Pos (9UL)                     /*!< MCUN0GPIO169 (Bit 9)                                  */
#define GPIO_MCUN0INT5EN_MCUN0GPIO169_Msk (0x200UL)                 /*!< MCUN0GPIO169 (Bitfield-Mask: 0x01)                    */
