zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_MCUN0INT5SET_MCUN0GPIO174_Msk (0x4000UL)               /*!< MCUN0GPIO174 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO173_Pos (13UL)                   /*!< MCUN0GPIO173 (Bit 13)                                 */
#define GPIO_MCUN0INT5SET_MCUN0GPIO173_Msk (0x2000UL)               /*!< MCUN0GPIO173 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO172_Pos (12UL)                   /*!< MCUN0GPIO172 (Bit 12)                                 */
#define GPIO_MCUN0INT5SET_MCUN0GPIO172_Msk (0x1000UL)               /*!< MCUN0GPIO172 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO171_Pos (11UL)                   /*!< MCUN0GPIO171 (Bit 11)                                 */
#define GPIO_MCUN0INT5SET_MCUN0GPIO171_Msk (0x800UL)                /*!< MCUN0GPIO171 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO170_Pos (10UL)                   /*!< MCUN0GPIO170 (Bit 10)                                 */
#define GPIO_MCUN0INT5SET_MCUN0GPIO170_Msk (0x400UL)                /*!< MCUN0GPIO170 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO169_Pos (9UL)                    /*!< MCUN0GPIO169 (Bit 9)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO169_Msk (0x200UL)                /*!< MCUN0GPIO169 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO168_Pos (8UL)                    /*!< MCUN0GPIO168 (Bit 8)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO168_Msk (0x100UL)                /*!< MCUN0GPIO168 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO167_Pos (7UL)                    /*!< MCUN0GPIO167 (Bit 7)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO167_Msk (0x80UL)                 /*!< MCUN0GPIO167 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO166_Pos (6UL)                    /*!< MCUN0GPIO166 (Bit 6)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO166_Msk (0x40UL)                 /*!< MCUN0GPIO166 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO165_Pos (5UL)                    /*!< MCUN0GPIO165 (Bit 5)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO165_Msk (0x20UL)                 /*!< MCUN0GPIO165 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO164_Pos (4UL)                    /*!< MCUN0GPIO164 (Bit 4)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO164_Msk (0x10UL)                 /*!< MCUN0GPIO164 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO163_Pos (3UL)                    /*!< MCUN0GPIO163 (Bit 3)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO163_Msk (0x8UL)                  /*!< MCUN0GPIO163 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO162_Pos (2UL)                    /*!< MCUN0GPIO162 (Bit 2)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO162_Msk (0x4UL)                  /*!< MCUN0GPIO162 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO161_Pos (1UL)                    /*!< MCUN0GPIO161 (Bit 1)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO161_Msk (0x2UL)                  /*!< MCUN0GPIO161 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT5SET_MCUN0GPIO160_Pos (0UL)                    /*!< MCUN0GPIO160 (Bit 0)                                  */
#define GPIO_MCUN0INT5SET_MCUN0GPIO160_Msk (0x1UL)                  /*!< MCUN0GPIO160 (Bitfield-Mask: 0x01)                    */
/* ======================================================  MCUN0INT6EN  ====================================================== */
#define GPIO_MCUN0INT6EN_MCUN0GPIO223_Pos (31UL)                    /*!< MCUN0GPIO223 (Bit 31)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO223_Msk (0x80000000UL)            /*!< MCUN0GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO222_Pos (30UL)                    /*!< MCUN0GPIO222 (Bit 30)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO222_Msk (0x40000000UL)            /*!< MCUN0GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO221_Pos (29UL)                    /*!< MCUN0GPIO221 (Bit 29)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO221_Msk (0x20000000UL)            /*!< MCUN0GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO220_Pos (28UL)                    /*!< MCUN0GPIO220 (Bit 28)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO220_Msk (0x10000000UL)            /*!< MCUN0GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO219_Pos (27UL)                    /*!< MCUN0GPIO219 (Bit 27)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO219_Msk (0x8000000UL)             /*!< MCUN0GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO218_Pos (26UL)                    /*!< MCUN0GPIO218 (Bit 26)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO218_Msk (0x4000000UL)             /*!< MCUN0GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO217_Pos (25UL)                    /*!< MCUN0GPIO217 (Bit 25)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO217_Msk (0x2000000UL)             /*!< MCUN0GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO216_Pos (24UL)                    /*!< MCUN0GPIO216 (Bit 24)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO216_Msk (0x1000000UL)             /*!< MCUN0GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO215_Pos (23UL)                    /*!< MCUN0GPIO215 (Bit 23)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO215_Msk (0x800000UL)              /*!< MCUN0GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO214_Pos (22UL)                    /*!< MCUN0GPIO214 (Bit 22)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO214_Msk (0x400000UL)              /*!< MCUN0GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO213_Pos (21UL)                    /*!< MCUN0GPIO213 (Bit 21)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO213_Msk (0x200000UL)              /*!< MCUN0GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO212_Pos (20UL)                    /*!< MCUN0GPIO212 (Bit 20)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO212_Msk (0x100000UL)              /*!< MCUN0GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO211_Pos (19UL)                    /*!< MCUN0GPIO211 (Bit 19)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO211_Msk (0x80000UL)               /*!< MCUN0GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO210_Pos (18UL)                    /*!< MCUN0GPIO210 (Bit 18)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO210_Msk (0x40000UL)               /*!< MCUN0GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO209_Pos (17UL)                    /*!< MCUN0GPIO209 (Bit 17)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO209_Msk (0x20000UL)               /*!< MCUN0GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO208_Pos (16UL)                    /*!< MCUN0GPIO208 (Bit 16)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO208_Msk (0x10000UL)               /*!< MCUN0GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO207_Pos (15UL)                    /*!< MCUN0GPIO207 (Bit 15)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO207_Msk (0x8000UL)                /*!< MCUN0GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO206_Pos (14UL)                    /*!< MCUN0GPIO206 (Bit 14)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO206_Msk (0x4000UL)                /*!< MCUN0GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO205_Pos (13UL)                    /*!< MCUN0GPIO205 (Bit 13)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO205_Msk (0x2000UL)                /*!< MCUN0GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO204_Pos (12UL)                    /*!< MCUN0GPIO204 (Bit 12)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO204_Msk (0x1000UL)                /*!< MCUN0GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO203_Pos (11UL)                    /*!< MCUN0GPIO203 (Bit 11)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO203_Msk (0x800UL)                 /*!< MCUN0GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO202_Pos (10UL)                    /*!< MCUN0GPIO202 (Bit 10)                                 */
#define GPIO_MCUN0INT6EN_MCUN0GPIO202_Msk (0x400UL)                 /*!< MCUN0GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO201_Pos (9UL)                     /*!< MCUN0GPIO201 (Bit 9)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO201_Msk (0x200UL)                 /*!< MCUN0GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO200_Pos (8UL)                     /*!< MCUN0GPIO200 (Bit 8)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO200_Msk (0x100UL)                 /*!< MCUN0GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO199_Pos (7UL)                     /*!< MCUN0GPIO199 (Bit 7)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO199_Msk (0x80UL)                  /*!< MCUN0GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO198_Pos (6UL)                     /*!< MCUN0GPIO198 (Bit 6)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO198_Msk (0x40UL)                  /*!< MCUN0GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO197_Pos (5UL)                     /*!< MCUN0GPIO197 (Bit 5)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO197_Msk (0x20UL)                  /*!< MCUN0GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO196_Pos (4UL)                     /*!< MCUN0GPIO196 (Bit 4)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO196_Msk (0x10UL)                  /*!< MCUN0GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO195_Pos (3UL)                     /*!< MCUN0GPIO195 (Bit 3)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO195_Msk (0x8UL)                   /*!< MCUN0GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO194_Pos (2UL)                     /*!< MCUN0GPIO194 (Bit 2)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO194_Msk (0x4UL)                   /*!< MCUN0GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO193_Pos (1UL)                     /*!< MCUN0GPIO193 (Bit 1)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO193_Msk (0x2UL)                   /*!< MCUN0GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6EN_MCUN0GPIO192_Pos (0UL)                     /*!< MCUN0GPIO192 (Bit 0)                                  */
#define GPIO_MCUN0INT6EN_MCUN0GPIO192_Msk (0x1UL)                   /*!< MCUN0GPIO192 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT6STAT  ===================================================== */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO223_Pos (31UL)                  /*!< MCUN0GPIO223 (Bit 31)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO223_Msk (0x80000000UL)          /*!< MCUN0GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO222_Pos (30UL)                  /*!< MCUN0GPIO222 (Bit 30)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO222_Msk (0x40000000UL)          /*!< MCUN0GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO221_Pos (29UL)                  /*!< MCUN0GPIO221 (Bit 29)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO221_Msk (0x20000000UL)          /*!< MCUN0GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO220_Pos (28UL)                  /*!< MCUN0GPIO220 (Bit 28)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO220_Msk (0x10000000UL)          /*!< MCUN0GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO219_Pos (27UL)                  /*!< MCUN0GPIO219 (Bit 27)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO219_Msk (0x8000000UL)           /*!< MCUN0GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO218_Pos (26UL)                  /*!< MCUN0GPIO218 (Bit 26)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO218_Msk (0x4000000UL)           /*!< MCUN0GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO217_Pos (25UL)                  /*!< MCUN0GPIO217 (Bit 25)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO217_Msk (0x2000000UL)           /*!< MCUN0GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO216_Pos (24UL)                  /*!< MCUN0GPIO216 (Bit 24)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO216_Msk (0x1000000UL)           /*!< MCUN0GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO215_Pos (23UL)                  /*!< MCUN0GPIO215 (Bit 23)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO215_Msk (0x800000UL)            /*!< MCUN0GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO214_Pos (22UL)                  /*!< MCUN0GPIO214 (Bit 22)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO214_Msk (0x400000UL)            /*!< MCUN0GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO213_Pos (21UL)                  /*!< MCUN0GPIO213 (Bit 21)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO213_Msk (0x200000UL)            /*!< MCUN0GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO212_Pos (20UL)                  /*!< MCUN0GPIO212 (Bit 20)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO212_Msk (0x100000UL)            /*!< MCUN0GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO211_Pos (19UL)                  /*!< MCUN0GPIO211 (Bit 19)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO211_Msk (0x80000UL)             /*!< MCUN0GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO210_Pos (18UL)                  /*!< MCUN0GPIO210 (Bit 18)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO210_Msk (0x40000UL)             /*!< MCUN0GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO209_Pos (17UL)                  /*!< MCUN0GPIO209 (Bit 17)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO209_Msk (0x20000UL)             /*!< MCUN0GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO208_Pos (16UL)                  /*!< MCUN0GPIO208 (Bit 16)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO208_Msk (0x10000UL)             /*!< MCUN0GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO207_Pos (15UL)                  /*!< MCUN0GPIO207 (Bit 15)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO207_Msk (0x8000UL)              /*!< MCUN0GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO206_Pos (14UL)                  /*!< MCUN0GPIO206 (Bit 14)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO206_Msk (0x4000UL)              /*!< MCUN0GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO205_Pos (13UL)                  /*!< MCUN0GPIO205 (Bit 13)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO205_Msk (0x2000UL)              /*!< MCUN0GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO204_Pos (12UL)                  /*!< MCUN0GPIO204 (Bit 12)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO204_Msk (0x1000UL)              /*!< MCUN0GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO203_Pos (11UL)                  /*!< MCUN0GPIO203 (Bit 11)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO203_Msk (0x800UL)               /*!< MCUN0GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO202_Pos (10UL)                  /*!< MCUN0GPIO202 (Bit 10)                                 */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO202_Msk (0x400UL)               /*!< MCUN0GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO201_Pos (9UL)                   /*!< MCUN0GPIO201 (Bit 9)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO201_Msk (0x200UL)               /*!< MCUN0GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO200_Pos (8UL)                   /*!< MCUN0GPIO200 (Bit 8)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO200_Msk (0x100UL)               /*!< MCUN0GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO199_Pos (7UL)                   /*!< MCUN0GPIO199 (Bit 7)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO199_Msk (0x80UL)                /*!< MCUN0GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO198_Pos (6UL)                   /*!< MCUN0GPIO198 (Bit 6)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO198_Msk (0x40UL)                /*!< MCUN0GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO197_Pos (5UL)                   /*!< MCUN0GPIO197 (Bit 5)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO197_Msk (0x20UL)                /*!< MCUN0GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO196_Pos (4UL)                   /*!< MCUN0GPIO196 (Bit 4)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO196_Msk (0x10UL)                /*!< MCUN0GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO195_Pos (3UL)                   /*!< MCUN0GPIO195 (Bit 3)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO195_Msk (0x8UL)                 /*!< MCUN0GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO194_Pos (2UL)                   /*!< MCUN0GPIO194 (Bit 2)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO194_Msk (0x4UL)                 /*!< MCUN0GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO193_Pos (1UL)                   /*!< MCUN0GPIO193 (Bit 1)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO193_Msk (0x2UL)                 /*!< MCUN0GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO192_Pos (0UL)                   /*!< MCUN0GPIO192 (Bit 0)                                  */
#define GPIO_MCUN0INT6STAT_MCUN0GPIO192_Msk (0x1UL)                 /*!< MCUN0GPIO192 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT6CLR  ====================================================== */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO223_Pos (31UL)                   /*!< MCUN0GPIO223 (Bit 31)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO223_Msk (0x80000000UL)           /*!< MCUN0GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO222_Pos (30UL)                   /*!< MCUN0GPIO222 (Bit 30)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO222_Msk (0x40000000UL)           /*!< MCUN0GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO221_Pos (29UL)                   /*!< MCUN0GPIO221 (Bit 29)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO221_Msk (0x20000000UL)           /*!< MCUN0GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO220_Pos (28UL)                   /*!< MCUN0GPIO220 (Bit 28)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO220_Msk (0x10000000UL)           /*!< MCUN0GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO219_Pos (27UL)                   /*!< MCUN0GPIO219 (Bit 27)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO219_Msk (0x8000000UL)            /*!< MCUN0GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO218_Pos (26UL)                   /*!< MCUN0GPIO218 (Bit 26)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO218_Msk (0x4000000UL)            /*!< MCUN0GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO217_Pos (25UL)                   /*!< MCUN0GPIO217 (Bit 25)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO217_Msk (0x2000000UL)            /*!< MCUN0GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO216_Pos (24UL)                   /*!< MCUN0GPIO216 (Bit 24)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO216_Msk (0x1000000UL)            /*!< MCUN0GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO215_Pos (23UL)                   /*!< MCUN0GPIO215 (Bit 23)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO215_Msk (0x800000UL)             /*!< MCUN0GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO214_Pos (22UL)                   /*!< MCUN0GPIO214 (Bit 22)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO214_Msk (0x400000UL)             /*!< MCUN0GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO213_Pos (21UL)                   /*!< MCUN0GPIO213 (Bit 21)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO213_Msk (0x200000UL)             /*!< MCUN0GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO212_Pos (20UL)                   /*!< MCUN0GPIO212 (Bit 20)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO212_Msk (0x100000UL)             /*!< MCUN0GPIO212 (Bitfield-Mask: 0x01)                    */
