zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_MCUN0INT6CLR_MCUN0GPIO211_Pos (19UL)                   /*!< MCUN0GPIO211 (Bit 19)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO211_Msk (0x80000UL)              /*!< MCUN0GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO210_Pos (18UL)                   /*!< MCUN0GPIO210 (Bit 18)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO210_Msk (0x40000UL)              /*!< MCUN0GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO209_Pos (17UL)                   /*!< MCUN0GPIO209 (Bit 17)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO209_Msk (0x20000UL)              /*!< MCUN0GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO208_Pos (16UL)                   /*!< MCUN0GPIO208 (Bit 16)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO208_Msk (0x10000UL)              /*!< MCUN0GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO207_Pos (15UL)                   /*!< MCUN0GPIO207 (Bit 15)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO207_Msk (0x8000UL)               /*!< MCUN0GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO206_Pos (14UL)                   /*!< MCUN0GPIO206 (Bit 14)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO206_Msk (0x4000UL)               /*!< MCUN0GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO205_Pos (13UL)                   /*!< MCUN0GPIO205 (Bit 13)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO205_Msk (0x2000UL)               /*!< MCUN0GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO204_Pos (12UL)                   /*!< MCUN0GPIO204 (Bit 12)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO204_Msk (0x1000UL)               /*!< MCUN0GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO203_Pos (11UL)                   /*!< MCUN0GPIO203 (Bit 11)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO203_Msk (0x800UL)                /*!< MCUN0GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO202_Pos (10UL)                   /*!< MCUN0GPIO202 (Bit 10)                                 */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO202_Msk (0x400UL)                /*!< MCUN0GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO201_Pos (9UL)                    /*!< MCUN0GPIO201 (Bit 9)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO201_Msk (0x200UL)                /*!< MCUN0GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO200_Pos (8UL)                    /*!< MCUN0GPIO200 (Bit 8)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO200_Msk (0x100UL)                /*!< MCUN0GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO199_Pos (7UL)                    /*!< MCUN0GPIO199 (Bit 7)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO199_Msk (0x80UL)                 /*!< MCUN0GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO198_Pos (6UL)                    /*!< MCUN0GPIO198 (Bit 6)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO198_Msk (0x40UL)                 /*!< MCUN0GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO197_Pos (5UL)                    /*!< MCUN0GPIO197 (Bit 5)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO197_Msk (0x20UL)                 /*!< MCUN0GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO196_Pos (4UL)                    /*!< MCUN0GPIO196 (Bit 4)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO196_Msk (0x10UL)                 /*!< MCUN0GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO195_Pos (3UL)                    /*!< MCUN0GPIO195 (Bit 3)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO195_Msk (0x8UL)                  /*!< MCUN0GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO194_Pos (2UL)                    /*!< MCUN0GPIO194 (Bit 2)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO194_Msk (0x4UL)                  /*!< MCUN0GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO193_Pos (1UL)                    /*!< MCUN0GPIO193 (Bit 1)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO193_Msk (0x2UL)                  /*!< MCUN0GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO192_Pos (0UL)                    /*!< MCUN0GPIO192 (Bit 0)                                  */
#define GPIO_MCUN0INT6CLR_MCUN0GPIO192_Msk (0x1UL)                  /*!< MCUN0GPIO192 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT6SET  ====================================================== */
#define GPIO_MCUN0INT6SET_MCUN0GPIO223_Pos (31UL)                   /*!< MCUN0GPIO223 (Bit 31)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO223_Msk (0x80000000UL)           /*!< MCUN0GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO222_Pos (30UL)                   /*!< MCUN0GPIO222 (Bit 30)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO222_Msk (0x40000000UL)           /*!< MCUN0GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO221_Pos (29UL)                   /*!< MCUN0GPIO221 (Bit 29)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO221_Msk (0x20000000UL)           /*!< MCUN0GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO220_Pos (28UL)                   /*!< MCUN0GPIO220 (Bit 28)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO220_Msk (0x10000000UL)           /*!< MCUN0GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO219_Pos (27UL)                   /*!< MCUN0GPIO219 (Bit 27)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO219_Msk (0x8000000UL)            /*!< MCUN0GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO218_Pos (26UL)                   /*!< MCUN0GPIO218 (Bit 26)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO218_Msk (0x4000000UL)            /*!< MCUN0GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO217_Pos (25UL)                   /*!< MCUN0GPIO217 (Bit 25)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO217_Msk (0x2000000UL)            /*!< MCUN0GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO216_Pos (24UL)                   /*!< MCUN0GPIO216 (Bit 24)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO216_Msk (0x1000000UL)            /*!< MCUN0GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO215_Pos (23UL)                   /*!< MCUN0GPIO215 (Bit 23)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO215_Msk (0x800000UL)             /*!< MCUN0GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO214_Pos (22UL)                   /*!< MCUN0GPIO214 (Bit 22)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO214_Msk (0x400000UL)             /*!< MCUN0GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO213_Pos (21UL)                   /*!< MCUN0GPIO213 (Bit 21)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO213_Msk (0x200000UL)             /*!< MCUN0GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO212_Pos (20UL)                   /*!< MCUN0GPIO212 (Bit 20)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO212_Msk (0x100000UL)             /*!< MCUN0GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO211_Pos (19UL)                   /*!< MCUN0GPIO211 (Bit 19)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO211_Msk (0x80000UL)              /*!< MCUN0GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO210_Pos (18UL)                   /*!< MCUN0GPIO210 (Bit 18)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO210_Msk (0x40000UL)              /*!< MCUN0GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO209_Pos (17UL)                   /*!< MCUN0GPIO209 (Bit 17)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO209_Msk (0x20000UL)              /*!< MCUN0GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO208_Pos (16UL)                   /*!< MCUN0GPIO208 (Bit 16)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO208_Msk (0x10000UL)              /*!< MCUN0GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO207_Pos (15UL)                   /*!< MCUN0GPIO207 (Bit 15)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO207_Msk (0x8000UL)               /*!< MCUN0GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO206_Pos (14UL)                   /*!< MCUN0GPIO206 (Bit 14)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO206_Msk (0x4000UL)               /*!< MCUN0GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO205_Pos (13UL)                   /*!< MCUN0GPIO205 (Bit 13)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO205_Msk (0x2000UL)               /*!< MCUN0GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO204_Pos (12UL)                   /*!< MCUN0GPIO204 (Bit 12)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO204_Msk (0x1000UL)               /*!< MCUN0GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO203_Pos (11UL)                   /*!< MCUN0GPIO203 (Bit 11)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO203_Msk (0x800UL)                /*!< MCUN0GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO202_Pos (10UL)                   /*!< MCUN0GPIO202 (Bit 10)                                 */
#define GPIO_MCUN0INT6SET_MCUN0GPIO202_Msk (0x400UL)                /*!< MCUN0GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO201_Pos (9UL)                    /*!< MCUN0GPIO201 (Bit 9)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO201_Msk (0x200UL)                /*!< MCUN0GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO200_Pos (8UL)                    /*!< MCUN0GPIO200 (Bit 8)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO200_Msk (0x100UL)                /*!< MCUN0GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO199_Pos (7UL)                    /*!< MCUN0GPIO199 (Bit 7)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO199_Msk (0x80UL)                 /*!< MCUN0GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO198_Pos (6UL)                    /*!< MCUN0GPIO198 (Bit 6)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO198_Msk (0x40UL)                 /*!< MCUN0GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO197_Pos (5UL)                    /*!< MCUN0GPIO197 (Bit 5)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO197_Msk (0x20UL)                 /*!< MCUN0GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO196_Pos (4UL)                    /*!< MCUN0GPIO196 (Bit 4)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO196_Msk (0x10UL)                 /*!< MCUN0GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO195_Pos (3UL)                    /*!< MCUN0GPIO195 (Bit 3)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO195_Msk (0x8UL)                  /*!< MCUN0GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO194_Pos (2UL)                    /*!< MCUN0GPIO194 (Bit 2)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO194_Msk (0x4UL)                  /*!< MCUN0GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO193_Pos (1UL)                    /*!< MCUN0GPIO193 (Bit 1)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO193_Msk (0x2UL)                  /*!< MCUN0GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT6SET_MCUN0GPIO192_Pos (0UL)                    /*!< MCUN0GPIO192 (Bit 0)                                  */
#define GPIO_MCUN0INT6SET_MCUN0GPIO192_Msk (0x1UL)                  /*!< MCUN0GPIO192 (Bitfield-Mask: 0x01)                    */
/* ======================================================  MCUN1INT0EN  ====================================================== */
#define GPIO_MCUN1INT0EN_MCUN1GPIO31_Pos  (31UL)                    /*!< MCUN1GPIO31 (Bit 31)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO31_Msk  (0x80000000UL)            /*!< MCUN1GPIO31 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO30_Pos  (30UL)                    /*!< MCUN1GPIO30 (Bit 30)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO30_Msk  (0x40000000UL)            /*!< MCUN1GPIO30 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO29_Pos  (29UL)                    /*!< MCUN1GPIO29 (Bit 29)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO29_Msk  (0x20000000UL)            /*!< MCUN1GPIO29 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO28_Pos  (28UL)                    /*!< MCUN1GPIO28 (Bit 28)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO28_Msk  (0x10000000UL)            /*!< MCUN1GPIO28 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO27_Pos  (27UL)                    /*!< MCUN1GPIO27 (Bit 27)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO27_Msk  (0x8000000UL)             /*!< MCUN1GPIO27 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO26_Pos  (26UL)                    /*!< MCUN1GPIO26 (Bit 26)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO26_Msk  (0x4000000UL)             /*!< MCUN1GPIO26 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO25_Pos  (25UL)                    /*!< MCUN1GPIO25 (Bit 25)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO25_Msk  (0x2000000UL)             /*!< MCUN1GPIO25 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO24_Pos  (24UL)                    /*!< MCUN1GPIO24 (Bit 24)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO24_Msk  (0x1000000UL)             /*!< MCUN1GPIO24 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO23_Pos  (23UL)                    /*!< MCUN1GPIO23 (Bit 23)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO23_Msk  (0x800000UL)              /*!< MCUN1GPIO23 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO22_Pos  (22UL)                    /*!< MCUN1GPIO22 (Bit 22)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO22_Msk  (0x400000UL)              /*!< MCUN1GPIO22 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO21_Pos  (21UL)                    /*!< MCUN1GPIO21 (Bit 21)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO21_Msk  (0x200000UL)              /*!< MCUN1GPIO21 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO20_Pos  (20UL)                    /*!< MCUN1GPIO20 (Bit 20)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO20_Msk  (0x100000UL)              /*!< MCUN1GPIO20 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO19_Pos  (19UL)                    /*!< MCUN1GPIO19 (Bit 19)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO19_Msk  (0x80000UL)               /*!< MCUN1GPIO19 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO18_Pos  (18UL)                    /*!< MCUN1GPIO18 (Bit 18)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO18_Msk  (0x40000UL)               /*!< MCUN1GPIO18 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO17_Pos  (17UL)                    /*!< MCUN1GPIO17 (Bit 17)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO17_Msk  (0x20000UL)               /*!< MCUN1GPIO17 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO16_Pos  (16UL)                    /*!< MCUN1GPIO16 (Bit 16)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO16_Msk  (0x10000UL)               /*!< MCUN1GPIO16 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO15_Pos  (15UL)                    /*!< MCUN1GPIO15 (Bit 15)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO15_Msk  (0x8000UL)                /*!< MCUN1GPIO15 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO14_Pos  (14UL)                    /*!< MCUN1GPIO14 (Bit 14)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO14_Msk  (0x4000UL)                /*!< MCUN1GPIO14 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO13_Pos  (13UL)                    /*!< MCUN1GPIO13 (Bit 13)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO13_Msk  (0x2000UL)                /*!< MCUN1GPIO13 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO12_Pos  (12UL)                    /*!< MCUN1GPIO12 (Bit 12)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO12_Msk  (0x1000UL)                /*!< MCUN1GPIO12 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO11_Pos  (11UL)                    /*!< MCUN1GPIO11 (Bit 11)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO11_Msk  (0x800UL)                 /*!< MCUN1GPIO11 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO10_Pos  (10UL)                    /*!< MCUN1GPIO10 (Bit 10)                                  */
#define GPIO_MCUN1INT0EN_MCUN1GPIO10_Msk  (0x400UL)                 /*!< MCUN1GPIO10 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0EN_MCUN1GPIO9_Pos   (9UL)                     /*!< MCUN1GPIO9 (Bit 9)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO9_Msk   (0x200UL)                 /*!< MCUN1GPIO9 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO8_Pos   (8UL)                     /*!< MCUN1GPIO8 (Bit 8)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO8_Msk   (0x100UL)                 /*!< MCUN1GPIO8 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO7_Pos   (7UL)                     /*!< MCUN1GPIO7 (Bit 7)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO7_Msk   (0x80UL)                  /*!< MCUN1GPIO7 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO6_Pos   (6UL)                     /*!< MCUN1GPIO6 (Bit 6)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO6_Msk   (0x40UL)                  /*!< MCUN1GPIO6 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO5_Pos   (5UL)                     /*!< MCUN1GPIO5 (Bit 5)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO5_Msk   (0x20UL)                  /*!< MCUN1GPIO5 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO4_Pos   (4UL)                     /*!< MCUN1GPIO4 (Bit 4)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO4_Msk   (0x10UL)                  /*!< MCUN1GPIO4 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO3_Pos   (3UL)                     /*!< MCUN1GPIO3 (Bit 3)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO3_Msk   (0x8UL)                   /*!< MCUN1GPIO3 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO2_Pos   (2UL)                     /*!< MCUN1GPIO2 (Bit 2)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO2_Msk   (0x4UL)                   /*!< MCUN1GPIO2 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO1_Pos   (1UL)                     /*!< MCUN1GPIO1 (Bit 1)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO1_Msk   (0x2UL)                   /*!< MCUN1GPIO1 (Bitfield-Mask: 0x01)                      */
#define GPIO_MCUN1INT0EN_MCUN1GPIO0_Pos   (0UL)                     /*!< MCUN1GPIO0 (Bit 0)                                    */
#define GPIO_MCUN1INT0EN_MCUN1GPIO0_Msk   (0x1UL)                   /*!< MCUN1GPIO0 (Bitfield-Mask: 0x01)                      */
/* =====================================================  MCUN1INT0STAT  ===================================================== */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO31_Pos (31UL)                   /*!< MCUN1GPIO31 (Bit 31)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO31_Msk (0x80000000UL)           /*!< MCUN1GPIO31 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO30_Pos (30UL)                   /*!< MCUN1GPIO30 (Bit 30)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO30_Msk (0x40000000UL)           /*!< MCUN1GPIO30 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO29_Pos (29UL)                   /*!< MCUN1GPIO29 (Bit 29)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO29_Msk (0x20000000UL)           /*!< MCUN1GPIO29 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO28_Pos (28UL)                   /*!< MCUN1GPIO28 (Bit 28)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO28_Msk (0x10000000UL)           /*!< MCUN1GPIO28 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO27_Pos (27UL)                   /*!< MCUN1GPIO27 (Bit 27)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO27_Msk (0x8000000UL)            /*!< MCUN1GPIO27 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO26_Pos (26UL)                   /*!< MCUN1GPIO26 (Bit 26)                                  */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO26_Msk (0x4000000UL)            /*!< MCUN1GPIO26 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT0STAT_MCUN1GPIO25_Pos (25UL)                   /*!< MCUN1GPIO25 (Bit 25)                                  */
