zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_MCUN1INT3SET_MCUN1GPIO116_Msk (0x100000UL)             /*!< MCUN1GPIO116 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO115_Pos (19UL)                   /*!< MCUN1GPIO115 (Bit 19)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO115_Msk (0x80000UL)              /*!< MCUN1GPIO115 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO114_Pos (18UL)                   /*!< MCUN1GPIO114 (Bit 18)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO114_Msk (0x40000UL)              /*!< MCUN1GPIO114 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO113_Pos (17UL)                   /*!< MCUN1GPIO113 (Bit 17)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO113_Msk (0x20000UL)              /*!< MCUN1GPIO113 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO112_Pos (16UL)                   /*!< MCUN1GPIO112 (Bit 16)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO112_Msk (0x10000UL)              /*!< MCUN1GPIO112 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO111_Pos (15UL)                   /*!< MCUN1GPIO111 (Bit 15)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO111_Msk (0x8000UL)               /*!< MCUN1GPIO111 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO110_Pos (14UL)                   /*!< MCUN1GPIO110 (Bit 14)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO110_Msk (0x4000UL)               /*!< MCUN1GPIO110 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO109_Pos (13UL)                   /*!< MCUN1GPIO109 (Bit 13)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO109_Msk (0x2000UL)               /*!< MCUN1GPIO109 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO108_Pos (12UL)                   /*!< MCUN1GPIO108 (Bit 12)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO108_Msk (0x1000UL)               /*!< MCUN1GPIO108 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO107_Pos (11UL)                   /*!< MCUN1GPIO107 (Bit 11)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO107_Msk (0x800UL)                /*!< MCUN1GPIO107 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO106_Pos (10UL)                   /*!< MCUN1GPIO106 (Bit 10)                                 */
#define GPIO_MCUN1INT3SET_MCUN1GPIO106_Msk (0x400UL)                /*!< MCUN1GPIO106 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO105_Pos (9UL)                    /*!< MCUN1GPIO105 (Bit 9)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO105_Msk (0x200UL)                /*!< MCUN1GPIO105 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO104_Pos (8UL)                    /*!< MCUN1GPIO104 (Bit 8)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO104_Msk (0x100UL)                /*!< MCUN1GPIO104 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO103_Pos (7UL)                    /*!< MCUN1GPIO103 (Bit 7)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO103_Msk (0x80UL)                 /*!< MCUN1GPIO103 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO102_Pos (6UL)                    /*!< MCUN1GPIO102 (Bit 6)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO102_Msk (0x40UL)                 /*!< MCUN1GPIO102 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO101_Pos (5UL)                    /*!< MCUN1GPIO101 (Bit 5)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO101_Msk (0x20UL)                 /*!< MCUN1GPIO101 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO100_Pos (4UL)                    /*!< MCUN1GPIO100 (Bit 4)                                  */
#define GPIO_MCUN1INT3SET_MCUN1GPIO100_Msk (0x10UL)                 /*!< MCUN1GPIO100 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT3SET_MCUN1GPIO99_Pos (3UL)                     /*!< MCUN1GPIO99 (Bit 3)                                   */
#define GPIO_MCUN1INT3SET_MCUN1GPIO99_Msk (0x8UL)                   /*!< MCUN1GPIO99 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT3SET_MCUN1GPIO98_Pos (2UL)                     /*!< MCUN1GPIO98 (Bit 2)                                   */
#define GPIO_MCUN1INT3SET_MCUN1GPIO98_Msk (0x4UL)                   /*!< MCUN1GPIO98 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT3SET_MCUN1GPIO97_Pos (1UL)                     /*!< MCUN1GPIO97 (Bit 1)                                   */
#define GPIO_MCUN1INT3SET_MCUN1GPIO97_Msk (0x2UL)                   /*!< MCUN1GPIO97 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN1INT3SET_MCUN1GPIO96_Pos (0UL)                     /*!< MCUN1GPIO96 (Bit 0)                                   */
#define GPIO_MCUN1INT3SET_MCUN1GPIO96_Msk (0x1UL)                   /*!< MCUN1GPIO96 (Bitfield-Mask: 0x01)                     */
/* ======================================================  MCUN1INT4EN  ====================================================== */
#define GPIO_MCUN1INT4EN_MCUN1GPIO159_Pos (31UL)                    /*!< MCUN1GPIO159 (Bit 31)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO159_Msk (0x80000000UL)            /*!< MCUN1GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO158_Pos (30UL)                    /*!< MCUN1GPIO158 (Bit 30)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO158_Msk (0x40000000UL)            /*!< MCUN1GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO157_Pos (29UL)                    /*!< MCUN1GPIO157 (Bit 29)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO157_Msk (0x20000000UL)            /*!< MCUN1GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO156_Pos (28UL)                    /*!< MCUN1GPIO156 (Bit 28)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO156_Msk (0x10000000UL)            /*!< MCUN1GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO155_Pos (27UL)                    /*!< MCUN1GPIO155 (Bit 27)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO155_Msk (0x8000000UL)             /*!< MCUN1GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO154_Pos (26UL)                    /*!< MCUN1GPIO154 (Bit 26)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO154_Msk (0x4000000UL)             /*!< MCUN1GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO153_Pos (25UL)                    /*!< MCUN1GPIO153 (Bit 25)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO153_Msk (0x2000000UL)             /*!< MCUN1GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO152_Pos (24UL)                    /*!< MCUN1GPIO152 (Bit 24)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO152_Msk (0x1000000UL)             /*!< MCUN1GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO151_Pos (23UL)                    /*!< MCUN1GPIO151 (Bit 23)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO151_Msk (0x800000UL)              /*!< MCUN1GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO150_Pos (22UL)                    /*!< MCUN1GPIO150 (Bit 22)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO150_Msk (0x400000UL)              /*!< MCUN1GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO149_Pos (21UL)                    /*!< MCUN1GPIO149 (Bit 21)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO149_Msk (0x200000UL)              /*!< MCUN1GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO148_Pos (20UL)                    /*!< MCUN1GPIO148 (Bit 20)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO148_Msk (0x100000UL)              /*!< MCUN1GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO147_Pos (19UL)                    /*!< MCUN1GPIO147 (Bit 19)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO147_Msk (0x80000UL)               /*!< MCUN1GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO146_Pos (18UL)                    /*!< MCUN1GPIO146 (Bit 18)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO146_Msk (0x40000UL)               /*!< MCUN1GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO145_Pos (17UL)                    /*!< MCUN1GPIO145 (Bit 17)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO145_Msk (0x20000UL)               /*!< MCUN1GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO144_Pos (16UL)                    /*!< MCUN1GPIO144 (Bit 16)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO144_Msk (0x10000UL)               /*!< MCUN1GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO143_Pos (15UL)                    /*!< MCUN1GPIO143 (Bit 15)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO143_Msk (0x8000UL)                /*!< MCUN1GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO142_Pos (14UL)                    /*!< MCUN1GPIO142 (Bit 14)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO142_Msk (0x4000UL)                /*!< MCUN1GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO141_Pos (13UL)                    /*!< MCUN1GPIO141 (Bit 13)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO141_Msk (0x2000UL)                /*!< MCUN1GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO140_Pos (12UL)                    /*!< MCUN1GPIO140 (Bit 12)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO140_Msk (0x1000UL)                /*!< MCUN1GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO139_Pos (11UL)                    /*!< MCUN1GPIO139 (Bit 11)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO139_Msk (0x800UL)                 /*!< MCUN1GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO138_Pos (10UL)                    /*!< MCUN1GPIO138 (Bit 10)                                 */
#define GPIO_MCUN1INT4EN_MCUN1GPIO138_Msk (0x400UL)                 /*!< MCUN1GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO137_Pos (9UL)                     /*!< MCUN1GPIO137 (Bit 9)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO137_Msk (0x200UL)                 /*!< MCUN1GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO136_Pos (8UL)                     /*!< MCUN1GPIO136 (Bit 8)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO136_Msk (0x100UL)                 /*!< MCUN1GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO135_Pos (7UL)                     /*!< MCUN1GPIO135 (Bit 7)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO135_Msk (0x80UL)                  /*!< MCUN1GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO134_Pos (6UL)                     /*!< MCUN1GPIO134 (Bit 6)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO134_Msk (0x40UL)                  /*!< MCUN1GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO133_Pos (5UL)                     /*!< MCUN1GPIO133 (Bit 5)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO133_Msk (0x20UL)                  /*!< MCUN1GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO132_Pos (4UL)                     /*!< MCUN1GPIO132 (Bit 4)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO132_Msk (0x10UL)                  /*!< MCUN1GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO131_Pos (3UL)                     /*!< MCUN1GPIO131 (Bit 3)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO131_Msk (0x8UL)                   /*!< MCUN1GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO130_Pos (2UL)                     /*!< MCUN1GPIO130 (Bit 2)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO130_Msk (0x4UL)                   /*!< MCUN1GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO129_Pos (1UL)                     /*!< MCUN1GPIO129 (Bit 1)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO129_Msk (0x2UL)                   /*!< MCUN1GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4EN_MCUN1GPIO128_Pos (0UL)                     /*!< MCUN1GPIO128 (Bit 0)                                  */
#define GPIO_MCUN1INT4EN_MCUN1GPIO128_Msk (0x1UL)                   /*!< MCUN1GPIO128 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT4STAT  ===================================================== */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO159_Pos (31UL)                  /*!< MCUN1GPIO159 (Bit 31)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO159_Msk (0x80000000UL)          /*!< MCUN1GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO158_Pos (30UL)                  /*!< MCUN1GPIO158 (Bit 30)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO158_Msk (0x40000000UL)          /*!< MCUN1GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO157_Pos (29UL)                  /*!< MCUN1GPIO157 (Bit 29)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO157_Msk (0x20000000UL)          /*!< MCUN1GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO156_Pos (28UL)                  /*!< MCUN1GPIO156 (Bit 28)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO156_Msk (0x10000000UL)          /*!< MCUN1GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO155_Pos (27UL)                  /*!< MCUN1GPIO155 (Bit 27)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO155_Msk (0x8000000UL)           /*!< MCUN1GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO154_Pos (26UL)                  /*!< MCUN1GPIO154 (Bit 26)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO154_Msk (0x4000000UL)           /*!< MCUN1GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO153_Pos (25UL)                  /*!< MCUN1GPIO153 (Bit 25)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO153_Msk (0x2000000UL)           /*!< MCUN1GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO152_Pos (24UL)                  /*!< MCUN1GPIO152 (Bit 24)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO152_Msk (0x1000000UL)           /*!< MCUN1GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO151_Pos (23UL)                  /*!< MCUN1GPIO151 (Bit 23)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO151_Msk (0x800000UL)            /*!< MCUN1GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO150_Pos (22UL)                  /*!< MCUN1GPIO150 (Bit 22)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO150_Msk (0x400000UL)            /*!< MCUN1GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO149_Pos (21UL)                  /*!< MCUN1GPIO149 (Bit 21)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO149_Msk (0x200000UL)            /*!< MCUN1GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO148_Pos (20UL)                  /*!< MCUN1GPIO148 (Bit 20)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO148_Msk (0x100000UL)            /*!< MCUN1GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO147_Pos (19UL)                  /*!< MCUN1GPIO147 (Bit 19)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO147_Msk (0x80000UL)             /*!< MCUN1GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO146_Pos (18UL)                  /*!< MCUN1GPIO146 (Bit 18)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO146_Msk (0x40000UL)             /*!< MCUN1GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO145_Pos (17UL)                  /*!< MCUN1GPIO145 (Bit 17)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO145_Msk (0x20000UL)             /*!< MCUN1GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO144_Pos (16UL)                  /*!< MCUN1GPIO144 (Bit 16)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO144_Msk (0x10000UL)             /*!< MCUN1GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO143_Pos (15UL)                  /*!< MCUN1GPIO143 (Bit 15)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO143_Msk (0x8000UL)              /*!< MCUN1GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO142_Pos (14UL)                  /*!< MCUN1GPIO142 (Bit 14)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO142_Msk (0x4000UL)              /*!< MCUN1GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO141_Pos (13UL)                  /*!< MCUN1GPIO141 (Bit 13)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO141_Msk (0x2000UL)              /*!< MCUN1GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO140_Pos (12UL)                  /*!< MCUN1GPIO140 (Bit 12)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO140_Msk (0x1000UL)              /*!< MCUN1GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO139_Pos (11UL)                  /*!< MCUN1GPIO139 (Bit 11)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO139_Msk (0x800UL)               /*!< MCUN1GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO138_Pos (10UL)                  /*!< MCUN1GPIO138 (Bit 10)                                 */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO138_Msk (0x400UL)               /*!< MCUN1GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO137_Pos (9UL)                   /*!< MCUN1GPIO137 (Bit 9)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO137_Msk (0x200UL)               /*!< MCUN1GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO136_Pos (8UL)                   /*!< MCUN1GPIO136 (Bit 8)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO136_Msk (0x100UL)               /*!< MCUN1GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO135_Pos (7UL)                   /*!< MCUN1GPIO135 (Bit 7)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO135_Msk (0x80UL)                /*!< MCUN1GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO134_Pos (6UL)                   /*!< MCUN1GPIO134 (Bit 6)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO134_Msk (0x40UL)                /*!< MCUN1GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO133_Pos (5UL)                   /*!< MCUN1GPIO133 (Bit 5)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO133_Msk (0x20UL)                /*!< MCUN1GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO132_Pos (4UL)                   /*!< MCUN1GPIO132 (Bit 4)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO132_Msk (0x10UL)                /*!< MCUN1GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO131_Pos (3UL)                   /*!< MCUN1GPIO131 (Bit 3)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO131_Msk (0x8UL)                 /*!< MCUN1GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO130_Pos (2UL)                   /*!< MCUN1GPIO130 (Bit 2)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO130_Msk (0x4UL)                 /*!< MCUN1GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO129_Pos (1UL)                   /*!< MCUN1GPIO129 (Bit 1)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO129_Msk (0x2UL)                 /*!< MCUN1GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO128_Pos (0UL)                   /*!< MCUN1GPIO128 (Bit 0)                                  */
#define GPIO_MCUN1INT4STAT_MCUN1GPIO128_Msk (0x1UL)                 /*!< MCUN1GPIO128 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT4CLR  ====================================================== */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO159_Pos (31UL)                   /*!< MCUN1GPIO159 (Bit 31)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO159_Msk (0x80000000UL)           /*!< MCUN1GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO158_Pos (30UL)                   /*!< MCUN1GPIO158 (Bit 30)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO158_Msk (0x40000000UL)           /*!< MCUN1GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO157_Pos (29UL)                   /*!< MCUN1GPIO157 (Bit 29)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO157_Msk (0x20000000UL)           /*!< MCUN1GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO156_Pos (28UL)                   /*!< MCUN1GPIO156 (Bit 28)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO156_Msk (0x10000000UL)           /*!< MCUN1GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO155_Pos (27UL)                   /*!< MCUN1GPIO155 (Bit 27)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO155_Msk (0x8000000UL)            /*!< MCUN1GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO154_Pos (26UL)                   /*!< MCUN1GPIO154 (Bit 26)                                 */
#define GPIO_MCUN1INT4CLR_MCUN1GPIO154_Msk (0x4000000UL)            /*!< MCUN1GPIO154 (Bitfield-Mask: 0x01)                    */
