zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define GPIO_MCUN1INT5STAT_MCUN1GPIO191_Msk (0x80000000UL)          /*!< MCUN1GPIO191 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO190_Pos (30UL)                  /*!< MCUN1GPIO190 (Bit 30)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO190_Msk (0x40000000UL)          /*!< MCUN1GPIO190 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO189_Pos (29UL)                  /*!< MCUN1GPIO189 (Bit 29)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO189_Msk (0x20000000UL)          /*!< MCUN1GPIO189 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO188_Pos (28UL)                  /*!< MCUN1GPIO188 (Bit 28)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO188_Msk (0x10000000UL)          /*!< MCUN1GPIO188 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO187_Pos (27UL)                  /*!< MCUN1GPIO187 (Bit 27)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO187_Msk (0x8000000UL)           /*!< MCUN1GPIO187 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO186_Pos (26UL)                  /*!< MCUN1GPIO186 (Bit 26)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO186_Msk (0x4000000UL)           /*!< MCUN1GPIO186 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO185_Pos (25UL)                  /*!< MCUN1GPIO185 (Bit 25)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO185_Msk (0x2000000UL)           /*!< MCUN1GPIO185 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO184_Pos (24UL)                  /*!< MCUN1GPIO184 (Bit 24)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO184_Msk (0x1000000UL)           /*!< MCUN1GPIO184 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO183_Pos (23UL)                  /*!< MCUN1GPIO183 (Bit 23)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO183_Msk (0x800000UL)            /*!< MCUN1GPIO183 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO182_Pos (22UL)                  /*!< MCUN1GPIO182 (Bit 22)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO182_Msk (0x400000UL)            /*!< MCUN1GPIO182 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO181_Pos (21UL)                  /*!< MCUN1GPIO181 (Bit 21)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO181_Msk (0x200000UL)            /*!< MCUN1GPIO181 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO180_Pos (20UL)                  /*!< MCUN1GPIO180 (Bit 20)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO180_Msk (0x100000UL)            /*!< MCUN1GPIO180 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO179_Pos (19UL)                  /*!< MCUN1GPIO179 (Bit 19)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO179_Msk (0x80000UL)             /*!< MCUN1GPIO179 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO178_Pos (18UL)                  /*!< MCUN1GPIO178 (Bit 18)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO178_Msk (0x40000UL)             /*!< MCUN1GPIO178 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO177_Pos (17UL)                  /*!< MCUN1GPIO177 (Bit 17)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO177_Msk (0x20000UL)             /*!< MCUN1GPIO177 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO176_Pos (16UL)                  /*!< MCUN1GPIO176 (Bit 16)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO176_Msk (0x10000UL)             /*!< MCUN1GPIO176 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO175_Pos (15UL)                  /*!< MCUN1GPIO175 (Bit 15)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO175_Msk (0x8000UL)              /*!< MCUN1GPIO175 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO174_Pos (14UL)                  /*!< MCUN1GPIO174 (Bit 14)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO174_Msk (0x4000UL)              /*!< MCUN1GPIO174 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO173_Pos (13UL)                  /*!< MCUN1GPIO173 (Bit 13)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO173_Msk (0x2000UL)              /*!< MCUN1GPIO173 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO172_Pos (12UL)                  /*!< MCUN1GPIO172 (Bit 12)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO172_Msk (0x1000UL)              /*!< MCUN1GPIO172 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO171_Pos (11UL)                  /*!< MCUN1GPIO171 (Bit 11)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO171_Msk (0x800UL)               /*!< MCUN1GPIO171 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO170_Pos (10UL)                  /*!< MCUN1GPIO170 (Bit 10)                                 */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO170_Msk (0x400UL)               /*!< MCUN1GPIO170 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO169_Pos (9UL)                   /*!< MCUN1GPIO169 (Bit 9)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO169_Msk (0x200UL)               /*!< MCUN1GPIO169 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO168_Pos (8UL)                   /*!< MCUN1GPIO168 (Bit 8)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO168_Msk (0x100UL)               /*!< MCUN1GPIO168 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO167_Pos (7UL)                   /*!< MCUN1GPIO167 (Bit 7)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO167_Msk (0x80UL)                /*!< MCUN1GPIO167 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO166_Pos (6UL)                   /*!< MCUN1GPIO166 (Bit 6)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO166_Msk (0x40UL)                /*!< MCUN1GPIO166 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO165_Pos (5UL)                   /*!< MCUN1GPIO165 (Bit 5)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO165_Msk (0x20UL)                /*!< MCUN1GPIO165 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO164_Pos (4UL)                   /*!< MCUN1GPIO164 (Bit 4)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO164_Msk (0x10UL)                /*!< MCUN1GPIO164 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO163_Pos (3UL)                   /*!< MCUN1GPIO163 (Bit 3)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO163_Msk (0x8UL)                 /*!< MCUN1GPIO163 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO162_Pos (2UL)                   /*!< MCUN1GPIO162 (Bit 2)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO162_Msk (0x4UL)                 /*!< MCUN1GPIO162 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO161_Pos (1UL)                   /*!< MCUN1GPIO161 (Bit 1)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO161_Msk (0x2UL)                 /*!< MCUN1GPIO161 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO160_Pos (0UL)                   /*!< MCUN1GPIO160 (Bit 0)                                  */
#define GPIO_MCUN1INT5STAT_MCUN1GPIO160_Msk (0x1UL)                 /*!< MCUN1GPIO160 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT5CLR  ====================================================== */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO191_Pos (31UL)                   /*!< MCUN1GPIO191 (Bit 31)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO191_Msk (0x80000000UL)           /*!< MCUN1GPIO191 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO190_Pos (30UL)                   /*!< MCUN1GPIO190 (Bit 30)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO190_Msk (0x40000000UL)           /*!< MCUN1GPIO190 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO189_Pos (29UL)                   /*!< MCUN1GPIO189 (Bit 29)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO189_Msk (0x20000000UL)           /*!< MCUN1GPIO189 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO188_Pos (28UL)                   /*!< MCUN1GPIO188 (Bit 28)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO188_Msk (0x10000000UL)           /*!< MCUN1GPIO188 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO187_Pos (27UL)                   /*!< MCUN1GPIO187 (Bit 27)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO187_Msk (0x8000000UL)            /*!< MCUN1GPIO187 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO186_Pos (26UL)                   /*!< MCUN1GPIO186 (Bit 26)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO186_Msk (0x4000000UL)            /*!< MCUN1GPIO186 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO185_Pos (25UL)                   /*!< MCUN1GPIO185 (Bit 25)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO185_Msk (0x2000000UL)            /*!< MCUN1GPIO185 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO184_Pos (24UL)                   /*!< MCUN1GPIO184 (Bit 24)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO184_Msk (0x1000000UL)            /*!< MCUN1GPIO184 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO183_Pos (23UL)                   /*!< MCUN1GPIO183 (Bit 23)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO183_Msk (0x800000UL)             /*!< MCUN1GPIO183 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO182_Pos (22UL)                   /*!< MCUN1GPIO182 (Bit 22)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO182_Msk (0x400000UL)             /*!< MCUN1GPIO182 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO181_Pos (21UL)                   /*!< MCUN1GPIO181 (Bit 21)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO181_Msk (0x200000UL)             /*!< MCUN1GPIO181 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO180_Pos (20UL)                   /*!< MCUN1GPIO180 (Bit 20)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO180_Msk (0x100000UL)             /*!< MCUN1GPIO180 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO179_Pos (19UL)                   /*!< MCUN1GPIO179 (Bit 19)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO179_Msk (0x80000UL)              /*!< MCUN1GPIO179 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO178_Pos (18UL)                   /*!< MCUN1GPIO178 (Bit 18)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO178_Msk (0x40000UL)              /*!< MCUN1GPIO178 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO177_Pos (17UL)                   /*!< MCUN1GPIO177 (Bit 17)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO177_Msk (0x20000UL)              /*!< MCUN1GPIO177 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO176_Pos (16UL)                   /*!< MCUN1GPIO176 (Bit 16)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO176_Msk (0x10000UL)              /*!< MCUN1GPIO176 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO175_Pos (15UL)                   /*!< MCUN1GPIO175 (Bit 15)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO175_Msk (0x8000UL)               /*!< MCUN1GPIO175 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO174_Pos (14UL)                   /*!< MCUN1GPIO174 (Bit 14)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO174_Msk (0x4000UL)               /*!< MCUN1GPIO174 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO173_Pos (13UL)                   /*!< MCUN1GPIO173 (Bit 13)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO173_Msk (0x2000UL)               /*!< MCUN1GPIO173 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO172_Pos (12UL)                   /*!< MCUN1GPIO172 (Bit 12)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO172_Msk (0x1000UL)               /*!< MCUN1GPIO172 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO171_Pos (11UL)                   /*!< MCUN1GPIO171 (Bit 11)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO171_Msk (0x800UL)                /*!< MCUN1GPIO171 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO170_Pos (10UL)                   /*!< MCUN1GPIO170 (Bit 10)                                 */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO170_Msk (0x400UL)                /*!< MCUN1GPIO170 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO169_Pos (9UL)                    /*!< MCUN1GPIO169 (Bit 9)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO169_Msk (0x200UL)                /*!< MCUN1GPIO169 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO168_Pos (8UL)                    /*!< MCUN1GPIO168 (Bit 8)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO168_Msk (0x100UL)                /*!< MCUN1GPIO168 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO167_Pos (7UL)                    /*!< MCUN1GPIO167 (Bit 7)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO167_Msk (0x80UL)                 /*!< MCUN1GPIO167 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO166_Pos (6UL)                    /*!< MCUN1GPIO166 (Bit 6)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO166_Msk (0x40UL)                 /*!< MCUN1GPIO166 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO165_Pos (5UL)                    /*!< MCUN1GPIO165 (Bit 5)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO165_Msk (0x20UL)                 /*!< MCUN1GPIO165 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO164_Pos (4UL)                    /*!< MCUN1GPIO164 (Bit 4)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO164_Msk (0x10UL)                 /*!< MCUN1GPIO164 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO163_Pos (3UL)                    /*!< MCUN1GPIO163 (Bit 3)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO163_Msk (0x8UL)                  /*!< MCUN1GPIO163 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO162_Pos (2UL)                    /*!< MCUN1GPIO162 (Bit 2)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO162_Msk (0x4UL)                  /*!< MCUN1GPIO162 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO161_Pos (1UL)                    /*!< MCUN1GPIO161 (Bit 1)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO161_Msk (0x2UL)                  /*!< MCUN1GPIO161 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO160_Pos (0UL)                    /*!< MCUN1GPIO160 (Bit 0)                                  */
#define GPIO_MCUN1INT5CLR_MCUN1GPIO160_Msk (0x1UL)                  /*!< MCUN1GPIO160 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT5SET  ====================================================== */
#define GPIO_MCUN1INT5SET_MCUN1GPIO191_Pos (31UL)                   /*!< MCUN1GPIO191 (Bit 31)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO191_Msk (0x80000000UL)           /*!< MCUN1GPIO191 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO190_Pos (30UL)                   /*!< MCUN1GPIO190 (Bit 30)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO190_Msk (0x40000000UL)           /*!< MCUN1GPIO190 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO189_Pos (29UL)                   /*!< MCUN1GPIO189 (Bit 29)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO189_Msk (0x20000000UL)           /*!< MCUN1GPIO189 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO188_Pos (28UL)                   /*!< MCUN1GPIO188 (Bit 28)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO188_Msk (0x10000000UL)           /*!< MCUN1GPIO188 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO187_Pos (27UL)                   /*!< MCUN1GPIO187 (Bit 27)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO187_Msk (0x8000000UL)            /*!< MCUN1GPIO187 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO186_Pos (26UL)                   /*!< MCUN1GPIO186 (Bit 26)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO186_Msk (0x4000000UL)            /*!< MCUN1GPIO186 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO185_Pos (25UL)                   /*!< MCUN1GPIO185 (Bit 25)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO185_Msk (0x2000000UL)            /*!< MCUN1GPIO185 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO184_Pos (24UL)                   /*!< MCUN1GPIO184 (Bit 24)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO184_Msk (0x1000000UL)            /*!< MCUN1GPIO184 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO183_Pos (23UL)                   /*!< MCUN1GPIO183 (Bit 23)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO183_Msk (0x800000UL)             /*!< MCUN1GPIO183 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO182_Pos (22UL)                   /*!< MCUN1GPIO182 (Bit 22)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO182_Msk (0x400000UL)             /*!< MCUN1GPIO182 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO181_Pos (21UL)                   /*!< MCUN1GPIO181 (Bit 21)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO181_Msk (0x200000UL)             /*!< MCUN1GPIO181 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO180_Pos (20UL)                   /*!< MCUN1GPIO180 (Bit 20)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO180_Msk (0x100000UL)             /*!< MCUN1GPIO180 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO179_Pos (19UL)                   /*!< MCUN1GPIO179 (Bit 19)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO179_Msk (0x80000UL)              /*!< MCUN1GPIO179 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO178_Pos (18UL)                   /*!< MCUN1GPIO178 (Bit 18)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO178_Msk (0x40000UL)              /*!< MCUN1GPIO178 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO177_Pos (17UL)                   /*!< MCUN1GPIO177 (Bit 17)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO177_Msk (0x20000UL)              /*!< MCUN1GPIO177 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO176_Pos (16UL)                   /*!< MCUN1GPIO176 (Bit 16)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO176_Msk (0x10000UL)              /*!< MCUN1GPIO176 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO175_Pos (15UL)                   /*!< MCUN1GPIO175 (Bit 15)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO175_Msk (0x8000UL)               /*!< MCUN1GPIO175 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO174_Pos (14UL)                   /*!< MCUN1GPIO174 (Bit 14)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO174_Msk (0x4000UL)               /*!< MCUN1GPIO174 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO173_Pos (13UL)                   /*!< MCUN1GPIO173 (Bit 13)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO173_Msk (0x2000UL)               /*!< MCUN1GPIO173 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO172_Pos (12UL)                   /*!< MCUN1GPIO172 (Bit 12)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO172_Msk (0x1000UL)               /*!< MCUN1GPIO172 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO171_Pos (11UL)                   /*!< MCUN1GPIO171 (Bit 11)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO171_Msk (0x800UL)                /*!< MCUN1GPIO171 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO170_Pos (10UL)                   /*!< MCUN1GPIO170 (Bit 10)                                 */
#define GPIO_MCUN1INT5SET_MCUN1GPIO170_Msk (0x400UL)                /*!< MCUN1GPIO170 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO169_Pos (9UL)                    /*!< MCUN1GPIO169 (Bit 9)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO169_Msk (0x200UL)                /*!< MCUN1GPIO169 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO168_Pos (8UL)                    /*!< MCUN1GPIO168 (Bit 8)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO168_Msk (0x100UL)                /*!< MCUN1GPIO168 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO167_Pos (7UL)                    /*!< MCUN1GPIO167 (Bit 7)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO167_Msk (0x80UL)                 /*!< MCUN1GPIO167 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO166_Pos (6UL)                    /*!< MCUN1GPIO166 (Bit 6)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO166_Msk (0x40UL)                 /*!< MCUN1GPIO166 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO165_Pos (5UL)                    /*!< MCUN1GPIO165 (Bit 5)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO165_Msk (0x20UL)                 /*!< MCUN1GPIO165 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO164_Pos (4UL)                    /*!< MCUN1GPIO164 (Bit 4)                                  */
