zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ========================================================  CHIPPN  ========================================================= */
#define MCUCTRL_CHIPPN_PN_Pos             (24UL)                    /*!< PN (Bit 24)                                           */
#define MCUCTRL_CHIPPN_PN_Msk             (0xff000000UL)            /*!< PN (Bitfield-Mask: 0xff)                              */
#define MCUCTRL_CHIPPN_MRAMSIZE_Pos       (20UL)                    /*!< MRAMSIZE (Bit 20)                                     */
#define MCUCTRL_CHIPPN_MRAMSIZE_Msk       (0xf00000UL)              /*!< MRAMSIZE (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_CHIPPN_SRAMSIZE_Pos       (16UL)                    /*!< SRAMSIZE (Bit 16)                                     */
#define MCUCTRL_CHIPPN_SRAMSIZE_Msk       (0xf0000UL)               /*!< SRAMSIZE (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_CHIPPN_REVMAJ_Pos         (12UL)                    /*!< REVMAJ (Bit 12)                                       */
#define MCUCTRL_CHIPPN_REVMAJ_Msk         (0xf000UL)                /*!< REVMAJ (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPPN_REVMIN_Pos         (8UL)                     /*!< REVMIN (Bit 8)                                        */
#define MCUCTRL_CHIPPN_REVMIN_Msk         (0xf00UL)                 /*!< REVMIN (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPPN_PKG_Pos            (6UL)                     /*!< PKG (Bit 6)                                           */
#define MCUCTRL_CHIPPN_PKG_Msk            (0xc0UL)                  /*!< PKG (Bitfield-Mask: 0x03)                             */
#define MCUCTRL_CHIPPN_PINS_Pos           (3UL)                     /*!< PINS (Bit 3)                                          */
#define MCUCTRL_CHIPPN_PINS_Msk           (0x38UL)                  /*!< PINS (Bitfield-Mask: 0x07)                            */
#define MCUCTRL_CHIPPN_TEMP_Pos           (1UL)                     /*!< TEMP (Bit 1)                                          */
#define MCUCTRL_CHIPPN_TEMP_Msk           (0x6UL)                   /*!< TEMP (Bitfield-Mask: 0x03)                            */
#define MCUCTRL_CHIPPN_RSVD_Pos           (0UL)                     /*!< RSVD (Bit 0)                                          */
#define MCUCTRL_CHIPPN_RSVD_Msk           (0x1UL)                   /*!< RSVD (Bitfield-Mask: 0x01)                            */
/* ========================================================  CHIPID0  ======================================================== */
#define MCUCTRL_CHIPID0_CHIPID0_Pos       (0UL)                     /*!< CHIPID0 (Bit 0)                                       */
#define MCUCTRL_CHIPID0_CHIPID0_Msk       (0xffffffffUL)            /*!< CHIPID0 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPID1  ======================================================== */
#define MCUCTRL_CHIPID1_CHIPID1_Pos       (0UL)                     /*!< CHIPID1 (Bit 0)                                       */
#define MCUCTRL_CHIPID1_CHIPID1_Msk       (0xffffffffUL)            /*!< CHIPID1 (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  CHIPREV  ======================================================== */
#define MCUCTRL_CHIPREV_SIPART_Pos        (8UL)                     /*!< SIPART (Bit 8)                                        */
#define MCUCTRL_CHIPREV_SIPART_Msk        (0xfff00UL)               /*!< SIPART (Bitfield-Mask: 0xfff)                         */
#define MCUCTRL_CHIPREV_REVMAJ_Pos        (4UL)                     /*!< REVMAJ (Bit 4)                                        */
#define MCUCTRL_CHIPREV_REVMAJ_Msk        (0xf0UL)                  /*!< REVMAJ (Bitfield-Mask: 0x0f)                          */
#define MCUCTRL_CHIPREV_REVMIN_Pos        (0UL)                     /*!< REVMIN (Bit 0)                                        */
#define MCUCTRL_CHIPREV_REVMIN_Msk        (0xfUL)                   /*!< REVMIN (Bitfield-Mask: 0x0f)                          */
/* =======================================================  VENDORID  ======================================================== */
#define MCUCTRL_VENDORID_VENDORID_Pos     (0UL)                     /*!< VENDORID (Bit 0)                                      */
#define MCUCTRL_VENDORID_VENDORID_Msk     (0xffffffffUL)            /*!< VENDORID (Bitfield-Mask: 0xffffffff)                  */
/* ==========================================================  SKU  ========================================================== */
#define MCUCTRL_SKU_SKUMVE_Pos            (20UL)                    /*!< SKUMVE (Bit 20)                                       */
#define MCUCTRL_SKU_SKUMVE_Msk            (0x300000UL)              /*!< SKUMVE (Bitfield-Mask: 0x03)                          */
#define MCUCTRL_SKU_SKUFPU_Pos            (19UL)                    /*!< SKUFPU (Bit 19)                                       */
#define MCUCTRL_SKU_SKUFPU_Msk            (0x80000UL)               /*!< SKUFPU (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUDTCM_Pos           (15UL)                    /*!< SKUDTCM (Bit 15)                                      */
#define MCUCTRL_SKU_SKUDTCM_Msk           (0x78000UL)               /*!< SKUDTCM (Bitfield-Mask: 0x0f)                         */
#define MCUCTRL_SKU_SKUITCM_Pos           (11UL)                    /*!< SKUITCM (Bit 11)                                      */
#define MCUCTRL_SKU_SKUITCM_Msk           (0x7800UL)                /*!< SKUITCM (Bitfield-Mask: 0x0f)                         */
#define MCUCTRL_SKU_SKUSECURESPOT_Pos     (10UL)                    /*!< SKUSECURESPOT (Bit 10)                                */
#define MCUCTRL_SKU_SKUSECURESPOT_Msk     (0x400UL)                 /*!< SKUSECURESPOT (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SKU_SKUUSB_Pos            (9UL)                     /*!< SKUUSB (Bit 9)                                        */
#define MCUCTRL_SKU_SKUUSB_Msk            (0x200UL)                 /*!< SKUUSB (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUGFX_Pos            (8UL)                     /*!< SKUGFX (Bit 8)                                        */
#define MCUCTRL_SKU_SKUGFX_Msk            (0x100UL)                 /*!< SKUGFX (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKU_SKUMIPIDSI_Pos        (7UL)                     /*!< SKUMIPIDSI (Bit 7)                                    */
#define MCUCTRL_SKU_SKUMIPIDSI_Msk        (0x80UL)                  /*!< SKUMIPIDSI (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SKU_SKUTURBOSPOT_Pos      (6UL)                     /*!< SKUTURBOSPOT (Bit 6)                                  */
#define MCUCTRL_SKU_SKUTURBOSPOT_Msk      (0x40UL)                  /*!< SKUTURBOSPOT (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SKU_SKUMRAMSIZE_Pos       (2UL)                     /*!< SKUMRAMSIZE (Bit 2)                                   */
#define MCUCTRL_SKU_SKUMRAMSIZE_Msk       (0xcUL)                   /*!< SKUMRAMSIZE (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SKU_SKUSRAMSIZE_Pos       (0UL)                     /*!< SKUSRAMSIZE (Bit 0)                                   */
#define MCUCTRL_SKU_SKUSRAMSIZE_Msk       (0x3UL)                   /*!< SKUSRAMSIZE (Bitfield-Mask: 0x03)                     */
/* ======================================================  SKUOVERRIDE  ====================================================== */
#define MCUCTRL_SKUOVERRIDE_CFGMVE_Pos    (20UL)                    /*!< CFGMVE (Bit 20)                                       */
#define MCUCTRL_SKUOVERRIDE_CFGMVE_Msk    (0x300000UL)              /*!< CFGMVE (Bitfield-Mask: 0x03)                          */
#define MCUCTRL_SKUOVERRIDE_CFGFPU_Pos    (19UL)                    /*!< CFGFPU (Bit 19)                                       */
#define MCUCTRL_SKUOVERRIDE_CFGFPU_Msk    (0x80000UL)               /*!< CFGFPU (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKUOVERRIDE_CFGDTCMSZ_Pos (15UL)                    /*!< CFGDTCMSZ (Bit 15)                                    */
#define MCUCTRL_SKUOVERRIDE_CFGDTCMSZ_Msk (0x78000UL)               /*!< CFGDTCMSZ (Bitfield-Mask: 0x0f)                       */
#define MCUCTRL_SKUOVERRIDE_CFGITCMSZ_Pos (11UL)                    /*!< CFGITCMSZ (Bit 11)                                    */
#define MCUCTRL_SKUOVERRIDE_CFGITCMSZ_Msk (0x7800UL)                /*!< CFGITCMSZ (Bitfield-Mask: 0x0f)                       */
#define MCUCTRL_SKUOVERRIDE_SKUUSB_Pos    (9UL)                     /*!< SKUUSB (Bit 9)                                        */
#define MCUCTRL_SKUOVERRIDE_SKUUSB_Msk    (0x200UL)                 /*!< SKUUSB (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKUOVERRIDE_SKUGFX_Pos    (8UL)                     /*!< SKUGFX (Bit 8)                                        */
#define MCUCTRL_SKUOVERRIDE_SKUGFX_Msk    (0x100UL)                 /*!< SKUGFX (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SKUOVERRIDE_SKUMIPIDSI_Pos (7UL)                    /*!< SKUMIPIDSI (Bit 7)                                    */
#define MCUCTRL_SKUOVERRIDE_SKUMIPIDSI_Msk (0x80UL)                 /*!< SKUMIPIDSI (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SKUOVERRIDE_SKUTURBOSPOT_Pos (6UL)                  /*!< SKUTURBOSPOT (Bit 6)                                  */
#define MCUCTRL_SKUOVERRIDE_SKUTURBOSPOT_Msk (0x40UL)               /*!< SKUTURBOSPOT (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SKUOVERRIDE_SKUMRAMSIZE_Pos (2UL)                   /*!< SKUMRAMSIZE (Bit 2)                                   */
#define MCUCTRL_SKUOVERRIDE_SKUMRAMSIZE_Msk (0xcUL)                 /*!< SKUMRAMSIZE (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SKUOVERRIDE_SKUSRAMSIZE_Pos (0UL)                   /*!< SKUSRAMSIZE (Bit 0)                                   */
#define MCUCTRL_SKUOVERRIDE_SKUSRAMSIZE_Msk (0x3UL)                 /*!< SKUSRAMSIZE (Bitfield-Mask: 0x03)                     */
/* =======================================================  DEBUGGER  ======================================================== */
#define MCUCTRL_DEBUGGER_LOCKOUT_Pos      (0UL)                     /*!< LOCKOUT (Bit 0)                                       */
#define MCUCTRL_DEBUGGER_LOCKOUT_Msk      (0xffffffffUL)            /*!< LOCKOUT (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ACRG  ========================================================== */
#define MCUCTRL_ACRG_ACRGTRIM_Pos         (3UL)                     /*!< ACRGTRIM (Bit 3)                                      */
#define MCUCTRL_ACRG_ACRGTRIM_Msk         (0xf8UL)                  /*!< ACRGTRIM (Bitfield-Mask: 0x1f)                        */
#define MCUCTRL_ACRG_ACRGIBIASSEL_Pos     (2UL)                     /*!< ACRGIBIASSEL (Bit 2)                                  */
#define MCUCTRL_ACRG_ACRGIBIASSEL_Msk     (0x4UL)                   /*!< ACRGIBIASSEL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_ACRG_ACRGPWD_Pos          (1UL)                     /*!< ACRGPWD (Bit 1)                                       */
#define MCUCTRL_ACRG_ACRGPWD_Msk          (0x2UL)                   /*!< ACRGPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_ACRG_ACRGSWE_Pos          (0UL)                     /*!< ACRGSWE (Bit 0)                                       */
#define MCUCTRL_ACRG_ACRGSWE_Msk          (0x1UL)                   /*!< ACRGSWE (Bitfield-Mask: 0x01)                         */
/* =======================================================  VREFGEN2  ======================================================== */
#define MCUCTRL_VREFGEN2_TVRGCCURRENTTRIM_Pos (15UL)                /*!< TVRGCCURRENTTRIM (Bit 15)                             */
#define MCUCTRL_VREFGEN2_TVRGCCURRENTTRIM_Msk (0x8000UL)            /*!< TVRGCCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN2_TVRGCHSENRESDIV_Pos (14UL)                 /*!< TVRGCHSENRESDIV (Bit 14)                              */
#define MCUCTRL_VREFGEN2_TVRGCHSENRESDIV_Msk (0x4000UL)             /*!< TVRGCHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN2_TVRGCPDNB_Pos    (13UL)                    /*!< TVRGCPDNB (Bit 13)                                    */
#define MCUCTRL_VREFGEN2_TVRGCPDNB_Msk    (0x2000UL)                /*!< TVRGCPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN2_TVRGCSELVREF_Pos (12UL)                    /*!< TVRGCSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN2_TVRGCSELVREF_Msk (0x1000UL)                /*!< TVRGCSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN2_TVRGCTEMPCOTRIM_Pos (7UL)                  /*!< TVRGCTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN2_TVRGCTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGCTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN2_TVRGCVREFTRIM_Pos (0UL)                    /*!< TVRGCVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN2_TVRGCVREFTRIM_Msk (0x7fUL)                 /*!< TVRGCVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* =======================================================  VREFGEN3  ======================================================== */
#define MCUCTRL_VREFGEN3_TVRGCLVCURRENTTRIM_Pos (15UL)              /*!< TVRGCLVCURRENTTRIM (Bit 15)                           */
#define MCUCTRL_VREFGEN3_TVRGCLVCURRENTTRIM_Msk (0x8000UL)          /*!< TVRGCLVCURRENTTRIM (Bitfield-Mask: 0x01)              */
#define MCUCTRL_VREFGEN3_TVRGCLVHSENRESDIV_Pos (14UL)               /*!< TVRGCLVHSENRESDIV (Bit 14)                            */
#define MCUCTRL_VREFGEN3_TVRGCLVHSENRESDIV_Msk (0x4000UL)           /*!< TVRGCLVHSENRESDIV (Bitfield-Mask: 0x01)               */
#define MCUCTRL_VREFGEN3_TVRGCLVPDNB_Pos  (13UL)                    /*!< TVRGCLVPDNB (Bit 13)                                  */
#define MCUCTRL_VREFGEN3_TVRGCLVPDNB_Msk  (0x2000UL)                /*!< TVRGCLVPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VREFGEN3_TVRGCLVSELVREF_Pos (12UL)                  /*!< TVRGCLVSELVREF (Bit 12)                               */
#define MCUCTRL_VREFGEN3_TVRGCLVSELVREF_Msk (0x1000UL)              /*!< TVRGCLVSELVREF (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_VREFGEN3_TVRGCLVTEMPCOTRIM_Pos (7UL)                /*!< TVRGCLVTEMPCOTRIM (Bit 7)                             */
#define MCUCTRL_VREFGEN3_TVRGCLVTEMPCOTRIM_Msk (0xf80UL)            /*!< TVRGCLVTEMPCOTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_VREFGEN3_TVRGCLVVREFTRIM_Pos (0UL)                  /*!< TVRGCLVVREFTRIM (Bit 0)                               */
#define MCUCTRL_VREFGEN3_TVRGCLVVREFTRIM_Msk (0x7fUL)               /*!< TVRGCLVVREFTRIM (Bitfield-Mask: 0x7f)                 */
/* =======================================================  VREFGEN4  ======================================================== */
#define MCUCTRL_VREFGEN4_TVRGFCURRENTTRIM_Pos (20UL)                /*!< TVRGFCURRENTTRIM (Bit 20)                             */
#define MCUCTRL_VREFGEN4_TVRGFCURRENTTRIM_Msk (0x100000UL)          /*!< TVRGFCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN4_TVRGFHSENRESDIV_Pos (19UL)                 /*!< TVRGFHSENRESDIV (Bit 19)                              */
#define MCUCTRL_VREFGEN4_TVRGFHSENRESDIV_Msk (0x80000UL)            /*!< TVRGFHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN4_TVRGFPDNB_Pos    (18UL)                    /*!< TVRGFPDNB (Bit 18)                                    */
#define MCUCTRL_VREFGEN4_TVRGFPDNB_Msk    (0x40000UL)               /*!< TVRGFPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN4_TVRGFPWLTEMPCOTRIM_Pos (13UL)              /*!< TVRGFPWLTEMPCOTRIM (Bit 13)                           */
#define MCUCTRL_VREFGEN4_TVRGFPWLTEMPCOTRIM_Msk (0x3e000UL)         /*!< TVRGFPWLTEMPCOTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_VREFGEN4_TVRGFSELVREF_Pos (12UL)                    /*!< TVRGFSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN4_TVRGFSELVREF_Msk (0x1000UL)                /*!< TVRGFSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN4_TVRGFTEMPCOTRIM_Pos (7UL)                  /*!< TVRGFTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN4_TVRGFTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGFTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN4_TVRGFVREFTRIM_Pos (0UL)                    /*!< TVRGFVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN4_TVRGFVREFTRIM_Msk (0x7fUL)                 /*!< TVRGFVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* =======================================================  VREFGEN5  ======================================================== */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Pos (20UL)                /*!< TVRGSCURRENTTRIM (Bit 20)                             */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Msk (0x100000UL)          /*!< TVRGSCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Pos (19UL)                 /*!< TVRGSHSENRESDIV (Bit 19)                              */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Msk (0x80000UL)            /*!< TVRGSHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Pos    (18UL)                    /*!< TVRGSPDNB (Bit 18)                                    */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Msk    (0x40000UL)               /*!< TVRGSPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Pos (13UL)              /*!< TVRGSPWLTEMPCOTRIM (Bit 13)                           */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Msk (0x3e000UL)         /*!< TVRGSPWLTEMPCOTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Pos (12UL)                    /*!< TVRGSSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Msk (0x1000UL)                /*!< TVRGSSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Pos (7UL)                  /*!< TVRGSTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGSTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Pos (0UL)                    /*!< TVRGSVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Msk (0x7fUL)                 /*!< TVRGSVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* ========================================================  VREFBUF  ======================================================== */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Pos (14UL)                 /*!< VREFBUFCCOMPTRIM (Bit 14)                             */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Msk (0x1c000UL)            /*!< VREFBUFCCOMPTRIM (Bitfield-Mask: 0x07)                */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Pos (13UL)                 /*!< VREFBUFIBIASTRIM (Bit 13)                             */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Msk (0x2000UL)             /*!< VREFBUFIBIASTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Pos (7UL)                   /*!< VREFBUFMISCTRIM (Bit 7)                               */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Msk (0x1f80UL)              /*!< VREFBUFMISCTRIM (Bitfield-Mask: 0x3f)                 */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Pos   (6UL)                     /*!< VREFBUFPDNB (Bit 6)                                   */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Msk   (0x40UL)                  /*!< VREFBUFPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VREFBUF_VREFBUFVOLTTRIM_Pos (0UL)                   /*!< VREFBUFVOLTTRIM (Bit 0)                               */
#define MCUCTRL_VREFBUF_VREFBUFVOLTTRIM_Msk (0x3fUL)                /*!< VREFBUFVOLTTRIM (Bitfield-Mask: 0x3f)                 */
/* ========================================================  VRCTRL  ========================================================= */
#define MCUCTRL_VRCTRL_SIMOBUCKACTIVE_Pos (19UL)                    /*!< SIMOBUCKACTIVE (Bit 19)                               */
#define MCUCTRL_VRCTRL_SIMOBUCKACTIVE_Msk (0x80000UL)               /*!< SIMOBUCKACTIVE (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_VRCTRL_SIMOBUCKRSTB_Pos   (18UL)                    /*!< SIMOBUCKRSTB (Bit 18)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKRSTB_Msk   (0x40000UL)               /*!< SIMOBUCKRSTB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_SIMOBUCKPDNB_Pos   (17UL)                    /*!< SIMOBUCKPDNB (Bit 17)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKPDNB_Msk   (0x20000UL)               /*!< SIMOBUCKPDNB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_SIMOBUCKOVER_Pos   (16UL)                    /*!< SIMOBUCKOVER (Bit 16)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKOVER_Msk   (0x10000UL)               /*!< SIMOBUCKOVER (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_ANALDOACTIVE_Pos   (15UL)                    /*!< ANALDOACTIVE (Bit 15)                                 */
#define MCUCTRL_VRCTRL_ANALDOACTIVE_Msk   (0x8000UL)                /*!< ANALDOACTIVE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_ANALDOPDNB_Pos     (14UL)                    /*!< ANALDOPDNB (Bit 14)                                   */
#define MCUCTRL_VRCTRL_ANALDOPDNB_Msk     (0x4000UL)                /*!< ANALDOPDNB (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_ANALDOOVER_Pos     (13UL)                    /*!< ANALDOOVER (Bit 13)                                   */
#define MCUCTRL_VRCTRL_ANALDOOVER_Msk     (0x2000UL)                /*!< ANALDOOVER (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_MEMLPLDOACTIVE_Pos (12UL)                    /*!< MEMLPLDOACTIVE (Bit 12)                               */
#define MCUCTRL_VRCTRL_MEMLPLDOACTIVE_Msk (0x1000UL)                /*!< MEMLPLDOACTIVE (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_VRCTRL_MEMLPLDOPDNB_Pos   (11UL)                    /*!< MEMLPLDOPDNB (Bit 11)                                 */
#define MCUCTRL_VRCTRL_MEMLPLDOPDNB_Msk   (0x800UL)                 /*!< MEMLPLDOPDNB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_MEMLPLDOOVER_Pos   (10UL)                    /*!< MEMLPLDOOVER (Bit 10)                                 */
#define MCUCTRL_VRCTRL_MEMLPLDOOVER_Msk   (0x400UL)                 /*!< MEMLPLDOOVER (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_MEMLDOCOLDSTARTEN_Pos (9UL)                  /*!< MEMLDOCOLDSTARTEN (Bit 9)                             */
#define MCUCTRL_VRCTRL_MEMLDOCOLDSTARTEN_Msk (0x200UL)              /*!< MEMLDOCOLDSTARTEN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_VRCTRL_MEMLDOACTIVE_Pos   (8UL)                     /*!< MEMLDOACTIVE (Bit 8)                                  */
#define MCUCTRL_VRCTRL_MEMLDOACTIVE_Msk   (0x100UL)                 /*!< MEMLDOACTIVE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_MEMLDOACTIVEEARLY_Pos (7UL)                  /*!< MEMLDOACTIVEEARLY (Bit 7)                             */
