zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_Pos (9UL)          /*!< CRYPTOCLKGATEN (Bit 9)                                */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_Msk (0x200UL)      /*!< CRYPTOCLKGATEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_Pos (8UL)       /*!< CRYPTOPWRDOWREADY (Bit 8)                             */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_Msk (0x100UL)   /*!< CRYPTOPWRDOWREADY (Bitfield-Mask: 0x01)               */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1PWRCTRL_Pos (5UL)            /*!< MRAM1PWRCTRL (Bit 5)                                  */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1PWRCTRL_Msk (0x20UL)         /*!< MRAM1PWRCTRL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1SLPEN_Pos (4UL)              /*!< MRAM1SLPEN (Bit 4)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1SLPEN_Msk (0x10UL)           /*!< MRAM1SLPEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1LPREN_Pos (3UL)              /*!< MRAM1LPREN (Bit 3)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM1LPREN_Msk (0x8UL)            /*!< MRAM1LPREN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0PWRCTRL_Pos (2UL)            /*!< MRAM0PWRCTRL (Bit 2)                                  */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0PWRCTRL_Msk (0x4UL)          /*!< MRAM0PWRCTRL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0SLPEN_Pos (1UL)              /*!< MRAM0SLPEN (Bit 1)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0SLPEN_Msk (0x2UL)            /*!< MRAM0SLPEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0LPREN_Pos (0UL)              /*!< MRAM0LPREN (Bit 0)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0LPREN_Msk (0x1UL)            /*!< MRAM0LPREN (Bitfield-Mask: 0x01)                      */
/* =======================================================  BODISABLE  ======================================================= */
#define MCUCTRL_BODISABLE_BODCLVREN_Pos   (4UL)                     /*!< BODCLVREN (Bit 4)                                     */
#define MCUCTRL_BODISABLE_BODCLVREN_Msk   (0x10UL)                  /*!< BODCLVREN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_BODISABLE_BODSREN_Pos     (3UL)                     /*!< BODSREN (Bit 3)                                       */
#define MCUCTRL_BODISABLE_BODSREN_Msk     (0x8UL)                   /*!< BODSREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODFREN_Pos     (2UL)                     /*!< BODFREN (Bit 2)                                       */
#define MCUCTRL_BODISABLE_BODFREN_Msk     (0x4UL)                   /*!< BODFREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODCREN_Pos     (1UL)                     /*!< BODCREN (Bit 1)                                       */
#define MCUCTRL_BODISABLE_BODCREN_Msk     (0x2UL)                   /*!< BODCREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODLRDE_Pos     (0UL)                     /*!< BODLRDE (Bit 0)                                       */
#define MCUCTRL_BODISABLE_BODLRDE_Msk     (0x1UL)                   /*!< BODLRDE (Bitfield-Mask: 0x01)                         */
/* =======================================================  D2ASPARE  ======================================================== */
#define MCUCTRL_D2ASPARE_INFO1ACCESS_Pos  (31UL)                    /*!< INFO1ACCESS (Bit 31)                                  */
#define MCUCTRL_D2ASPARE_INFO1ACCESS_Msk  (0x80000000UL)            /*!< INFO1ACCESS (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_D2ASPARE_UART3PLL_Pos     (25UL)                    /*!< UART3PLL (Bit 25)                                     */
#define MCUCTRL_D2ASPARE_UART3PLL_Msk     (0x2000000UL)             /*!< UART3PLL (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_D2ASPARE_UART2PLL_Pos     (24UL)                    /*!< UART2PLL (Bit 24)                                     */
#define MCUCTRL_D2ASPARE_UART2PLL_Msk     (0x1000000UL)             /*!< UART2PLL (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_D2ASPARE_UART1PLL_Pos     (23UL)                    /*!< UART1PLL (Bit 23)                                     */
#define MCUCTRL_D2ASPARE_UART1PLL_Msk     (0x800000UL)              /*!< UART1PLL (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_D2ASPARE_UART0PLL_Pos     (22UL)                    /*!< UART0PLL (Bit 22)                                     */
#define MCUCTRL_D2ASPARE_UART0PLL_Msk     (0x400000UL)              /*!< UART0PLL (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF_Pos (21UL)            /*!< PLLISOLATIONVDDHVDDF (Bit 21)                         */
#define MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF_Msk (0x200000UL)      /*!< PLLISOLATIONVDDHVDDF (Bitfield-Mask: 0x01)            */
#define MCUCTRL_D2ASPARE_MEMLDOREF_Pos    (15UL)                    /*!< MEMLDOREF (Bit 15)                                    */
#define MCUCTRL_D2ASPARE_MEMLDOREF_Msk    (0x18000UL)               /*!< MEMLDOREF (Bitfield-Mask: 0x03)                       */
#define MCUCTRL_D2ASPARE_SIMOVDDCBOOST_Pos (8UL)                    /*!< SIMOVDDCBOOST (Bit 8)                                 */
#define MCUCTRL_D2ASPARE_SIMOVDDCBOOST_Msk (0x100UL)                /*!< SIMOVDDCBOOST (Bitfield-Mask: 0x01)                   */
/* ======================================================  BOOTLOADER  ======================================================= */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Pos (30UL)                  /*!< SECBOOTONRST (Bit 30)                                 */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Msk (0xc0000000UL)          /*!< SECBOOTONRST (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_BOOTLOADER_SECBOOT_Pos    (28UL)                    /*!< SECBOOT (Bit 28)                                      */
#define MCUCTRL_BOOTLOADER_SECBOOT_Msk    (0x30000000UL)            /*!< SECBOOT (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Pos (26UL)                /*!< SECBOOTFEATURE (Bit 26)                               */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Msk (0xc000000UL)         /*!< SECBOOTFEATURE (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_BOOTLOADER_SBLLOCK_Pos    (3UL)                     /*!< SBLLOCK (Bit 3)                                       */
#define MCUCTRL_BOOTLOADER_SBLLOCK_Msk    (0x8UL)                   /*!< SBLLOCK (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Pos   (2UL)                     /*!< PROTLOCK (Bit 2)                                      */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Msk   (0x4UL)                   /*!< PROTLOCK (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_BOOTLOADER_SBRLOCK_Pos    (1UL)                     /*!< SBRLOCK (Bit 1)                                       */
#define MCUCTRL_BOOTLOADER_SBRLOCK_Msk    (0x2UL)                   /*!< SBRLOCK (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BOOTLOADER_RSVD0_Pos      (0UL)                     /*!< RSVD0 (Bit 0)                                         */
#define MCUCTRL_BOOTLOADER_RSVD0_Msk      (0x1UL)                   /*!< RSVD0 (Bitfield-Mask: 0x01)                           */
/* ======================================================  SHADOWVALID  ====================================================== */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Pos (7UL)                  /*!< OTPBOOTFAULT (Bit 7)                                  */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Msk (0x1f80UL)             /*!< OTPBOOTFAULT (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_SHADOWVALID_OTPREADY_Pos  (6UL)                     /*!< OTPREADY (Bit 6)                                      */
#define MCUCTRL_SHADOWVALID_OTPREADY_Msk  (0x40UL)                  /*!< OTPREADY (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Pos (4UL)                   /*!< INFO0SELOTP (Bit 4)                                   */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Msk (0x10UL)                /*!< INFO0SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Pos (3UL)                   /*!< INFO1SELOTP (Bit 3)                                   */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Msk (0x8UL)                 /*!< INFO1SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_VALID_Pos     (0UL)                     /*!< VALID (Bit 0)                                         */
#define MCUCTRL_SHADOWVALID_VALID_Msk     (0x1UL)                   /*!< VALID (Bitfield-Mask: 0x01)                           */
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< SCRATCH0 (Bit 0)                                      */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< SCRATCH0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< SCRATCH1 (Bit 0)                                      */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< SCRATCH1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< ONETO8 (Bit 0)                                        */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< ONETO8 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< COOLCODE (Bit 0)                                      */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< COOLCODE (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  WICCONTROL  ======================================================= */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Pos  (0UL)                     /*!< DEEPISWIC (Bit 0)                                     */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Msk  (0x1UL)                   /*!< DEEPISWIC (Bitfield-Mask: 0x01)                       */
/* ========================================================  DBGCTRL  ======================================================== */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Pos   (12UL)                    /*!< DBGTSCLKSEL (Bit 12)                                  */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Msk   (0x7000UL)                /*!< DBGTSCLKSEL (Bitfield-Mask: 0x07)                     */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Pos  (8UL)                     /*!< DBGETBENABLE (Bit 8)                                  */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Msk  (0x100UL)                 /*!< DBGETBENABLE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Pos (1UL)                     /*!< DBGTPIUCLKSEL (Bit 1)                                 */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Msk (0xeUL)                   /*!< DBGTPIUCLKSEL (Bitfield-Mask: 0x07)                   */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Pos (0UL)                /*!< DBGTPIUTRACEENABLE (Bit 0)                            */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Msk (0x1UL)              /*!< DBGTPIUTRACEENABLE (Bitfield-Mask: 0x01)              */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (3UL)                     /*!< OTAPOINTER (Bit 3)                                    */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffff8UL)            /*!< OTAPOINTER (Bitfield-Mask: 0x1fffffff)                */
#define MCUCTRL_OTAPOINTER_OTASBR_Pos     (2UL)                     /*!< OTASBR (Bit 2)                                        */
#define MCUCTRL_OTAPOINTER_OTASBR_Msk     (0x4UL)                   /*!< OTASBR (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_OTAPOINTER_OTASBRUPDATE_Pos (1UL)                   /*!< OTASBRUPDATE (Bit 1)                                  */
#define MCUCTRL_OTAPOINTER_OTASBRUPDATE_Msk (0x2UL)                 /*!< OTASBRUPDATE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< OTAVALID (Bit 0)                                      */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< OTAVALID (Bitfield-Mask: 0x01)                        */
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< HYSTERESIS (Bit 8)                                    */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< HYSTERESIS (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Pos (1UL)                    /*!< DECODEABORT (Bit 1)                                   */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Msk (0x2UL)                  /*!< DECODEABORT (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Pos  (0UL)                     /*!< DMAENABLE (Bit 0)                                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Msk  (0x1UL)                   /*!< DMAENABLE (Bitfield-Mask: 0x01)                       */
/* =====================================================  FORCEAXICLKEN  ===================================================== */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Pos (0UL)                 /*!< FRCAXICLKEN (Bit 0)                                   */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Msk (0x1UL)               /*!< FRCAXICLKEN (Bitfield-Mask: 0x01)                     */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK0  ======================================================= */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Pos (4UL)               /*!< TONTOFFNODEGLITCH (Bit 4)                             */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Msk (0x10UL)            /*!< TONTOFFNODEGLITCH (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Pos (3UL)                  /*!< VDDCLVRXCOMPEN (Bit 3)                                */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Msk (0x8UL)                /*!< VDDCLVRXCOMPEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Pos (2UL)                    /*!< VDDSRXCOMPEN (Bit 2)                                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Msk (0x4UL)                  /*!< VDDSRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Pos (1UL)                    /*!< VDDFRXCOMPEN (Bit 1)                                  */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Msk (0x2UL)                  /*!< VDDFRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Pos (0UL)                    /*!< VDDCRXCOMPEN (Bit 0)                                  */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Msk (0x1UL)                  /*!< VDDCRXCOMPEN (Bitfield-Mask: 0x01)                    */
/* =======================================================  SIMOBUCK1  ======================================================= */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Pos (31UL)               /*!< SIMOBUCKHPTRIMEN (Bit 31)                             */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Msk (0x80000000UL)       /*!< SIMOBUCKHPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Pos (30UL)                  /*!< SIMOBUCKOBSEN (Bit 30)                                */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Msk (0x40000000UL)          /*!< SIMOBUCKOBSEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_BUCKMODE_Pos    (29UL)                    /*!< BUCKMODE (Bit 29)                                     */
#define MCUCTRL_SIMOBUCK1_BUCKMODE_Msk    (0x20000000UL)            /*!< BUCKMODE (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Pos (28UL)                   /*!< FORCEBUCKOFF (Bit 28)                                 */
#define MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Msk (0x10000000UL)           /*!< FORCEBUCKOFF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK1_TPNDTRIM_Pos    (26UL)                    /*!< TPNDTRIM (Bit 26)                                     */
#define MCUCTRL_SIMOBUCK1_TPNDTRIM_Msk    (0xc000000UL)             /*!< TPNDTRIM (Bitfield-Mask: 0x03)                        */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Pos  (22UL)                    /*!< TONCLKTRIM (Bit 22)                                   */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Msk  (0x3c00000UL)             /*!< TONCLKTRIM (Bitfield-Mask: 0x0f)                      */
#define MCUCTRL_SIMOBUCK1_WSELVDDSBSMODE_Pos (21UL)                 /*!< WSELVDDSBSMODE (Bit 21)                               */
#define MCUCTRL_SIMOBUCK1_WSELVDDSBSMODE_Msk (0x200000UL)           /*!< WSELVDDSBSMODE (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK1_WSELDELAYTRIM_Pos (20UL)                  /*!< WSELDELAYTRIM (Bit 20)                                */
#define MCUCTRL_SIMOBUCK1_WSELDELAYTRIM_Msk (0x100000UL)            /*!< WSELDELAYTRIM (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_RXSCHEDULINGCODE_Pos (18UL)               /*!< RXSCHEDULINGCODE (Bit 18)                             */
#define MCUCTRL_SIMOBUCK1_RXSCHEDULINGCODE_Msk (0xc0000UL)          /*!< RXSCHEDULINGCODE (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK1_OBSMODE_Pos     (16UL)                    /*!< OBSMODE (Bit 16)                                      */
#define MCUCTRL_SIMOBUCK1_OBSMODE_Msk     (0x30000UL)               /*!< OBSMODE (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_SIMOBUCK1_RXCLKLPTRIM_Pos (11UL)                    /*!< RXCLKLPTRIM (Bit 11)                                  */
#define MCUCTRL_SIMOBUCK1_RXCLKLPTRIM_Msk (0xf800UL)                /*!< RXCLKLPTRIM (Bitfield-Mask: 0x1f)                     */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Pos (6UL)                    /*!< RXCLKACTTRIM (Bit 6)                                  */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Msk (0x7c0UL)                /*!< RXCLKACTTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK1_RXCLKACTSEL_Pos (5UL)                     /*!< RXCLKACTSEL (Bit 5)                                   */
#define MCUCTRL_SIMOBUCK1_RXCLKACTSEL_Msk (0x20UL)                  /*!< RXCLKACTSEL (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SIMOBUCK1_LPFBEN_Pos      (4UL)                     /*!< LPFBEN (Bit 4)                                        */
#define MCUCTRL_SIMOBUCK1_LPFBEN_Msk      (0x10UL)                  /*!< LPFBEN (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Pos (3UL)                   /*!< FORCETONCLKEN (Bit 3)                                 */
#define MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Msk (0x8UL)                 /*!< FORCETONCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_DCMMODEEN_Pos   (2UL)                     /*!< DCMMODEEN (Bit 2)                                     */
#define MCUCTRL_SIMOBUCK1_DCMMODEEN_Msk   (0x4UL)                   /*!< DCMMODEEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK1_COARSESEL_Pos   (1UL)                     /*!< COARSESEL (Bit 1)                                     */
#define MCUCTRL_SIMOBUCK1_COARSESEL_Msk   (0x2UL)                   /*!< COARSESEL (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK1_ACTFBEN_Pos     (0UL)                     /*!< ACTFBEN (Bit 0)                                       */
#define MCUCTRL_SIMOBUCK1_ACTFBEN_Msk     (0x1UL)                   /*!< ACTFBEN (Bitfield-Mask: 0x01)                         */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Pos (25UL)              /*!< VDDCACTLOWTONTRIM (Bit 25)                            */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Msk (0x3e000000UL)      /*!< VDDCACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTOFFTRIM_Pos (20UL)             /*!< VDDCACTLOWTOFFTRIM (Bit 20)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTOFFTRIM_Msk (0x1f00000UL)      /*!< VDDCACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Pos (11UL)             /*!< VDDCACTHIGHTONTRIM (Bit 11)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Msk (0xf800UL)         /*!< VDDCACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTOFFTRIM_Pos (6UL)             /*!< VDDCACTHIGHTOFFTRIM (Bit 6)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTOFFTRIM_Msk (0x7c0UL)         /*!< VDDCACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK2_VDDCACTDRVSTRTRIM_Pos (0UL)               /*!< VDDCACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK2_VDDCACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDCACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Pos (27UL)               /*!< VDDCLPLOWTONTRIM (Bit 27)                             */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Msk (0xf8000000UL)       /*!< VDDCLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIM_Pos (22UL)              /*!< VDDCLPLOWTOFFTRIM (Bit 22)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIM_Msk (0x7c00000UL)       /*!< VDDCLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIMFINE_Pos (18UL)          /*!< VDDCLPLOWTOFFTRIMFINE (Bit 18)                        */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIMFINE_Msk (0x3c0000UL)    /*!< VDDCLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Pos (13UL)              /*!< VDDCLPHIGHTONTRIM (Bit 13)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Msk (0x3e000UL)         /*!< VDDCLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
