zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIM_Pos (8UL)              /*!< VDDCLPHIGHTOFFTRIM (Bit 8)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIM_Msk (0x1f00UL)         /*!< VDDCLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIMFINE_Pos (4UL)          /*!< VDDCLPHIGHTOFFTRIMFINE (Bit 4)                        */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIMFINE_Msk (0xf0UL)       /*!< VDDCLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
#define MCUCTRL_SIMOBUCK3_VDDCLPDRVSTRTRIM_Pos (2UL)                /*!< VDDCLPDRVSTRTRIM (Bit 2)                              */
#define MCUCTRL_SIMOBUCK3_VDDCLPDRVSTRTRIM_Msk (0xcUL)              /*!< VDDCLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK3_VDDCLEAKAGETRIM_Pos (0UL)                 /*!< VDDCLEAKAGETRIM (Bit 0)                               */
#define MCUCTRL_SIMOBUCK3_VDDCLEAKAGETRIM_Msk (0x3UL)               /*!< VDDCLEAKAGETRIM (Bitfield-Mask: 0x03)                 */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_VDDCLVINPREFSEL_Pos (30UL)                /*!< VDDCLVINPREFSEL (Bit 30)                              */
#define MCUCTRL_SIMOBUCK4_VDDCLVINPREFSEL_Msk (0x40000000UL)        /*!< VDDCLVINPREFSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Pos (25UL)            /*!< VDDCLVACTLOWTONTRIM (Bit 25)                          */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Msk (0x3e000000UL)    /*!< VDDCLVACTLOWTONTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Pos (20UL)           /*!< VDDCLVACTLOWTOFFTRIM (Bit 20)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Msk (0x1f00000UL)    /*!< VDDCLVACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIMFINE_Pos (16UL)       /*!< VDDCLVACTLOWTOFFTRIMFINE (Bit 16)                     */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIMFINE_Msk (0xf0000UL)  /*!< VDDCLVACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)        */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Pos (11UL)           /*!< VDDCLVACTHIGHTONTRIM (Bit 11)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Msk (0xf800UL)       /*!< VDDCLVACTHIGHTONTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Pos (6UL)           /*!< VDDCLVACTHIGHTOFFTRIM (Bit 6)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Msk (0x7c0UL)       /*!< VDDCLVACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIMFINE_Pos (2UL)       /*!< VDDCLVACTHIGHTOFFTRIMFINE (Bit 2)                     */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIMFINE_Msk (0x3cUL)    /*!< VDDCLVACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Pos (0UL)             /*!< VDDCLVACTDRVSTRTRIM (Bit 0)                           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Msk (0x3UL)           /*!< VDDCLVACTDRVSTRTRIM (Bitfield-Mask: 0x03)             */
/* =======================================================  SIMOBUCK5  ======================================================= */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTONTRIM_Pos (27UL)             /*!< VDDCLVLPLOWTONTRIM (Bit 27)                           */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTONTRIM_Msk (0xf8000000UL)     /*!< VDDCLVLPLOWTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIM_Pos (22UL)            /*!< VDDCLVLPLOWTOFFTRIM (Bit 22)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIM_Msk (0x7c00000UL)     /*!< VDDCLVLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIMFINE_Pos (18UL)        /*!< VDDCLVLPLOWTOFFTRIMFINE (Bit 18)                      */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIMFINE_Msk (0x3c0000UL)  /*!< VDDCLVLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTONTRIM_Pos (13UL)            /*!< VDDCLVLPHIGHTONTRIM (Bit 13)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTONTRIM_Msk (0x3e000UL)       /*!< VDDCLVLPHIGHTONTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIM_Pos (8UL)            /*!< VDDCLVLPHIGHTOFFTRIM (Bit 8)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIM_Msk (0x1f00UL)       /*!< VDDCLVLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIMFINE_Pos (4UL)        /*!< VDDCLVLPHIGHTOFFTRIMFINE (Bit 4)                      */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIMFINE_Msk (0xf0UL)     /*!< VDDCLVLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)        */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPDRVSTRTRIM_Pos (2UL)              /*!< VDDCLVLPDRVSTRTRIM (Bit 2)                            */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPDRVSTRTRIM_Msk (0xcUL)            /*!< VDDCLVLPDRVSTRTRIM (Bitfield-Mask: 0x03)              */
#define MCUCTRL_SIMOBUCK5_VDDCLVLEAKAGETRIM_Pos (0UL)               /*!< VDDCLVLEAKAGETRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLEAKAGETRIM_Msk (0x3UL)             /*!< VDDCLVLEAKAGETRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK6  ======================================================= */
#define MCUCTRL_SIMOBUCK6_VDDFLEAKAGETRIM_Pos (30UL)                /*!< VDDFLEAKAGETRIM (Bit 30)                              */
#define MCUCTRL_SIMOBUCK6_VDDFLEAKAGETRIM_Msk (0xc0000000UL)        /*!< VDDFLEAKAGETRIM (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_SIMOBUCK6_VDDFINPREFSEL_Pos (29UL)                  /*!< VDDFINPREFSEL (Bit 29)                                */
#define MCUCTRL_SIMOBUCK6_VDDFINPREFSEL_Msk (0x20000000UL)          /*!< VDDFINPREFSEL (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK6_VDDFACTTRIM_Pos (23UL)                    /*!< VDDFACTTRIM (Bit 23)                                  */
#define MCUCTRL_SIMOBUCK6_VDDFACTTRIM_Msk (0x1f800000UL)            /*!< VDDFACTTRIM (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK6_VDDFACTINPREFSEL_Pos (22UL)               /*!< VDDFACTINPREFSEL (Bit 22)                             */
#define MCUCTRL_SIMOBUCK6_VDDFACTINPREFSEL_Msk (0x400000UL)         /*!< VDDFACTINPREFSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Pos (17UL)             /*!< VDDFACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Msk (0x3e0000UL)       /*!< VDDFACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIM_Pos (12UL)            /*!< VDDFACTHIGHTOFFTRIM (Bit 12)                          */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIM_Msk (0x1f000UL)       /*!< VDDFACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIMFINE_Pos (8UL)         /*!< VDDFACTHIGHTOFFTRIMFINE (Bit 8)                       */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIMFINE_Msk (0xf00UL)     /*!< VDDFACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK6_VDDFACTFBTRIM_Pos (2UL)                   /*!< VDDFACTFBTRIM (Bit 2)                                 */
#define MCUCTRL_SIMOBUCK6_VDDFACTFBTRIM_Msk (0xfcUL)                /*!< VDDFACTFBTRIM (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_SIMOBUCK6_VDDFACTDRVSTRTRIM_Pos (0UL)               /*!< VDDFACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK6_VDDFACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDFACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK7  ======================================================= */
#define MCUCTRL_SIMOBUCK7_VDDFLPTRIM_Pos  (25UL)                    /*!< VDDFLPTRIM (Bit 25)                                   */
#define MCUCTRL_SIMOBUCK7_VDDFLPTRIM_Msk  (0x7e000000UL)            /*!< VDDFLPTRIM (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK7_VDDFLPINPREFSEL_Pos (23UL)                /*!< VDDFLPINPREFSEL (Bit 23)                              */
#define MCUCTRL_SIMOBUCK7_VDDFLPINPREFSEL_Msk (0x1800000UL)         /*!< VDDFLPINPREFSEL (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Pos (18UL)                   /*!< ZXCOMPZXTRIM (Bit 18)                                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Msk (0x7c0000UL)             /*!< ZXCOMPZXTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACTRIM_Pos (16UL)               /*!< VDDFLPFBCDACTRIM (Bit 16)                             */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACTRIM_Msk (0x30000UL)          /*!< VDDFLPFBCDACTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACEN_Pos (15UL)                 /*!< VDDFLPFBCDACEN (Bit 15)                               */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACEN_Msk (0x8000UL)             /*!< VDDFLPFBCDACEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Pos (13UL)               /*!< VDDFLPDRVSTRTRIM (Bit 13)                             */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Msk (0x6000UL)           /*!< VDDFLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Pos (8UL)               /*!< VDDFACTLOWTONTRIM (Bit 8)                             */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Msk (0x1f00UL)          /*!< VDDFACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Pos (3UL)              /*!< VDDFACTLOWTOFFTRIM (Bit 3)                            */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Msk (0xf8UL)           /*!< VDDFACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIMFINE_Pos (0UL)          /*!< VDDFACTLOWTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIMFINE_Msk (0x7UL)        /*!< VDDFACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x07)          */
/* =======================================================  SIMOBUCK8  ======================================================= */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Pos (23UL)               /*!< VDDFLPLOWTONTRIM (Bit 23)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Msk (0xf800000UL)        /*!< VDDFLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIM_Pos (18UL)              /*!< VDDFLPLOWTOFFTRIM (Bit 18)                            */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIM_Msk (0x7c0000UL)        /*!< VDDFLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIMFINE_Pos (14UL)          /*!< VDDFLPLOWTOFFTRIMFINE (Bit 14)                        */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIMFINE_Msk (0x3c000UL)     /*!< VDDFLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Pos (9UL)               /*!< VDDFLPHIGHTONTRIM (Bit 9)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Msk (0x3e00UL)          /*!< VDDFLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIM_Pos (4UL)              /*!< VDDFLPHIGHTOFFTRIM (Bit 4)                            */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIM_Msk (0x1f0UL)          /*!< VDDFLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIMFINE_Pos (0UL)          /*!< VDDFLPHIGHTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIMFINE_Msk (0xfUL)        /*!< VDDFLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
/* =======================================================  SIMOBUCK9  ======================================================= */
#define MCUCTRL_SIMOBUCK9_VDDSLEAKAGETRIM_Pos (28UL)                /*!< VDDSLEAKAGETRIM (Bit 28)                              */
#define MCUCTRL_SIMOBUCK9_VDDSLEAKAGETRIM_Msk (0x10000000UL)        /*!< VDDSLEAKAGETRIM (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Pos (23UL)              /*!< VDDSACTLOWTONTRIM (Bit 23)                            */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Msk (0xf800000UL)       /*!< VDDSACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK9_VDDSACTINPREFSEL_Pos (22UL)               /*!< VDDSACTINPREFSEL (Bit 22)                             */
#define MCUCTRL_SIMOBUCK9_VDDSACTINPREFSEL_Msk (0x400000UL)         /*!< VDDSACTINPREFSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Pos (17UL)             /*!< VDDSACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Msk (0x3e0000UL)       /*!< VDDSACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIM_Pos (12UL)            /*!< VDDSACTHIGHTOFFTRIM (Bit 12)                          */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIM_Msk (0x1f000UL)       /*!< VDDSACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIMFINE_Pos (8UL)         /*!< VDDSACTHIGHTOFFTRIMFINE (Bit 8)                       */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIMFINE_Msk (0xf00UL)     /*!< VDDSACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK9_VDDSACTFBTRIM_Pos (2UL)                   /*!< VDDSACTFBTRIM (Bit 2)                                 */
#define MCUCTRL_SIMOBUCK9_VDDSACTFBTRIM_Msk (0xfcUL)                /*!< VDDSACTFBTRIM (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_SIMOBUCK9_VDDSACTDRVSTRTRIM_Pos (0UL)               /*!< VDDSACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK9_VDDSACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDSACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* ======================================================  SIMOBUCK10  ======================================================= */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIM_Pos (24UL)            /*!< VDDSLPHIGHTOFFTRIM (Bit 24)                           */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIM_Msk (0x1f000000UL)    /*!< VDDSLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIMFINE_Pos (20UL)        /*!< VDDSLPHIGHTOFFTRIMFINE (Bit 20)                       */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIMFINE_Msk (0xf00000UL)  /*!< VDDSLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBTRIM_Pos (14UL)                  /*!< VDDSLPFBTRIM (Bit 14)                                 */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBTRIM_Msk (0xfc000UL)             /*!< VDDSLPFBTRIM (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACTRIM_Pos (12UL)              /*!< VDDSLPFBCDACTRIM (Bit 12)                             */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACTRIM_Msk (0x3000UL)          /*!< VDDSLPFBCDACTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACEN_Pos (11UL)                /*!< VDDSLPFBCDACEN (Bit 11)                               */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACEN_Msk (0x800UL)             /*!< VDDSLPFBCDACEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK10_VDDSLPDRVSTRTRIM_Pos (9UL)               /*!< VDDSLPDRVSTRTRIM (Bit 9)                              */
#define MCUCTRL_SIMOBUCK10_VDDSLPDRVSTRTRIM_Msk (0x600UL)           /*!< VDDSLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIM_Pos (4UL)             /*!< VDDSACTLOWTOFFTRIM (Bit 4)                            */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIM_Msk (0x1f0UL)         /*!< VDDSACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIMFINE_Pos (0UL)         /*!< VDDSACTLOWTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIMFINE_Msk (0xfUL)       /*!< VDDSACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
/* ======================================================  SIMOBUCK11  ======================================================= */
#define MCUCTRL_SIMOBUCK11_ENBRNOUT_Pos   (24UL)                    /*!< ENBRNOUT (Bit 24)                                     */
#define MCUCTRL_SIMOBUCK11_ENBRNOUT_Msk   (0xf000000UL)             /*!< ENBRNOUT (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPOST_Pos (22UL)             /*!< TRIMCHANGEDLYPOST (Bit 22)                            */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPOST_Msk (0xc00000UL)       /*!< TRIMCHANGEDLYPOST (Bitfield-Mask: 0x03)               */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPRE_Pos (20UL)              /*!< TRIMCHANGEDLYPRE (Bit 20)                             */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPRE_Msk (0x300000UL)        /*!< TRIMCHANGEDLYPRE (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTONTRIM_Pos (15UL)              /*!< VDDSLPLOWTONTRIM (Bit 15)                             */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTONTRIM_Msk (0xf8000UL)         /*!< VDDSLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIM_Pos (10UL)             /*!< VDDSLPLOWTOFFTRIM (Bit 10)                            */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIM_Msk (0x7c00UL)         /*!< VDDSLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIMFINE_Pos (6UL)          /*!< VDDSLPLOWTOFFTRIMFINE (Bit 6)                         */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIMFINE_Msk (0x3c0UL)      /*!< VDDSLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK11_VDDSLPINPREFSEL_Pos (5UL)                /*!< VDDSLPINPREFSEL (Bit 5)                               */
#define MCUCTRL_SIMOBUCK11_VDDSLPINPREFSEL_Msk (0x20UL)             /*!< VDDSLPINPREFSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK11_VDDSLPHIGHTONTRIM_Pos (0UL)              /*!< VDDSLPHIGHTONTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK11_VDDSLPHIGHTONTRIM_Msk (0x1fUL)           /*!< VDDSLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK12  ======================================================= */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Pos (26UL)                    /*!< LPTRIMVDDF (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Msk (0xfc000000UL)            /*!< LPTRIMVDDF (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Pos (20UL)                   /*!< ACTTRIMVDDF (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Msk (0x3f00000UL)            /*!< ACTTRIMVDDF (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Pos (10UL)              /*!< VDDCLVBRNOUTTRIM (Bit 10)                             */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Msk (0xffc00UL)         /*!< VDDCLVBRNOUTTRIM (Bitfield-Mask: 0x3ff)               */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Pos (5UL)             /*!< VDDCLVCOMPTRIMPLUS (Bit 5)                            */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Msk (0x3e0UL)         /*!< VDDCLVCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Pos (0UL)            /*!< VDDCLVCOMPTRIMMINUS (Bit 0)                           */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Msk (0x1fUL)         /*!< VDDCLVCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
/* ======================================================  SIMOBUCK13  ======================================================= */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Pos (26UL)                    /*!< LPTRIMVDDS (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Msk (0xfc000000UL)            /*!< LPTRIMVDDS (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Pos (20UL)                   /*!< ACTTRIMVDDS (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Msk (0x3f00000UL)            /*!< ACTTRIMVDDS (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK13_VDDSBRNOUTTRIM_Pos (10UL)                /*!< VDDSBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK13_VDDSBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDSBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMPLUS_Pos (5UL)               /*!< VDDSCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDSCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMMINUS_Pos (0UL)              /*!< VDDSCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDSCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK14  ======================================================= */
#define MCUCTRL_SIMOBUCK14_VDDCLKGEN_Pos  (31UL)                    /*!< VDDCLKGEN (Bit 31)                                    */
#define MCUCTRL_SIMOBUCK14_VDDCLKGEN_Msk  (0x80000000UL)            /*!< VDDCLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDCLKGTRIM_Pos (29UL)                   /*!< VDDCLKGTRIM (Bit 29)                                  */
#define MCUCTRL_SIMOBUCK14_VDDCLKGTRIM_Msk (0x60000000UL)           /*!< VDDCLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDFLKGEN_Pos  (28UL)                    /*!< VDDFLKGEN (Bit 28)                                    */
#define MCUCTRL_SIMOBUCK14_VDDFLKGEN_Msk  (0x10000000UL)            /*!< VDDFLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDFLKGTRIM_Pos (26UL)                   /*!< VDDFLKGTRIM (Bit 26)                                  */
#define MCUCTRL_SIMOBUCK14_VDDFLKGTRIM_Msk (0xc000000UL)            /*!< VDDFLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDSLKGEN_Pos  (25UL)                    /*!< VDDSLKGEN (Bit 25)                                    */
#define MCUCTRL_SIMOBUCK14_VDDSLKGEN_Msk  (0x2000000UL)             /*!< VDDSLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDSLKGTRIM_Pos (23UL)                   /*!< VDDSLKGTRIM (Bit 23)                                  */
#define MCUCTRL_SIMOBUCK14_VDDSLKGTRIM_Msk (0x1800000UL)            /*!< VDDSLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGEN_Pos (22UL)                   /*!< VDDCLVLKGEN (Bit 22)                                  */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGEN_Msk (0x400000UL)             /*!< VDDCLVLKGEN (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGTRIM_Pos (20UL)                 /*!< VDDCLVLKGTRIM (Bit 20)                                */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGTRIM_Msk (0x300000UL)           /*!< VDDCLVLKGTRIM (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_SIMOBUCK14_VDDFBRNOUTTRIM_Pos (10UL)                /*!< VDDFBRNOUTTRIM (Bit 10)                               */
