zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define MCUCTRL_FLASHRPROT5_FR5BITS_Pos   (0UL)                     /*!< FR5BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT5_FR5BITS_Msk   (0xffffffffUL)            /*!< FR5BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT6  ====================================================== */
#define MCUCTRL_FLASHRPROT6_FR6BITS_Pos   (0UL)                     /*!< FR6BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT6_FR6BITS_Msk   (0xffffffffUL)            /*!< FR6BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT7  ====================================================== */
#define MCUCTRL_FLASHRPROT7_FR7BITS_Pos   (0UL)                     /*!< FR7BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT7_FR7BITS_Msk   (0xffffffffUL)            /*!< FR7BITS (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  PWRSW2  ========================================================= */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXOVERRIDE_Pos (2UL)                /*!< PWRSWVDDGFXOVERRIDE (Bit 2)                           */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXOVERRIDE_Msk (0x4UL)              /*!< PWRSWVDDGFXOVERRIDE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXSTATSEL_Pos (1UL)                 /*!< PWRSWVDDGFXSTATSEL (Bit 1)                            */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXSTATSEL_Msk (0x2UL)               /*!< PWRSWVDDGFXSTATSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXDYNSEL_Pos (0UL)                  /*!< PWRSWVDDGFXDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXDYNSEL_Msk (0x1UL)                /*!< PWRSWVDDGFXDYNSEL (Bitfield-Mask: 0x01)               */
/* ========================================================  CPUCFG  ========================================================= */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Pos   (4UL)                     /*!< CFGNSSTCALIB (Bit 4)                                  */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Msk   (0x3ffffff0UL)            /*!< CFGNSSTCALIB (Bitfield-Mask: 0x3ffffff)               */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Pos   (3UL)                     /*!< INITL1RSTDIS (Bit 3)                                  */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Msk   (0x8UL)                   /*!< INITL1RSTDIS (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Pos    (2UL)                     /*!< INITPAHBDIS (Bit 2)                                   */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Msk    (0x4UL)                   /*!< INITPAHBDIS (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_CPUCFG_INITTCMDIS_Pos     (0UL)                     /*!< INITTCMDIS (Bit 0)                                    */
#define MCUCTRL_CPUCFG_INITTCMDIS_Msk     (0x3UL)                   /*!< INITTCMDIS (Bitfield-Mask: 0x03)                      */
/* ========================================================  PLLCTL0  ======================================================== */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_Pos (31UL)                   /*!< SYSPLLVDDFPDNB (Bit 31)                               */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_Msk (0x80000000UL)           /*!< SYSPLLVDDFPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_Pos (30UL)                   /*!< SYSPLLVDDHPDNB (Bit 30)                               */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_Msk (0x40000000UL)           /*!< SYSPLLVDDHPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Pos     (29UL)                    /*!< SYSPLLPDB (Bit 29)                                    */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Msk     (0x20000000UL)            /*!< SYSPLLPDB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_VCOSELECT_Pos     (9UL)                     /*!< VCOSELECT (Bit 9)                                     */
#define MCUCTRL_PLLCTL0_VCOSELECT_Msk     (0x200UL)                 /*!< VCOSELECT (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_BYPASS_Pos        (8UL)                     /*!< BYPASS (Bit 8)                                        */
#define MCUCTRL_PLLCTL0_BYPASS_Msk        (0x100UL)                 /*!< BYPASS (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_PLLCTL0_FREFSEL_Pos       (5UL)                     /*!< FREFSEL (Bit 5)                                       */
#define MCUCTRL_PLLCTL0_FREFSEL_Msk       (0x20UL)                  /*!< FREFSEL (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_PLLCTL0_DACPD_Pos         (4UL)                     /*!< DACPD (Bit 4)                                         */
#define MCUCTRL_PLLCTL0_DACPD_Msk         (0x10UL)                  /*!< DACPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_DSMPD_Pos         (3UL)                     /*!< DSMPD (Bit 3)                                         */
#define MCUCTRL_PLLCTL0_DSMPD_Msk         (0x8UL)                   /*!< DSMPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Pos  (2UL)                     /*!< FOUT4PHASEPD (Bit 2)                                  */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Msk  (0x4UL)                   /*!< FOUT4PHASEPD (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Pos (1UL)                     /*!< FOUTPOSTDIVPD (Bit 1)                                 */
#define MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Msk (0x2UL)                   /*!< FOUTPOSTDIVPD (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PLLCTL0_FOUTVCOPD_Pos     (0UL)                     /*!< FOUTVCOPD (Bit 0)                                     */
#define MCUCTRL_PLLCTL0_FOUTVCOPD_Msk     (0x1UL)                   /*!< FOUTVCOPD (Bitfield-Mask: 0x01)                       */
/* ========================================================  PLLDIV0  ======================================================== */
#define MCUCTRL_PLLDIV0_FRAC_Pos          (0UL)                     /*!< FRAC (Bit 0)                                          */
#define MCUCTRL_PLLDIV0_FRAC_Msk          (0xffffffUL)              /*!< FRAC (Bitfield-Mask: 0xffffff)                        */
/* ========================================================  PLLDIV1  ======================================================== */
#define MCUCTRL_PLLDIV1_FBDIV_Pos         (16UL)                    /*!< FBDIV (Bit 16)                                        */
#define MCUCTRL_PLLDIV1_FBDIV_Msk         (0xfff0000UL)             /*!< FBDIV (Bitfield-Mask: 0xfff)                          */
#define MCUCTRL_PLLDIV1_POSTDIV1_Pos      (12UL)                    /*!< POSTDIV1 (Bit 12)                                     */
#define MCUCTRL_PLLDIV1_POSTDIV1_Msk      (0x7000UL)                /*!< POSTDIV1 (Bitfield-Mask: 0x07)                        */
#define MCUCTRL_PLLDIV1_POSTDIV2_Pos      (8UL)                     /*!< POSTDIV2 (Bit 8)                                      */
#define MCUCTRL_PLLDIV1_POSTDIV2_Msk      (0x700UL)                 /*!< POSTDIV2 (Bitfield-Mask: 0x07)                        */
#define MCUCTRL_PLLDIV1_REFDIV_Pos        (0UL)                     /*!< REFDIV (Bit 0)                                        */
#define MCUCTRL_PLLDIV1_REFDIV_Msk        (0x3fUL)                  /*!< REFDIV (Bitfield-Mask: 0x3f)                          */
/* ========================================================  PLLSTAT  ======================================================== */
#define MCUCTRL_PLLSTAT_LOCK_Pos          (0UL)                     /*!< LOCK (Bit 0)                                          */
#define MCUCTRL_PLLSTAT_LOCK_Msk          (0x1UL)                   /*!< LOCK (Bitfield-Mask: 0x01)                            */
/* =======================================================  PLLMUXCTL  ======================================================= */
#define MCUCTRL_PLLMUXCTL_I2S1PLLCLKSEL_Pos (7UL)                   /*!< I2S1PLLCLKSEL (Bit 7)                                 */
#define MCUCTRL_PLLMUXCTL_I2S1PLLCLKSEL_Msk (0x180UL)               /*!< I2S1PLLCLKSEL (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_Pos (5UL)                   /*!< I2S0PLLCLKSEL (Bit 5)                                 */
#define MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_Msk (0x60UL)                /*!< I2S0PLLCLKSEL (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_Pos (4UL)                    /*!< USBPLLCLKSEL (Bit 4)                                  */
#define MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_Msk (0x10UL)                 /*!< USBPLLCLKSEL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PLLMUXCTL_AUDADCPLLCLKSEL_Pos (2UL)                 /*!< AUDADCPLLCLKSEL (Bit 2)                               */
#define MCUCTRL_PLLMUXCTL_AUDADCPLLCLKSEL_Msk (0xcUL)               /*!< AUDADCPLLCLKSEL (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_Pos (0UL)                    /*!< PDMPLLCLKSEL (Bit 0)                                  */
#define MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_Msk (0x3UL)                  /*!< PDMPLLCLKSEL (Bitfield-Mask: 0x03)                    */


/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

