zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define MSPI0_INTCLR_TXE_Pos              (1UL)                     /*!< TXE (Bit 1)                                           */
#define MSPI0_INTCLR_TXE_Msk              (0x2UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTCLR_CMDCMP_Pos           (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define MSPI0_INTCLR_CMDCMP_Msk           (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define MSPI0_INTSET_APBDMAERR_Pos        (13UL)                    /*!< APBDMAERR (Bit 13)                                    */
#define MSPI0_INTSET_APBDMAERR_Msk        (0x2000UL)                /*!< APBDMAERR (Bitfield-Mask: 0x01)                       */
#define MSPI0_INTSET_SCRERR_Pos           (12UL)                    /*!< SCRERR (Bit 12)                                       */
#define MSPI0_INTSET_SCRERR_Msk           (0x1000UL)                /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_INTSET_CQERR_Pos            (11UL)                    /*!< CQERR (Bit 11)                                        */
#define MSPI0_INTSET_CQERR_Msk            (0x800UL)                 /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSET_CQPAUSED_Pos         (10UL)                    /*!< CQPAUSED (Bit 10)                                     */
#define MSPI0_INTSET_CQPAUSED_Msk         (0x400UL)                 /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_INTSET_CQUPD_Pos            (9UL)                     /*!< CQUPD (Bit 9)                                         */
#define MSPI0_INTSET_CQUPD_Msk            (0x200UL)                 /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSET_CQCMP_Pos            (8UL)                     /*!< CQCMP (Bit 8)                                         */
#define MSPI0_INTSET_CQCMP_Msk            (0x100UL)                 /*!< CQCMP (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSET_DERR_Pos             (7UL)                     /*!< DERR (Bit 7)                                          */
#define MSPI0_INTSET_DERR_Msk             (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTSET_DCMP_Pos             (6UL)                     /*!< DCMP (Bit 6)                                          */
#define MSPI0_INTSET_DCMP_Msk             (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTSET_RXF_Pos              (5UL)                     /*!< RXF (Bit 5)                                           */
#define MSPI0_INTSET_RXF_Msk              (0x20UL)                  /*!< RXF (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSET_RXO_Pos              (4UL)                     /*!< RXO (Bit 4)                                           */
#define MSPI0_INTSET_RXO_Msk              (0x10UL)                  /*!< RXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSET_RXU_Pos              (3UL)                     /*!< RXU (Bit 3)                                           */
#define MSPI0_INTSET_RXU_Msk              (0x8UL)                   /*!< RXU (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSET_TXO_Pos              (2UL)                     /*!< TXO (Bit 2)                                           */
#define MSPI0_INTSET_TXO_Msk              (0x4UL)                   /*!< TXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSET_TXE_Pos              (1UL)                     /*!< TXE (Bit 1)                                           */
#define MSPI0_INTSET_TXE_Msk              (0x2UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSET_CMDCMP_Pos           (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define MSPI0_INTSET_CMDCMP_Msk           (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* =========================================================  CQCFG  ========================================================= */
#define MSPI0_CQCFG_CQPAUSEOP_Pos         (4UL)                     /*!< CQPAUSEOP (Bit 4)                                     */
#define MSPI0_CQCFG_CQPAUSEOP_Msk         (0x10UL)                  /*!< CQPAUSEOP (Bitfield-Mask: 0x01)                       */
#define MSPI0_CQCFG_CQAUTOCLEARMASK_Pos   (3UL)                     /*!< CQAUTOCLEARMASK (Bit 3)                               */
#define MSPI0_CQCFG_CQAUTOCLEARMASK_Msk   (0x8UL)                   /*!< CQAUTOCLEARMASK (Bitfield-Mask: 0x01)                 */
#define MSPI0_CQCFG_CQPWROFF_Pos          (2UL)                     /*!< CQPWROFF (Bit 2)                                      */
#define MSPI0_CQCFG_CQPWROFF_Msk          (0x4UL)                   /*!< CQPWROFF (Bitfield-Mask: 0x01)                        */
#define MSPI0_CQCFG_CQPRI_Pos             (1UL)                     /*!< CQPRI (Bit 1)                                         */
#define MSPI0_CQCFG_CQPRI_Msk             (0x2UL)                   /*!< CQPRI (Bitfield-Mask: 0x01)                           */
#define MSPI0_CQCFG_CQEN_Pos              (0UL)                     /*!< CQEN (Bit 0)                                          */
#define MSPI0_CQCFG_CQEN_Msk              (0x1UL)                   /*!< CQEN (Bitfield-Mask: 0x01)                            */
/* ========================================================  CQADDR  ========================================================= */
#define MSPI0_CQADDR_CQADDR_Pos           (0UL)                     /*!< CQADDR (Bit 0)                                        */
#define MSPI0_CQADDR_CQADDR_Msk           (0xffffffffUL)            /*!< CQADDR (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  CQSTAT  ========================================================= */
#define MSPI0_CQSTAT_CQPAUSED_Pos         (3UL)                     /*!< CQPAUSED (Bit 3)                                      */
#define MSPI0_CQSTAT_CQPAUSED_Msk         (0x8UL)                   /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_CQSTAT_CQERR_Pos            (2UL)                     /*!< CQERR (Bit 2)                                         */
#define MSPI0_CQSTAT_CQERR_Msk            (0x4UL)                   /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_CQSTAT_CQCPL_Pos            (1UL)                     /*!< CQCPL (Bit 1)                                         */
#define MSPI0_CQSTAT_CQCPL_Msk            (0x2UL)                   /*!< CQCPL (Bitfield-Mask: 0x01)                           */
#define MSPI0_CQSTAT_CQTIP_Pos            (0UL)                     /*!< CQTIP (Bit 0)                                         */
#define MSPI0_CQSTAT_CQTIP_Msk            (0x1UL)                   /*!< CQTIP (Bitfield-Mask: 0x01)                           */
/* ========================================================  CQFLAGS  ======================================================== */
#define MSPI0_CQFLAGS_CQFLAGS_Pos         (0UL)                     /*!< CQFLAGS (Bit 0)                                       */
#define MSPI0_CQFLAGS_CQFLAGS_Msk         (0xffffUL)                /*!< CQFLAGS (Bitfield-Mask: 0xffff)                       */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define MSPI0_CQSETCLEAR_CQFCLR_Pos       (16UL)                    /*!< CQFCLR (Bit 16)                                       */
#define MSPI0_CQSETCLEAR_CQFCLR_Msk       (0xff0000UL)              /*!< CQFCLR (Bitfield-Mask: 0xff)                          */
#define MSPI0_CQSETCLEAR_CQFTOGGLE_Pos    (8UL)                     /*!< CQFTOGGLE (Bit 8)                                     */
#define MSPI0_CQSETCLEAR_CQFTOGGLE_Msk    (0xff00UL)                /*!< CQFTOGGLE (Bitfield-Mask: 0xff)                       */
#define MSPI0_CQSETCLEAR_CQFSET_Pos       (0UL)                     /*!< CQFSET (Bit 0)                                        */
#define MSPI0_CQSETCLEAR_CQFSET_Msk       (0xffUL)                  /*!< CQFSET (Bitfield-Mask: 0xff)                          */
/* ========================================================  CQPAUSE  ======================================================== */
#define MSPI0_CQPAUSE_CQMASK_Pos          (0UL)                     /*!< CQMASK (Bit 0)                                        */
#define MSPI0_CQPAUSE_CQMASK_Msk          (0xffffUL)                /*!< CQMASK (Bitfield-Mask: 0xffff)                        */
/* =======================================================  CQCURIDX  ======================================================== */
#define MSPI0_CQCURIDX_CQCURIDX_Pos       (0UL)                     /*!< CQCURIDX (Bit 0)                                      */
#define MSPI0_CQCURIDX_CQCURIDX_Msk       (0xffUL)                  /*!< CQCURIDX (Bitfield-Mask: 0xff)                        */
/* =======================================================  CQENDIDX  ======================================================== */
#define MSPI0_CQENDIDX_CQENDIDX_Pos       (0UL)                     /*!< CQENDIDX (Bit 0)                                      */
#define MSPI0_CQENDIDX_CQENDIDX_Msk       (0xffUL)                  /*!< CQENDIDX (Bitfield-Mask: 0xff)                        */


/* =========================================================================================================================== */
/* ================                                            OTP                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  RNG  ========================================================== */
#define OTP_RNG_DATA_Pos                  (0UL)                     /*!< DATA (Bit 0)                                          */
#define OTP_RNG_DATA_Msk                  (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  INTERRUPT  ======================================================= */
#define OTP_INTERRUPT_IERNGCLKOFF_Pos     (25UL)                    /*!< IERNGCLKOFF (Bit 25)                                  */
#define OTP_INTERRUPT_IERNGCLKOFF_Msk     (0x2000000UL)             /*!< IERNGCLKOFF (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_IERNGFAIL_Pos       (24UL)                    /*!< IERNGFAIL (Bit 24)                                    */
#define OTP_INTERRUPT_IERNGFAIL_Msk       (0x1000000UL)             /*!< IERNGFAIL (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_IEPARITYCRITREG_Pos (22UL)                    /*!< IEPARITYCRITREG (Bit 22)                              */
#define OTP_INTERRUPT_IEPARITYCRITREG_Msk (0x400000UL)              /*!< IEPARITYCRITREG (Bitfield-Mask: 0x01)                 */
#define OTP_INTERRUPT_IEPARITYPSM_Pos     (21UL)                    /*!< IEPARITYPSM (Bit 21)                                  */
#define OTP_INTERRUPT_IEPARITYPSM_Msk     (0x200000UL)              /*!< IEPARITYPSM (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_IEACCESSPERMISSION_Pos (20UL)                 /*!< IEACCESSPERMISSION (Bit 20)                           */
#define OTP_INTERRUPT_IEACCESSPERMISSION_Msk (0x100000UL)           /*!< IEACCESSPERMISSION (Bitfield-Mask: 0x01)              */
#define OTP_INTERRUPT_IESHIELFFAULT_Pos   (19UL)                    /*!< IESHIELFFAULT (Bit 19)                                */
#define OTP_INTERRUPT_IESHIELFFAULT_Msk   (0x80000UL)               /*!< IESHIELFFAULT (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_IEPARITYINPUT_Pos   (18UL)                    /*!< IEPARITYINPUT (Bit 18)                                */
#define OTP_INTERRUPT_IEPARITYINPUT_Msk   (0x40000UL)               /*!< IEPARITYINPUT (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_IEOUTDATA_Pos       (17UL)                    /*!< IEOUTDATA (Bit 17)                                    */
#define OTP_INTERRUPT_IEOUTDATA_Msk       (0x20000UL)               /*!< IEOUTDATA (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_IEPWRSUPPLY_Pos     (16UL)                    /*!< IEPWRSUPPLY (Bit 16)                                  */
#define OTP_INTERRUPT_IEPWRSUPPLY_Msk     (0x10000UL)               /*!< IEPWRSUPPLY (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_RNGCLKOFF_Pos       (9UL)                     /*!< RNGCLKOFF (Bit 9)                                     */
#define OTP_INTERRUPT_RNGCLKOFF_Msk       (0x200UL)                 /*!< RNGCLKOFF (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_RNGFAIL_Pos         (8UL)                     /*!< RNGFAIL (Bit 8)                                       */
#define OTP_INTERRUPT_RNGFAIL_Msk         (0x100UL)                 /*!< RNGFAIL (Bitfield-Mask: 0x01)                         */
#define OTP_INTERRUPT_PARITYCRITREG_Pos   (6UL)                     /*!< PARITYCRITREG (Bit 6)                                 */
#define OTP_INTERRUPT_PARITYCRITREG_Msk   (0x40UL)                  /*!< PARITYCRITREG (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_PARITYPSM_Pos       (5UL)                     /*!< PARITYPSM (Bit 5)                                     */
#define OTP_INTERRUPT_PARITYPSM_Msk       (0x20UL)                  /*!< PARITYPSM (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_ACCESSPERMISSION_Pos (4UL)                    /*!< ACCESSPERMISSION (Bit 4)                              */
#define OTP_INTERRUPT_ACCESSPERMISSION_Msk (0x10UL)                 /*!< ACCESSPERMISSION (Bitfield-Mask: 0x01)                */
#define OTP_INTERRUPT_SHIELDFAULT_Pos     (3UL)                     /*!< SHIELDFAULT (Bit 3)                                   */
#define OTP_INTERRUPT_SHIELDFAULT_Msk     (0x8UL)                   /*!< SHIELDFAULT (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_PARITYINPUT_Pos     (2UL)                     /*!< PARITYINPUT (Bit 2)                                   */
#define OTP_INTERRUPT_PARITYINPUT_Msk     (0x4UL)                   /*!< PARITYINPUT (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_OUTDATA_Pos         (1UL)                     /*!< OUTDATA (Bit 1)                                       */
#define OTP_INTERRUPT_OUTDATA_Msk         (0x2UL)                   /*!< OUTDATA (Bitfield-Mask: 0x01)                         */
#define OTP_INTERRUPT_PWRSUPPLY_Pos       (0UL)                     /*!< PWRSUPPLY (Bit 0)                                     */
#define OTP_INTERRUPT_PWRSUPPLY_Msk       (0x1UL)                   /*!< PWRSUPPLY (Bitfield-Mask: 0x01)                       */
/* ========================================================  PTMSTAT  ======================================================== */
#define OTP_PTMSTAT_FAILCNT_Pos           (8UL)                     /*!< FAILCNT (Bit 8)                                       */
#define OTP_PTMSTAT_FAILCNT_Msk           (0xf00UL)                 /*!< FAILCNT (Bitfield-Mask: 0x0f)                         */
#define OTP_PTMSTAT_FORBID_Pos            (4UL)                     /*!< FORBID (Bit 4)                                        */
#define OTP_PTMSTAT_FORBID_Msk            (0x10UL)                  /*!< FORBID (Bitfield-Mask: 0x01)                          */
#define OTP_PTMSTAT_INCORRECT_Pos         (3UL)                     /*!< INCORRECT (Bit 3)                                     */
#define OTP_PTMSTAT_INCORRECT_Msk         (0x8UL)                   /*!< INCORRECT (Bitfield-Mask: 0x01)                       */
#define OTP_PTMSTAT_WARNING_Pos           (2UL)                     /*!< WARNING (Bit 2)                                       */
#define OTP_PTMSTAT_WARNING_Msk           (0x4UL)                   /*!< WARNING (Bitfield-Mask: 0x01)                         */
#define OTP_PTMSTAT_PTM_ERROR_Pos         (1UL)                     /*!< PTM_ERROR (Bit 1)                                     */
#define OTP_PTMSTAT_PTM_ERROR_Msk         (0x2UL)                   /*!< PTM_ERROR (Bitfield-Mask: 0x01)                       */
#define OTP_PTMSTAT_BUSY_Pos              (0UL)                     /*!< BUSY (Bit 0)                                          */
#define OTP_PTMSTAT_BUSY_Msk              (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* ========================================================  PUFUID  ========================================================= */
#define OTP_PUFUID_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define OTP_PUFUID_DATA_Msk               (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                           PDM0                                            ================ */
/* =========================================================================================================================== */

