zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
#define USB_ADMATOTCOUNT5_ADMATOTCOUNT5_Pos (0UL)                   /*!< ADMATOTCOUNT5 (Bit 0)                                 */
#define USB_ADMATOTCOUNT5_ADMATOTCOUNT5_Msk (0xffffffUL)            /*!< ADMATOTCOUNT5 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT6  ===================================================== */
#define USB_ADMATOTCOUNT6_ADMATOTCOUNT6_Pos (0UL)                   /*!< ADMATOTCOUNT6 (Bit 0)                                 */
#define USB_ADMATOTCOUNT6_ADMATOTCOUNT6_Msk (0xffffffUL)            /*!< ADMATOTCOUNT6 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT7  ===================================================== */
#define USB_ADMATOTCOUNT7_ADMATOTCOUNT7_Pos (0UL)                   /*!< ADMATOTCOUNT7 (Bit 0)                                 */
#define USB_ADMATOTCOUNT7_ADMATOTCOUNT7_Msk (0xffffffUL)            /*!< ADMATOTCOUNT7 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT8  ===================================================== */
#define USB_ADMATOTCOUNT8_ADMATOTCOUNT8_Pos (0UL)                   /*!< ADMATOTCOUNT8 (Bit 0)                                 */
#define USB_ADMATOTCOUNT8_ADMATOTCOUNT8_Msk (0xffffffUL)            /*!< ADMATOTCOUNT8 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT9  ===================================================== */
#define USB_ADMATOTCOUNT9_ADMATOTCOUNT9_Pos (0UL)                   /*!< ADMATOTCOUNT9 (Bit 0)                                 */
#define USB_ADMATOTCOUNT9_ADMATOTCOUNT9_Msk (0xffffffUL)            /*!< ADMATOTCOUNT9 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATARGADDR0  ===================================================== */
#define USB_ADMATARGADDR0_ADMATARGADDR0_Pos (0UL)                   /*!< ADMATARGADDR0 (Bit 0)                                 */
#define USB_ADMATARGADDR0_ADMATARGADDR0_Msk (0xffffffffUL)          /*!< ADMATARGADDR0 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR1  ===================================================== */
#define USB_ADMATARGADDR1_ADMATARGADDR1_Pos (0UL)                   /*!< ADMATARGADDR1 (Bit 0)                                 */
#define USB_ADMATARGADDR1_ADMATARGADDR1_Msk (0xffffffffUL)          /*!< ADMATARGADDR1 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR2  ===================================================== */
#define USB_ADMATARGADDR2_ADMATARGADDR2_Pos (0UL)                   /*!< ADMATARGADDR2 (Bit 0)                                 */
#define USB_ADMATARGADDR2_ADMATARGADDR2_Msk (0xffffffffUL)          /*!< ADMATARGADDR2 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR3  ===================================================== */
#define USB_ADMATARGADDR3_ADMATARGADDR3_Pos (0UL)                   /*!< ADMATARGADDR3 (Bit 0)                                 */
#define USB_ADMATARGADDR3_ADMATARGADDR3_Msk (0xffffffffUL)          /*!< ADMATARGADDR3 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR4  ===================================================== */
#define USB_ADMATARGADDR4_ADMATARGADDR4_Pos (0UL)                   /*!< ADMATARGADDR4 (Bit 0)                                 */
#define USB_ADMATARGADDR4_ADMATARGADDR4_Msk (0xffffffffUL)          /*!< ADMATARGADDR4 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR5  ===================================================== */
#define USB_ADMATARGADDR5_ADMATARGADDR5_Pos (0UL)                   /*!< ADMATARGADDR5 (Bit 0)                                 */
#define USB_ADMATARGADDR5_ADMATARGADDR5_Msk (0xffffffffUL)          /*!< ADMATARGADDR5 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR6  ===================================================== */
#define USB_ADMATARGADDR6_ADMATARGADDR6_Pos (0UL)                   /*!< ADMATARGADDR6 (Bit 0)                                 */
#define USB_ADMATARGADDR6_ADMATARGADDR6_Msk (0xffffffffUL)          /*!< ADMATARGADDR6 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR7  ===================================================== */
#define USB_ADMATARGADDR7_ADMATARGADDR7_Pos (0UL)                   /*!< ADMATARGADDR7 (Bit 0)                                 */
#define USB_ADMATARGADDR7_ADMATARGADDR7_Msk (0xffffffffUL)          /*!< ADMATARGADDR7 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR8  ===================================================== */
#define USB_ADMATARGADDR8_ADMATARGADDR8_Pos (0UL)                   /*!< ADMATARGADDR8 (Bit 0)                                 */
#define USB_ADMATARGADDR8_ADMATARGADDR8_Msk (0xffffffffUL)          /*!< ADMATARGADDR8 (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  ADMATARGADDR9  ===================================================== */
#define USB_ADMATARGADDR9_ADMATARGADDR9_Pos (0UL)                   /*!< ADMATARGADDR9 (Bit 0)                                 */
#define USB_ADMATARGADDR9_ADMATARGADDR9_Msk (0xffffffffUL)          /*!< ADMATARGADDR9 (Bitfield-Mask: 0xffffffff)             */
/* ========================================================  ADMAEP0  ======================================================== */
#define USB_ADMAEP0_ADMAEP0_Pos           (0UL)                     /*!< ADMAEP0 (Bit 0)                                       */
#define USB_ADMAEP0_ADMAEP0_Msk           (0x7UL)                   /*!< ADMAEP0 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP1  ======================================================== */
#define USB_ADMAEP1_ADMAEP1_Pos           (0UL)                     /*!< ADMAEP1 (Bit 0)                                       */
#define USB_ADMAEP1_ADMAEP1_Msk           (0x7UL)                   /*!< ADMAEP1 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP2  ======================================================== */
#define USB_ADMAEP2_ADMAEP2_Pos           (0UL)                     /*!< ADMAEP2 (Bit 0)                                       */
#define USB_ADMAEP2_ADMAEP2_Msk           (0x7UL)                   /*!< ADMAEP2 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP3  ======================================================== */
#define USB_ADMAEP3_ADMAEP3_Pos           (0UL)                     /*!< ADMAEP3 (Bit 0)                                       */
#define USB_ADMAEP3_ADMAEP3_Msk           (0x7UL)                   /*!< ADMAEP3 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP4  ======================================================== */
#define USB_ADMAEP4_ADMAEP4_Pos           (0UL)                     /*!< ADMAEP4 (Bit 0)                                       */
#define USB_ADMAEP4_ADMAEP4_Msk           (0x7UL)                   /*!< ADMAEP4 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP5  ======================================================== */
#define USB_ADMAEP5_ADMAEP5_Pos           (0UL)                     /*!< ADMAEP5 (Bit 0)                                       */
#define USB_ADMAEP5_ADMAEP5_Msk           (0x7UL)                   /*!< ADMAEP5 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP6  ======================================================== */
#define USB_ADMAEP6_ADMAEP6_Pos           (0UL)                     /*!< ADMAEP6 (Bit 0)                                       */
#define USB_ADMAEP6_ADMAEP6_Msk           (0x7UL)                   /*!< ADMAEP6 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP7  ======================================================== */
#define USB_ADMAEP7_ADMAEP7_Pos           (0UL)                     /*!< ADMAEP7 (Bit 0)                                       */
#define USB_ADMAEP7_ADMAEP7_Msk           (0x7UL)                   /*!< ADMAEP7 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP8  ======================================================== */
#define USB_ADMAEP8_ADMAEP8_Pos           (0UL)                     /*!< ADMAEP8 (Bit 0)                                       */
#define USB_ADMAEP8_ADMAEP8_Msk           (0x7UL)                   /*!< ADMAEP8 (Bitfield-Mask: 0x07)                         */
/* ========================================================  ADMAEP9  ======================================================== */
#define USB_ADMAEP9_ADMAEP9_Pos           (0UL)                     /*!< ADMAEP9 (Bit 0)                                       */
#define USB_ADMAEP9_ADMAEP9_Msk           (0x7UL)                   /*!< ADMAEP9 (Bitfield-Mask: 0x07)                         */
/* =====================================================  ADMAREQSIZE0  ====================================================== */
#define USB_ADMAREQSIZE0_ADMAREQSIZE0_Pos (0UL)                     /*!< ADMAREQSIZE0 (Bit 0)                                  */
#define USB_ADMAREQSIZE0_ADMAREQSIZE0_Msk (0xfffUL)                 /*!< ADMAREQSIZE0 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE1  ====================================================== */
#define USB_ADMAREQSIZE1_ADMAREQSIZE1_Pos (0UL)                     /*!< ADMAREQSIZE1 (Bit 0)                                  */
#define USB_ADMAREQSIZE1_ADMAREQSIZE1_Msk (0xfffUL)                 /*!< ADMAREQSIZE1 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE2  ====================================================== */
#define USB_ADMAREQSIZE2_ADMAREQSIZE2_Pos (0UL)                     /*!< ADMAREQSIZE2 (Bit 0)                                  */
#define USB_ADMAREQSIZE2_ADMAREQSIZE2_Msk (0xfffUL)                 /*!< ADMAREQSIZE2 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE3  ====================================================== */
#define USB_ADMAREQSIZE3_ADMAREQSIZE3_Pos (0UL)                     /*!< ADMAREQSIZE3 (Bit 0)                                  */
#define USB_ADMAREQSIZE3_ADMAREQSIZE3_Msk (0xfffUL)                 /*!< ADMAREQSIZE3 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE4  ====================================================== */
#define USB_ADMAREQSIZE4_ADMAREQSIZE4_Pos (0UL)                     /*!< ADMAREQSIZE4 (Bit 0)                                  */
#define USB_ADMAREQSIZE4_ADMAREQSIZE4_Msk (0xfffUL)                 /*!< ADMAREQSIZE4 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE5  ====================================================== */
#define USB_ADMAREQSIZE5_ADMAREQSIZE5_Pos (0UL)                     /*!< ADMAREQSIZE5 (Bit 0)                                  */
#define USB_ADMAREQSIZE5_ADMAREQSIZE5_Msk (0xfffUL)                 /*!< ADMAREQSIZE5 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE6  ====================================================== */
#define USB_ADMAREQSIZE6_ADMAREQSIZE6_Pos (0UL)                     /*!< ADMAREQSIZE6 (Bit 0)                                  */
#define USB_ADMAREQSIZE6_ADMAREQSIZE6_Msk (0xfffUL)                 /*!< ADMAREQSIZE6 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE7  ====================================================== */
#define USB_ADMAREQSIZE7_ADMAREQSIZE7_Pos (0UL)                     /*!< ADMAREQSIZE7 (Bit 0)                                  */
#define USB_ADMAREQSIZE7_ADMAREQSIZE7_Msk (0xfffUL)                 /*!< ADMAREQSIZE7 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE8  ====================================================== */
#define USB_ADMAREQSIZE8_ADMAREQSIZE8_Pos (0UL)                     /*!< ADMAREQSIZE8 (Bit 0)                                  */
#define USB_ADMAREQSIZE8_ADMAREQSIZE8_Msk (0xfffUL)                 /*!< ADMAREQSIZE8 (Bitfield-Mask: 0xfff)                   */
/* =====================================================  ADMAREQSIZE9  ====================================================== */
#define USB_ADMAREQSIZE9_ADMAREQSIZE9_Pos (0UL)                     /*!< ADMAREQSIZE9 (Bit 0)                                  */
#define USB_ADMAREQSIZE9_ADMAREQSIZE9_Msk (0xfffUL)                 /*!< ADMAREQSIZE9 (Bitfield-Mask: 0xfff)                   */


/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
#define VCOMP_CFG_LVLSEL_Pos              (16UL)                    /*!< LVLSEL (Bit 16)                                       */
#define VCOMP_CFG_LVLSEL_Msk              (0xf0000UL)               /*!< LVLSEL (Bitfield-Mask: 0x0f)                          */
#define VCOMP_CFG_NSEL_Pos                (8UL)                     /*!< NSEL (Bit 8)                                          */
#define VCOMP_CFG_NSEL_Msk                (0x300UL)                 /*!< NSEL (Bitfield-Mask: 0x03)                            */
#define VCOMP_CFG_PSEL_Pos                (0UL)                     /*!< PSEL (Bit 0)                                          */
#define VCOMP_CFG_PSEL_Msk                (0x3UL)                   /*!< PSEL (Bitfield-Mask: 0x03)                            */
/* =========================================================  STAT  ========================================================== */
#define VCOMP_STAT_PWDSTAT_Pos            (1UL)                     /*!< PWDSTAT (Bit 1)                                       */
#define VCOMP_STAT_PWDSTAT_Msk            (0x2UL)                   /*!< PWDSTAT (Bitfield-Mask: 0x01)                         */
#define VCOMP_STAT_CMPOUT_Pos             (0UL)                     /*!< CMPOUT (Bit 0)                                        */
#define VCOMP_STAT_CMPOUT_Msk             (0x1UL)                   /*!< CMPOUT (Bitfield-Mask: 0x01)                          */
/* ========================================================  PWDKEY  ========================================================= */
#define VCOMP_PWDKEY_PWDKEY_Pos           (0UL)                     /*!< PWDKEY (Bit 0)                                        */
#define VCOMP_PWDKEY_PWDKEY_Msk           (0xffffffffUL)            /*!< PWDKEY (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  INTEN  ========================================================= */
#define VCOMP_INTEN_OUTHI_Pos             (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTEN_OUTHI_Msk             (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTEN_OUTLOW_Pos            (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTEN_OUTLOW_Msk            (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define VCOMP_INTSTAT_OUTHI_Pos           (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTSTAT_OUTHI_Msk           (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTSTAT_OUTLOW_Pos          (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTSTAT_OUTLOW_Msk          (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define VCOMP_INTCLR_OUTHI_Pos            (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTCLR_OUTHI_Msk            (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTCLR_OUTLOW_Pos           (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTCLR_OUTLOW_Msk           (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define VCOMP_INTSET_OUTHI_Pos            (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTSET_OUTHI_Msk            (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTSET_OUTLOW_Pos           (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTSET_OUTLOW_Msk           (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
#define WDT_CFG_CLKSEL_Pos                (24UL)                    /*!< CLKSEL (Bit 24)                                       */
#define WDT_CFG_CLKSEL_Msk                (0x7000000UL)             /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define WDT_CFG_INTVAL_Pos                (16UL)                    /*!< INTVAL (Bit 16)                                       */
#define WDT_CFG_INTVAL_Msk                (0xff0000UL)              /*!< INTVAL (Bitfield-Mask: 0xff)                          */
#define WDT_CFG_RESVAL_Pos                (8UL)                     /*!< RESVAL (Bit 8)                                        */
#define WDT_CFG_RESVAL_Msk                (0xff00UL)                /*!< RESVAL (Bitfield-Mask: 0xff)                          */
#define WDT_CFG_RESEN_Pos                 (2UL)                     /*!< RESEN (Bit 2)                                         */
#define WDT_CFG_RESEN_Msk                 (0x4UL)                   /*!< RESEN (Bitfield-Mask: 0x01)                           */
#define WDT_CFG_INTEN_Pos                 (1UL)                     /*!< INTEN (Bit 1)                                         */
#define WDT_CFG_INTEN_Msk                 (0x2UL)                   /*!< INTEN (Bitfield-Mask: 0x01)                           */
#define WDT_CFG_WDTEN_Pos                 (0UL)                     /*!< WDTEN (Bit 0)                                         */
#define WDT_CFG_WDTEN_Msk                 (0x1UL)                   /*!< WDTEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  RSTRT  ========================================================= */
#define WDT_RSTRT_RSTRT_Pos               (0UL)                     /*!< RSTRT (Bit 0)                                         */
#define WDT_RSTRT_RSTRT_Msk               (0xffUL)                  /*!< RSTRT (Bitfield-Mask: 0xff)                           */
/* =========================================================  LOCK  ========================================================== */
#define WDT_LOCK_LOCK_Pos                 (0UL)                     /*!< LOCK (Bit 0)                                          */
#define WDT_LOCK_LOCK_Msk                 (0xffUL)                  /*!< LOCK (Bitfield-Mask: 0xff)                            */
/* =========================================================  COUNT  ========================================================= */
#define WDT_COUNT_COUNT_Pos               (0UL)                     /*!< COUNT (Bit 0)                                         */
#define WDT_COUNT_COUNT_Msk               (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */
/* =======================================================  WDTIEREN  ======================================================== */
#define WDT_WDTIEREN_WDTINT_Pos           (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIEREN_WDTINT_Msk           (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* ======================================================  WDTIERSTAT  ======================================================= */
#define WDT_WDTIERSTAT_WDTINT_Pos         (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERSTAT_WDTINT_Msk         (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERCLR  ======================================================= */
#define WDT_WDTIERCLR_WDTINT_Pos          (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERCLR_WDTINT_Msk          (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERSET  ======================================================= */
#define WDT_WDTIERSET_WDTINT_Pos          (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERSET_WDTINT_Msk          (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



