zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==========================================  CLKGEN DISPCLKCTRL PLLCLKSEL [0..3]  ========================================== */
typedef enum {                                  /*!< CLKGEN_DISPCLKCTRL_PLLCLKSEL                                              */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_OFF     = 0,     /*!< OFF : Static value of 0 selected for DPHY clock input                     */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_HFRC_24MHz = 1,  /*!< HFRC_24MHz : 24MHz sourced from the HFRC                                  */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_HFRC_12MHz = 2,  /*!< HFRC_12MHz : 12MHz sourced from the HFRC                                  */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_XTAL_HS = 3,     /*!< XTAL_HS : High Frequency XTAL input                                       */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_XTAL_HS_div2 = 4,/*!< XTAL_HS_div2 : High Frequency XTAL input divide by 2                      */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_EXTREFCLK = 5,   /*!< EXTREFCLK : External reference clock input                                */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_EXTREFCLK_div2 = 6,/*!< EXTREFCLK_div2 : External reference clock input divide by 2             */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_HFRC_48MHz = 7,  /*!< HFRC_48MHz : 48MHz sourced from the HFRC                                  */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_HFRC_96MHz = 8,  /*!< HFRC_96MHz : 96MHz sourced from the HFRC                                  */
  CLKGEN_DISPCLKCTRL_PLLCLKSEL_HFRC_192MHz = 9, /*!< HFRC_192MHz : 192MHz sourced from the HFRC                                */
} CLKGEN_DISPCLKCTRL_PLLCLKSEL_Enum;

/* =====================================================  CLKGENSPARES  ====================================================== */
/* ===================================================  HFRCIDLECOUNTERS  ==================================================== */
/* =====================================================  MSPIIOCLKCTRL  ===================================================== */
/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI3IOCLKSEL [16..19]  ====================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_HFRC2_125MHz = 9,/*!< HFRC2_125MHz : 125MHz sourced from the HFRC2                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_HFRC2_250MHz = 10,/*!< HFRC2_250MHz : 250MHz sourced from the HFRC2                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_Enum;

/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI3IOCLKEN [15..15]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN_Enum;

/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI2IOCLKSEL [11..14]  ====================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
} CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Enum;

/* ======================================  CLKGEN MSPIIOCLKCTRL MSPI2IOCLKEN [10..10]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKSEL [6..9]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKEN [5..5]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI0IOCLKSEL [1..4]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC2_125MHz = 9,/*!< HFRC2_125MHz : 125MHz sourced from the HFRC2                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC2_250MHz = 10,/*!< HFRC2_250MHz : 250MHz sourced from the HFRC2                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Enum;

