zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ================================================  DC MODE DEPOL [26..26]  ================================================= */
typedef enum {                                  /*!< DC_MODE_DEPOL                                                             */
  DC_MODE_DEPOL_DE_NEG                 = 1,     /*!< DE_NEG : DE polarity is negative                                          */
  DC_MODE_DEPOL_DE_POS                 = 0,     /*!< DE_POS : DE polarity is positive                                          */
} DC_MODE_DEPOL_Enum;

/* ===============================================  DC MODE DITHEREN [24..25]  =============================================== */
typedef enum {                                  /*!< DC_MODE_DITHEREN                                                          */
  DC_MODE_DITHEREN_DISDITHER           = 0,     /*!< DISDITHER : Dithering is disabled                                         */
  DC_MODE_DITHEREN_DITTHER18b          = 1,     /*!< DITTHER18b : Dithering 18-bits mode                                       */
  DC_MODE_DITHEREN_DITTHER16b          = 2,     /*!< DITTHER16b : Dithering 16-bits mode                                       */
  DC_MODE_DITHEREN_DITTHER15b          = 3,     /*!< DITTHER15b : Dithering 15-bits mode                                       */
} DC_MODE_DITHEREN_Enum;

/* ================================================  DC MODE RGBCFG [12..14]  ================================================ */
typedef enum {                                  /*!< DC_MODE_RGBCFG                                                            */
  DC_MODE_RGBCFG_RGB56516bit3          = 5,     /*!< RGB56516bit3 : RGB565 16-bits Configuration 3                             */
  DC_MODE_RGBCFG_RGB56516bit2          = 4,     /*!< RGB56516bit2 : RGB565 16-bits Configuration 2                             */
  DC_MODE_RGBCFG_RGB56516bit1          = 3,     /*!< RGB56516bit1 : RGB565 16-bits Configuration 1                             */
  DC_MODE_RGBCFG_RGB66618bit2          = 2,     /*!< RGB66618bit2 : RGB666 18-bits Configuration 2                             */
  DC_MODE_RGBCFG_RGB66618bit1          = 1,     /*!< RGB66618bit1 : RGB666 18-bits Configuration 1                             */
  DC_MODE_RGBCFG_RGB88824bit           = 0,     /*!< RGB88824bit : RGB888 24-bits                                              */
} DC_MODE_RGBCFG_Enum;

/* =================================================  DC MODE COLFMT [9..9]  ================================================= */
typedef enum {                                  /*!< DC_MODE_COLFMT                                                            */
  DC_MODE_COLFMT_YUV_EN                = 1,     /*!< YUV_EN : YUV/YCbCr format is enabled                                      */
  DC_MODE_COLFMT_RGB_EN                = 0,     /*!< RGB_EN : RGB format is enabled                                            */
} DC_MODE_COLFMT_Enum;

/* ================================================  DC MODE DISPFMT [5..8]  ================================================= */
typedef enum {                                  /*!< DC_MODE_DISPFMT                                                           */
  DC_MODE_DISPFMT_DPI                  = 0,     /*!< DPI : DPI Interface                                                       */
  DC_MODE_DISPFMT_BYTE3                = 1,     /*!< BYTE3 : Byte-3 beat Interface                                             */
  DC_MODE_DISPFMT_BYTE4                = 2,     /*!< BYTE4 : Byte-4 beat (RGBX) Interface                                      */
  DC_MODE_DISPFMT_SERIAL               = 3,     /*!< SERIAL : Two phase serial 12-bit                                          */
  DC_MODE_DISPFMT_YUYV                 = 6,     /*!< YUYV : YUYV (16-bit mode)                                                 */
  DC_MODE_DISPFMT_JDI                  = 8,     /*!< JDI : JDI MIP                                                             */
} DC_MODE_DISPFMT_Enum;

/* ========================================================  CLKCTRL  ======================================================== */
/* =============================================  DC CLKCTRL SECCLKDIV [27..31]  ============================================= */
typedef enum {                                  /*!< DC_CLKCTRL_SECCLKDIV                                                      */
  DC_CLKCTRL_SECCLKDIV_SDIV_0          = 0,     /*!< SDIV_0 : No division                                                      */
  DC_CLKCTRL_SECCLKDIV_SDIV_1          = 1,     /*!< SDIV_1 : No division                                                      */
  DC_CLKCTRL_SECCLKDIV_SDIV_2          = 2,     /*!< SDIV_2 : Divided by 2                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_3          = 3,     /*!< SDIV_3 : Divided by 3                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_4          = 4,     /*!< SDIV_4 : Divided by 4                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_5          = 5,     /*!< SDIV_5 : Divided by 5                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_6          = 6,     /*!< SDIV_6 : Divided by 6                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_7          = 7,     /*!< SDIV_7 : Divided by 7                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_8          = 8,     /*!< SDIV_8 : Divided by 8                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_9          = 9,     /*!< SDIV_9 : Divided by 9                                                     */
  DC_CLKCTRL_SECCLKDIV_SDIV_10         = 10,    /*!< SDIV_10 : Divided by 10                                                   */
  DC_CLKCTRL_SECCLKDIV_SDIV_11         = 11,    /*!< SDIV_11 : Divided by 11                                                   */
  DC_CLKCTRL_SECCLKDIV_SDIV_12         = 12,    /*!< SDIV_12 : Divided by 12                                                   */
  DC_CLKCTRL_SECCLKDIV_SDIV_13         = 13,    /*!< SDIV_13 : Divided by 13                                                   */
  DC_CLKCTRL_SECCLKDIV_SDIV_14         = 14,    /*!< SDIV_14 : Divided by 14                                                   */
  DC_CLKCTRL_SECCLKDIV_SDIV_15         = 15,    /*!< SDIV_15 : Divided by 15                                                   */
} DC_CLKCTRL_SECCLKDIV_Enum;

