zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =========================================  DC LAYER3MODE LAYER3COLORMODE [0..4]  ========================================== */
typedef enum {                                  /*!< DC_LAYER3MODE_LAYER3COLORMODE                                             */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_LUTBLE = 0,/*!< LAYER3_LUTBLE : 8-bit color palette look-up table (LUT8)                */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_RGBX5551 = 1,/*!< LAYER3_RGBX5551 : 16-bit RGBX5551 color format                        */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_RGBX8888 = 2,/*!< LAYER3_RGBX8888 : 32-bit RGBX8888 color format                        */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_RGB332 = 4,/*!< LAYER3_RGB332 : 8-bit RGB332 color format                               */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_RGB565 = 5,/*!< LAYER3_RGB565 : 16-bit RGB565 color format                              */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_XRGB8888 = 6,/*!< LAYER3_XRGB8888 : 32-bit XRGB8888 color format                        */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_L8 = 7,  /*!< LAYER3_L8 : L8 Grayscale/Palette format                                   */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_L1 = 8,  /*!< LAYER3_L1 : L1 Grayscale/Palette format                                   */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_L4 = 9,  /*!< LAYER3_L4 : L4 Grayscale/Palette format                                   */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_YUYV = 10,/*!< LAYER3_YUYV : YUYV color format                                          */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_RGB = 11,/*!< LAYER3_RGB : 24-bit RGB color format                                      */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_YUY2 = 12,/*!< LAYER3_YUY2 : YUY2 color format                                          */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_ABGR8888 = 13,/*!< LAYER3_ABGR8888 : 32-bit ABGR8888 color format                       */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_BGRA8888 = 14,/*!< LAYER3_BGRA8888 : 32-bit BGRA8888 color format                       */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_VIDEO420 = 16,/*!< LAYER3_VIDEO420 : Video 420 Mode                                     */
  DC_LAYER3MODE_LAYER3COLORMODE_LAYER3_TRILIN42 = 17,/*!< LAYER3_TRILIN42 : Trilinear 420 Video Mode                           */
} DC_LAYER3MODE_LAYER3COLORMODE_Enum;

/* =====================================================  LAYER3STARTXY  ===================================================== */
/* =====================================================  LAYER3SIZEXY  ====================================================== */
/* ======================================================  LAYER3ADDR  ======================================================= */
/* =====================================================  LAYER3STRIDE  ====================================================== */
/* ======================================  DC LAYER3STRIDE LAYER3AXIFIFOTHLD [19..20]  ======================================= */
typedef enum {                                  /*!< DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD                                         */
  DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_LAYER3_BURST_HALF_SZ = 0,/*!< LAYER3_BURST_HALF_SZ : half fifo (default)                   */
  DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_LAYER3_BURST_2 = 1,/*!< LAYER3_BURST_2 : 2 burst-size                                      */
  DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_LAYER3_BURST_4 = 2,/*!< LAYER3_BURST_4 : 4 burst-size                                      */
  DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_LAYER3_BURST_8 = 3,/*!< LAYER3_BURST_8 : 8 burst-size                                      */
} DC_LAYER3STRIDE_LAYER3AXIFIFOTHLD_Enum;

/* ======================================  DC LAYER3STRIDE LAYER3AXIBURSTBITS [16..18]  ====================================== */
typedef enum {                                  /*!< DC_LAYER3STRIDE_LAYER3AXIBURSTBITS                                        */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_DEF = 0,/*!< LAYER3_BEATS_DEF : 16-beats (default)                           */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_2 = 1,/*!< LAYER3_BEATS_2 : 2-beats                                          */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_4 = 2,/*!< LAYER3_BEATS_4 : 4-beats                                          */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_8 = 3,/*!< LAYER3_BEATS_8 : 8-beats                                          */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_16 = 4,/*!< LAYER3_BEATS_16 : 16-beats (CHECK mistake?)                      */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_32 = 5,/*!< LAYER3_BEATS_32 : 32-beats (AXI4 only)                           */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_64 = 6,/*!< LAYER3_BEATS_64 : 64-beats (AXI4 only)                           */
  DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_LAYER3_BEATS_128 = 7,/*!< LAYER3_BEATS_128 : 128-beats (AXI4 only)                        */
} DC_LAYER3STRIDE_LAYER3AXIBURSTBITS_Enum;

/* ======================================================  LAYER3RESXY  ====================================================== */
/* ========================================================  DBICMD  ========================================================= */
/* ========================================================  DBIRDAT  ======================================================== */
/* =========================================================  CONFG  ========================================================= */
/* =========================================================  IDREG  ========================================================= */
/* =======================================================  INTERRUPT  ======================================================= */
/* ===========================================  DC INTERRUPT INTTRIGGER [31..31]  ============================================ */
typedef enum {                                  /*!< DC_INTERRUPT_INTTRIGGER                                                   */
  DC_INTERRUPT_INTTRIGGER_LEVEL        = 1,     /*!< LEVEL : Level triggering is enabled                                       */
  DC_INTERRUPT_INTTRIGGER_EDGE         = 0,     /*!< EDGE : Edge triggering is enabled                                         */
} DC_INTERRUPT_INTTRIGGER_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ========================================================  COLMOD  ========================================================= */
/* =================================================  LAYER0COLORDECSTARTXY  ================================================= */
/* ==========================================================  CRC  ========================================================== */
/* =========================================================  GLLUT  ========================================================= */
/* =========================================================  L0LUT  ========================================================= */
/* =========================================================  L1LUT  ========================================================= */
/* ========================================================  L2LUT0  ========================================================= */
/* =========================================================  L3LUT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            DSI                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  DEVICEREADY  ====================================================== */
/* ==============================================  DSI DEVICEREADY ULPS [1..2]  ============================================== */
typedef enum {                                  /*!< DSI_DEVICEREADY_ULPS                                                      */
  DSI_DEVICEREADY_ULPS_LOW_POWER       = 2,     /*!< LOW_POWER : This pattern is set by the processor to inform that
                                                     entire DSI host is to be put on ultra low power [POWER
                                                     SAVING] mode 01 - This pattern is set by the processor
                                                     to inform                                                                 */
  DSI_DEVICEREADY_ULPS_EXIT            = 1,     /*!< EXIT : This pattern is set by the processor to inform that entire
                                                     DSI host is to be pu on ultr low power EXIT mode                          */
  DSI_DEVICEREADY_ULPS_This            = 0,     /*!< This : pattern is set by the processor to make the DSI host
                                                     come out of the wakeup time and resume the normal operation
                                                     if the DSI Host already remains in the ULPS exit state.
                                                     S/W needs to ensure that there is a minimum of 1ms time
                                                     available before clearing the UPLS exit State. 1(a). In
                                                     DPI Only Mode: No DPI traffic should be sent after the
                                                     above patterns like 10 or 01 is set in this register. Device_ready
                                                     bit in Device Ready register should not be disturbed or
                                                     should remain set while the device is subjected to ULPS
                                                     states. 1(b). In Dual Display Mode: DPI Interface has to
                                                     be disabled and also no DBI traffic should be sent after
                                                     the above patterns like 10 or 01 is set in this register.
                                                     Device_ready bit in Device Ready register should not be
                                                     disturbed or should remain set while the device is subjected
                                                     to ULPS states.                                                           */
} DSI_DEVICEREADY_ULPS_Enum;

/* =============================================  DSI DEVICEREADY READY [0..0]  ============================================== */
typedef enum {                                  /*!< DSI_DEVICEREADY_READY                                                     */
  DSI_DEVICEREADY_READY_PROGRAMMED     = 1,     /*!< PROGRAMMED : Set to 1 after dphy_parameter register, all the
                                                     count registers, and timeout and interrupt enable registers
                                                     are being programmed.                                                     */
  DSI_DEVICEREADY_READY_READY          = 0,     /*!< READY : Set by the processor to inform that device is ready
                                                     for transmission. This register should be set to 1 after
                                                     dphy_parameter register, all the count registers, and timeout
                                                     and interrupt enable registers are being programmed. Note:
                                                     Reprogramming the registers by resetting the device_ready
                                                     bit results in re-enumeration of the DSI controller from
                                                     the power up sequence.                                                    */
} DSI_DEVICEREADY_READY_Enum;

/* =======================================================  INTRSTAT  ======================================================== */
/* ========================================================  INTREN  ========================================================= */
/* ======================================================  DSIFUNCPRG  ======================================================= */
/* ============================================  DSI DSIFUNCPRG REGNAME [13..15]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_REGNAME                                                    */
  DSI_DSIFUNCPRG_REGNAME_command       = 0,     /*!< command : mode is not supported]                                          */
  DSI_DSIFUNCPRG_REGNAME_16BIT0        = 1,     /*!< 16BIT0 : 16 bit data                                                      */
  DSI_DSIFUNCPRG_REGNAME_9BIT          = 2,     /*!< 9BIT : 9 bit data                                                         */
  DSI_DSIFUNCPRG_REGNAME_8BIT          = 3,     /*!< 8BIT : 8 bit data                                                         */
  DSI_DSIFUNCPRG_REGNAME_16BIT1        = 4,     /*!< 16BIT1 : 16 bit mode (option 1)                                           */
} DSI_DSIFUNCPRG_REGNAME_Enum;

