zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==========================================  GPIO PINCFG132 PULLCFG132 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG132_PULLCFG132                                                 */
  GPIO_PINCFG132_PULLCFG132_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG132_PULLCFG132_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG132_PULLCFG132_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG132_PULLCFG132_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG132_PULLCFG132_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG132_PULLCFG132_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG132_PULLCFG132_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG132_PULLCFG132_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG132_PULLCFG132_Enum;

/* =============================================  GPIO PINCFG132 DS132 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG132_DS132                                                      */
  GPIO_PINCFG132_DS132_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG132_DS132_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG132_DS132_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG132_DS132_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG132_DS132_Enum;

/* ============================================  GPIO PINCFG132 OUTCFG132 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG132_OUTCFG132                                                  */
  GPIO_PINCFG132_OUTCFG132_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG132_OUTCFG132_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG132_OUTCFG132_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG132_OUTCFG132_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG132_OUTCFG132_Enum;

/* ============================================  GPIO PINCFG132 IRPTEN132 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG132_IRPTEN132                                                  */
  GPIO_PINCFG132_IRPTEN132_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG132_IRPTEN132_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG132_IRPTEN132_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG132_IRPTEN132_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG132_IRPTEN132_Enum;

/* ============================================  GPIO PINCFG132 FNCSEL132 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG132_FNCSEL132                                                  */
  GPIO_PINCFG132_FNCSEL132_SDIF1_DAT6  = 0,     /*!< SDIF1_DAT6 : SD/SDIO/MMC1 Data6 pin                                       */
  GPIO_PINCFG132_FNCSEL132_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG132_FNCSEL132_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_CT132       = 6,     /*!< CT132 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG132_FNCSEL132_NCE132      = 7,     /*!< NCE132 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG132_FNCSEL132_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG132_FNCSEL132_I2S1_WS     = 10,    /*!< I2S1_WS : Bidirectional I2S L/R clock. Operates in output mode
                                                     in master mode and input mode for slave mode. (I2S Master/Slave
                                                     1)                                                                        */
  GPIO_PINCFG132_FNCSEL132_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG132_FNCSEL132_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG132_FNCSEL132_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG132_FNCSEL132_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG132_FNCSEL132_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG132_FNCSEL132_Enum;

