zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ============================================  GPIO PINCFG133 OUTCFG133 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG133_OUTCFG133                                                  */
  GPIO_PINCFG133_OUTCFG133_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG133_OUTCFG133_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG133_OUTCFG133_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG133_OUTCFG133_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG133_OUTCFG133_Enum;

/* ============================================  GPIO PINCFG133 IRPTEN133 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG133_IRPTEN133                                                  */
  GPIO_PINCFG133_IRPTEN133_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG133_IRPTEN133_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG133_IRPTEN133_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG133_IRPTEN133_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG133_IRPTEN133_Enum;

/* ============================================  GPIO PINCFG133 FNCSEL133 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG133_FNCSEL133                                                  */
  GPIO_PINCFG133_FNCSEL133_SDIF1_DAT7  = 0,     /*!< SDIF1_DAT7 : SD/SDIO/MMC1 Data7 pin                                       */
  GPIO_PINCFG133_FNCSEL133_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG133_FNCSEL133_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_CT133       = 6,     /*!< CT133 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG133_FNCSEL133_NCE133      = 7,     /*!< NCE133 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG133_FNCSEL133_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG133_FNCSEL133_I2S1_SDIN   = 10,    /*!< I2S1_SDIN : I2S Data input (I2S Master/Slave 1)                           */
  GPIO_PINCFG133_FNCSEL133_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG133_FNCSEL133_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG133_FNCSEL133_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG133_FNCSEL133_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG133_FNCSEL133_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG133_FNCSEL133_Enum;

/* =======================================================  PINCFG134  ======================================================= */
/* ===========================================  GPIO PINCFG134 NCEPOL134 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG134_NCEPOL134                                                  */
  GPIO_PINCFG134_NCEPOL134_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG134_NCEPOL134_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG134_NCEPOL134_Enum;

/* ===========================================  GPIO PINCFG134 NCESRC134 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG134_NCESRC134                                                  */
  GPIO_PINCFG134_NCESRC134_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG134_NCESRC134_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG134_NCESRC134_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG134_NCESRC134_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG134_NCESRC134_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG134_NCESRC134_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG134_NCESRC134_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG134_NCESRC134_Enum;

