zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =============================================  GPIO PINCFG143 SR143 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG143_SR143                                                      */
  GPIO_PINCFG143_SR143_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG143_SR143_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG143_SR143_Enum;

/* =============================================  GPIO PINCFG143 DS143 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG143_DS143                                                      */
  GPIO_PINCFG143_DS143_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR143 = 0, 0.63x
                                                     output driver selected if SR143 = 1                                       */
  GPIO_PINCFG143_DS143_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR143 = 0, 0.75x
                                                     output driver selected if SR143 = 1                                       */
  GPIO_PINCFG143_DS143_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR143 = 0, 0.88x
                                                     output driver selected if SR143 = 1                                       */
  GPIO_PINCFG143_DS143_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR143 = 0, 1.0x output
                                                     driver selected if SR143 = 1                                              */
} GPIO_PINCFG143_DS143_Enum;

/* ============================================  GPIO PINCFG143 OUTCFG143 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG143_OUTCFG143                                                  */
  GPIO_PINCFG143_OUTCFG143_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG143_OUTCFG143_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG143_OUTCFG143_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG143_OUTCFG143_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG143_OUTCFG143_Enum;

/* ============================================  GPIO PINCFG143 IRPTEN143 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG143_IRPTEN143                                                  */
  GPIO_PINCFG143_IRPTEN143_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG143_IRPTEN143_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG143_IRPTEN143_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG143_IRPTEN143_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG143_IRPTEN143_Enum;

/* ============================================  GPIO PINCFG143 FNCSEL143 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG143_FNCSEL143                                                  */
  GPIO_PINCFG143_FNCSEL143_SWTRACE0    = 0,     /*!< SWTRACE0 : Serial Wire Debug Trace Output 0                               */
  GPIO_PINCFG143_FNCSEL143_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG143_FNCSEL143_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_CT143       = 6,     /*!< CT143 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG143_FNCSEL143_NCE143      = 7,     /*!< NCE143 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG143_FNCSEL143_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG143_FNCSEL143_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG143_FNCSEL143_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG143_FNCSEL143_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG143_FNCSEL143_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG143_FNCSEL143_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG143_FNCSEL143_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG143_FNCSEL143_Enum;

/* =======================================================  PINCFG144  ======================================================= */
/* ===========================================  GPIO PINCFG144 NCEPOL144 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG144_NCEPOL144                                                  */
  GPIO_PINCFG144_NCEPOL144_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG144_NCEPOL144_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG144_NCEPOL144_Enum;

/* ===========================================  GPIO PINCFG144 NCESRC144 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG144_NCESRC144                                                  */
  GPIO_PINCFG144_NCESRC144_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG144_NCESRC144_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG144_NCESRC144_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG144_NCESRC144_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG144_NCESRC144_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG144_NCESRC144_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG144_NCESRC144_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG144_NCESRC144_Enum;

/* ==========================================  GPIO PINCFG144 PULLCFG144 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG144_PULLCFG144                                                 */
  GPIO_PINCFG144_PULLCFG144_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG144_PULLCFG144_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG144_PULLCFG144_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG144_PULLCFG144_Enum;

/* =============================================  GPIO PINCFG144 SR144 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG144_SR144                                                      */
  GPIO_PINCFG144_SR144_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG144_SR144_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG144_SR144_Enum;

/* =============================================  GPIO PINCFG144 DS144 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG144_DS144                                                      */
  GPIO_PINCFG144_DS144_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR144 = 0, 0.63x
                                                     output driver selected if SR144 = 1                                       */
  GPIO_PINCFG144_DS144_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR144 = 0, 0.75x
                                                     output driver selected if SR144 = 1                                       */
  GPIO_PINCFG144_DS144_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR144 = 0, 0.88x
                                                     output driver selected if SR144 = 1                                       */
  GPIO_PINCFG144_DS144_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR144 = 0, 1.0x output
                                                     driver selected if SR144 = 1                                              */
} GPIO_PINCFG144_DS144_Enum;

/* ============================================  GPIO PINCFG144 OUTCFG144 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG144_OUTCFG144                                                  */
  GPIO_PINCFG144_OUTCFG144_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG144_OUTCFG144_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG144_OUTCFG144_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG144_OUTCFG144_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG144_OUTCFG144_Enum;

/* ============================================  GPIO PINCFG144 IRPTEN144 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG144_IRPTEN144                                                  */
  GPIO_PINCFG144_IRPTEN144_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG144_IRPTEN144_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG144_IRPTEN144_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG144_IRPTEN144_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG144_IRPTEN144_Enum;

/* ============================================  GPIO PINCFG144 FNCSEL144 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG144_FNCSEL144                                                  */
  GPIO_PINCFG144_FNCSEL144_SWTRACE1    = 0,     /*!< SWTRACE1 : Serial Wire Debug Trace Output 1                               */
  GPIO_PINCFG144_FNCSEL144_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG144_FNCSEL144_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_CT144       = 6,     /*!< CT144 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG144_FNCSEL144_NCE144      = 7,     /*!< NCE144 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG144_FNCSEL144_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG144_FNCSEL144_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG144_FNCSEL144_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG144_FNCSEL144_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG144_FNCSEL144_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG144_FNCSEL144_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG144_FNCSEL144_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG144_FNCSEL144_Enum;

/* =======================================================  PINCFG145  ======================================================= */
/* ===========================================  GPIO PINCFG145 NCEPOL145 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG145_NCEPOL145                                                  */
  GPIO_PINCFG145_NCEPOL145_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG145_NCEPOL145_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG145_NCEPOL145_Enum;

