zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =======================================================  PINCFG146  ======================================================= */
/* ===========================================  GPIO PINCFG146 NCEPOL146 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG146_NCEPOL146                                                  */
  GPIO_PINCFG146_NCEPOL146_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG146_NCEPOL146_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG146_NCEPOL146_Enum;

/* ===========================================  GPIO PINCFG146 NCESRC146 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG146_NCESRC146                                                  */
  GPIO_PINCFG146_NCESRC146_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG146_NCESRC146_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG146_NCESRC146_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG146_NCESRC146_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG146_NCESRC146_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG146_NCESRC146_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG146_NCESRC146_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG146_NCESRC146_Enum;

/* ==========================================  GPIO PINCFG146 PULLCFG146 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG146_PULLCFG146                                                 */
  GPIO_PINCFG146_PULLCFG146_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG146_PULLCFG146_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG146_PULLCFG146_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG146_PULLCFG146_Enum;

/* =============================================  GPIO PINCFG146 SR146 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG146_SR146                                                      */
  GPIO_PINCFG146_SR146_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG146_SR146_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG146_SR146_Enum;

/* =============================================  GPIO PINCFG146 DS146 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG146_DS146                                                      */
  GPIO_PINCFG146_DS146_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR146 = 0, 0.63x
                                                     output driver selected if SR146 = 1                                       */
  GPIO_PINCFG146_DS146_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR146 = 0, 0.75x
                                                     output driver selected if SR146 = 1                                       */
  GPIO_PINCFG146_DS146_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR146 = 0, 0.88x
                                                     output driver selected if SR146 = 1                                       */
  GPIO_PINCFG146_DS146_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR146 = 0, 1.0x output
                                                     driver selected if SR146 = 1                                              */
} GPIO_PINCFG146_DS146_Enum;

