zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==========================================  GPIO PINCFG152 PULLCFG152 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG152_PULLCFG152                                                 */
  GPIO_PINCFG152_PULLCFG152_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG152_PULLCFG152_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG152_PULLCFG152_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG152_PULLCFG152_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG152_PULLCFG152_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG152_PULLCFG152_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG152_PULLCFG152_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG152_PULLCFG152_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG152_PULLCFG152_Enum;

/* =============================================  GPIO PINCFG152 DS152 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG152_DS152                                                      */
  GPIO_PINCFG152_DS152_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG152_DS152_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG152_DS152_Enum;

/* ============================================  GPIO PINCFG152 OUTCFG152 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG152_OUTCFG152                                                  */
  GPIO_PINCFG152_OUTCFG152_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG152_OUTCFG152_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG152_OUTCFG152_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG152_OUTCFG152_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG152_OUTCFG152_Enum;

/* ============================================  GPIO PINCFG152 IRPTEN152 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG152_IRPTEN152                                                  */
  GPIO_PINCFG152_IRPTEN152_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG152_IRPTEN152_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG152_IRPTEN152_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG152_IRPTEN152_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG152_IRPTEN152_Enum;

/* ============================================  GPIO PINCFG152 FNCSEL152 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG152_FNCSEL152                                                  */
  GPIO_PINCFG152_FNCSEL152_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG152_FNCSEL152_DISP_D9     = 1,     /*!< DISP_D9 : Display Data 9                                                  */
  GPIO_PINCFG152_FNCSEL152_DBIB_D12    = 2,     /*!< DBIB_D12 : Display DBI Data                                               */
  GPIO_PINCFG152_FNCSEL152_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG152_FNCSEL152_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG152_FNCSEL152_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG152_FNCSEL152_CT152       = 6,     /*!< CT152 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG152_FNCSEL152_NCE152      = 7,     /*!< NCE152 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG152_FNCSEL152_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG152_FNCSEL152_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG152_FNCSEL152_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG152_FNCSEL152_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG152_FNCSEL152_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG152_FNCSEL152_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG152_FNCSEL152_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG152_FNCSEL152_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG152_FNCSEL152_Enum;

/* =======================================================  PINCFG153  ======================================================= */
/* ===========================================  GPIO PINCFG153 NCEPOL153 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG153_NCEPOL153                                                  */
  GPIO_PINCFG153_NCEPOL153_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG153_NCEPOL153_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG153_NCEPOL153_Enum;

/* ===========================================  GPIO PINCFG153 NCESRC153 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG153_NCESRC153                                                  */
  GPIO_PINCFG153_NCESRC153_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG153_NCESRC153_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG153_NCESRC153_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG153_NCESRC153_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG153_NCESRC153_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG153_NCESRC153_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG153_NCESRC153_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG153_NCESRC153_Enum;

/* ==========================================  GPIO PINCFG153 PULLCFG153 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG153_PULLCFG153                                                 */
  GPIO_PINCFG153_PULLCFG153_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG153_PULLCFG153_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG153_PULLCFG153_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG153_PULLCFG153_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG153_PULLCFG153_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG153_PULLCFG153_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG153_PULLCFG153_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG153_PULLCFG153_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG153_PULLCFG153_Enum;

/* =============================================  GPIO PINCFG153 DS153 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG153_DS153                                                      */
  GPIO_PINCFG153_DS153_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG153_DS153_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG153_DS153_Enum;

/* ============================================  GPIO PINCFG153 OUTCFG153 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG153_OUTCFG153                                                  */
  GPIO_PINCFG153_OUTCFG153_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG153_OUTCFG153_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG153_OUTCFG153_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG153_OUTCFG153_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG153_OUTCFG153_Enum;

/* ============================================  GPIO PINCFG153 IRPTEN153 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG153_IRPTEN153                                                  */
  GPIO_PINCFG153_IRPTEN153_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG153_IRPTEN153_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG153_IRPTEN153_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG153_IRPTEN153_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG153_IRPTEN153_Enum;

