zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =============================================  GPIO PINCFG155 DS155 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG155_DS155                                                      */
  GPIO_PINCFG155_DS155_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG155_DS155_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG155_DS155_Enum;

/* ============================================  GPIO PINCFG155 OUTCFG155 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG155_OUTCFG155                                                  */
  GPIO_PINCFG155_OUTCFG155_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG155_OUTCFG155_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG155_OUTCFG155_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG155_OUTCFG155_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG155_OUTCFG155_Enum;

/* ============================================  GPIO PINCFG155 IRPTEN155 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG155_IRPTEN155                                                  */
  GPIO_PINCFG155_IRPTEN155_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG155_IRPTEN155_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG155_IRPTEN155_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG155_IRPTEN155_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG155_IRPTEN155_Enum;

/* ============================================  GPIO PINCFG155 FNCSEL155 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG155_FNCSEL155                                                  */
  GPIO_PINCFG155_FNCSEL155_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG155_FNCSEL155_DISP_D12    = 1,     /*!< DISP_D12 : Display Data 12                                                */
  GPIO_PINCFG155_FNCSEL155_DBIB_D15    = 2,     /*!< DBIB_D15 : Display DBI Data                                               */
  GPIO_PINCFG155_FNCSEL155_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG155_FNCSEL155_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG155_FNCSEL155_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG155_FNCSEL155_CT155       = 6,     /*!< CT155 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG155_FNCSEL155_NCE155      = 7,     /*!< NCE155 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG155_FNCSEL155_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG155_FNCSEL155_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG155_FNCSEL155_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG155_FNCSEL155_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG155_FNCSEL155_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG155_FNCSEL155_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG155_FNCSEL155_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG155_FNCSEL155_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG155_FNCSEL155_Enum;

/* =======================================================  PINCFG156  ======================================================= */
/* ===========================================  GPIO PINCFG156 NCEPOL156 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG156_NCEPOL156                                                  */
  GPIO_PINCFG156_NCEPOL156_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG156_NCEPOL156_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG156_NCEPOL156_Enum;

/* ===========================================  GPIO PINCFG156 NCESRC156 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG156_NCESRC156                                                  */
  GPIO_PINCFG156_NCESRC156_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG156_NCESRC156_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG156_NCESRC156_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG156_NCESRC156_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG156_NCESRC156_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG156_NCESRC156_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG156_NCESRC156_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG156_NCESRC156_Enum;

/* ==========================================  GPIO PINCFG156 PULLCFG156 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG156_PULLCFG156                                                 */
  GPIO_PINCFG156_PULLCFG156_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG156_PULLCFG156_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG156_PULLCFG156_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG156_PULLCFG156_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG156_PULLCFG156_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG156_PULLCFG156_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG156_PULLCFG156_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG156_PULLCFG156_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG156_PULLCFG156_Enum;

/* =============================================  GPIO PINCFG156 DS156 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG156_DS156                                                      */
  GPIO_PINCFG156_DS156_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG156_DS156_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG156_DS156_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG156_DS156_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG156_DS156_Enum;

/* ============================================  GPIO PINCFG156 OUTCFG156 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG156_OUTCFG156                                                  */
  GPIO_PINCFG156_OUTCFG156_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG156_OUTCFG156_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG156_OUTCFG156_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG156_OUTCFG156_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG156_OUTCFG156_Enum;

/* ============================================  GPIO PINCFG156 IRPTEN156 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG156_IRPTEN156                                                  */
  GPIO_PINCFG156_IRPTEN156_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG156_IRPTEN156_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG156_IRPTEN156_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG156_IRPTEN156_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG156_IRPTEN156_Enum;

/* ============================================  GPIO PINCFG156 FNCSEL156 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG156_FNCSEL156                                                  */
  GPIO_PINCFG156_FNCSEL156_SDIF0_DAT4  = 0,     /*!< SDIF0_DAT4 : SD/SDIO/MMC0 Data4 pin                                       */
  GPIO_PINCFG156_FNCSEL156_MNCE2_1     = 1,     /*!< MNCE2_1 : MSPI Master 2 nCE 1 Signal                                      */
  GPIO_PINCFG156_FNCSEL156_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG156_FNCSEL156_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG156_FNCSEL156_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG156_FNCSEL156_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG156_FNCSEL156_CT156       = 6,     /*!< CT156 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG156_FNCSEL156_NCE156      = 7,     /*!< NCE156 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG156_FNCSEL156_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG156_FNCSEL156_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG156_FNCSEL156_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG156_FNCSEL156_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG156_FNCSEL156_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG156_FNCSEL156_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG156_FNCSEL156_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG156_FNCSEL156_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG156_FNCSEL156_Enum;

/* =======================================================  PINCFG157  ======================================================= */
/* ===========================================  GPIO PINCFG157 NCEPOL157 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG157_NCEPOL157                                                  */
  GPIO_PINCFG157_NCEPOL157_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG157_NCEPOL157_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG157_NCEPOL157_Enum;

