zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =============================================  GPIO PINCFG165 DS165 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG165_DS165                                                      */
  GPIO_PINCFG165_DS165_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG165_DS165_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG165_DS165_Enum;

/* ============================================  GPIO PINCFG165 OUTCFG165 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG165_OUTCFG165                                                  */
  GPIO_PINCFG165_OUTCFG165_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG165_OUTCFG165_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG165_OUTCFG165_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG165_OUTCFG165_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG165_OUTCFG165_Enum;

/* ============================================  GPIO PINCFG165 IRPTEN165 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG165_IRPTEN165                                                  */
  GPIO_PINCFG165_IRPTEN165_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG165_IRPTEN165_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG165_IRPTEN165_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG165_IRPTEN165_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG165_IRPTEN165_Enum;

/* ============================================  GPIO PINCFG165 FNCSEL165 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG165_FNCSEL165                                                  */
  GPIO_PINCFG165_FNCSEL165_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG165_FNCSEL165_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_CT165       = 6,     /*!< CT165 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG165_FNCSEL165_NCE165      = 7,     /*!< NCE165 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG165_FNCSEL165_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG165_FNCSEL165_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG165_FNCSEL165_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG165_FNCSEL165_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG165_FNCSEL165_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG165_FNCSEL165_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG165_FNCSEL165_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG165_FNCSEL165_Enum;

/* =======================================================  PINCFG166  ======================================================= */
/* ===========================================  GPIO PINCFG166 NCEPOL166 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG166_NCEPOL166                                                  */
  GPIO_PINCFG166_NCEPOL166_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG166_NCEPOL166_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG166_NCEPOL166_Enum;

