zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==========================================  GPIO PINCFG174 PULLCFG174 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG174_PULLCFG174                                                 */
  GPIO_PINCFG174_PULLCFG174_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG174_PULLCFG174_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG174_PULLCFG174_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG174_PULLCFG174_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG174_PULLCFG174_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG174_PULLCFG174_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG174_PULLCFG174_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG174_PULLCFG174_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG174_PULLCFG174_Enum;

/* =============================================  GPIO PINCFG174 DS174 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG174_DS174                                                      */
  GPIO_PINCFG174_DS174_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG174_DS174_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG174_DS174_Enum;

/* ============================================  GPIO PINCFG174 OUTCFG174 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG174_OUTCFG174                                                  */
  GPIO_PINCFG174_OUTCFG174_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG174_OUTCFG174_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG174_OUTCFG174_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG174_OUTCFG174_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG174_OUTCFG174_Enum;

/* ============================================  GPIO PINCFG174 IRPTEN174 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG174_IRPTEN174                                                  */
  GPIO_PINCFG174_IRPTEN174_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG174_IRPTEN174_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG174_IRPTEN174_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG174_IRPTEN174_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG174_IRPTEN174_Enum;

/* ============================================  GPIO PINCFG174 FNCSEL174 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG174_FNCSEL174                                                  */
  GPIO_PINCFG174_FNCSEL174_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED3   = 3,     /*!< RESERVED3 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED6   = 6,     /*!< RESERVED6 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED7   = 7,     /*!< RESERVED7 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG174_FNCSEL174_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG174_FNCSEL174_RESERVED11  = 11,    /*!< RESERVED11 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG174_FNCSEL174_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG174_FNCSEL174_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG174_FNCSEL174_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG174_FNCSEL174_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG174_FNCSEL174_Enum;

