zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==========================================  GPIO PINCFG195 PULLCFG195 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG195_PULLCFG195                                                 */
  GPIO_PINCFG195_PULLCFG195_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG195_PULLCFG195_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG195_PULLCFG195_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG195_PULLCFG195_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG195_PULLCFG195_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG195_PULLCFG195_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG195_PULLCFG195_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG195_PULLCFG195_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG195_PULLCFG195_Enum;

/* =============================================  GPIO PINCFG195 DS195 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG195_DS195                                                      */
  GPIO_PINCFG195_DS195_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG195_DS195_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG195_DS195_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG195_DS195_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG195_DS195_Enum;

/* ============================================  GPIO PINCFG195 OUTCFG195 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG195_OUTCFG195                                                  */
  GPIO_PINCFG195_OUTCFG195_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG195_OUTCFG195_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG195_OUTCFG195_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG195_OUTCFG195_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG195_OUTCFG195_Enum;

/* ============================================  GPIO PINCFG195 IRPTEN195 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG195_IRPTEN195                                                  */
  GPIO_PINCFG195_IRPTEN195_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG195_IRPTEN195_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG195_IRPTEN195_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG195_IRPTEN195_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG195_IRPTEN195_Enum;

/* ============================================  GPIO PINCFG195 FNCSEL195 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG195_FNCSEL195                                                  */
  GPIO_PINCFG195_FNCSEL195_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG195_FNCSEL195_MNCE3_1     = 1,     /*!< MNCE3_1 : MSPI Master 3 nCE 1 Signal                                      */
  GPIO_PINCFG195_FNCSEL195_MNCE3_0     = 2,     /*!< MNCE3_0 : MSPI Master 3 nCE 0 Signal                                      */
  GPIO_PINCFG195_FNCSEL195_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG195_FNCSEL195_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG195_FNCSEL195_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG195_FNCSEL195_CT195       = 6,     /*!< CT195 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG195_FNCSEL195_NCE195      = 7,     /*!< NCE195 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG195_FNCSEL195_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG195_FNCSEL195_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG195_FNCSEL195_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG195_FNCSEL195_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG195_FNCSEL195_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG195_FNCSEL195_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG195_FNCSEL195_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG195_FNCSEL195_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG195_FNCSEL195_Enum;

