zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =======================================================  PINCFG223  ======================================================= */
/* ===========================================  GPIO PINCFG223 NCEPOL223 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG223_NCEPOL223                                                  */
  GPIO_PINCFG223_NCEPOL223_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG223_NCEPOL223_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG223_NCEPOL223_Enum;

/* ===========================================  GPIO PINCFG223 NCESRC223 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG223_NCESRC223                                                  */
  GPIO_PINCFG223_NCESRC223_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG223_NCESRC223_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG223_NCESRC223_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG223_NCESRC223_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG223_NCESRC223_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG223_NCESRC223_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG223_NCESRC223_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG223_NCESRC223_Enum;

/* ==========================================  GPIO PINCFG223 PULLCFG223 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG223_PULLCFG223                                                 */
  GPIO_PINCFG223_PULLCFG223_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG223_PULLCFG223_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG223_PULLCFG223_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG223_PULLCFG223_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG223_PULLCFG223_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG223_PULLCFG223_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG223_PULLCFG223_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG223_PULLCFG223_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG223_PULLCFG223_Enum;

/* =============================================  GPIO PINCFG223 DS223 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG223_DS223                                                      */
  GPIO_PINCFG223_DS223_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG223_DS223_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG223_DS223_Enum;

/* ============================================  GPIO PINCFG223 OUTCFG223 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG223_OUTCFG223                                                  */
  GPIO_PINCFG223_OUTCFG223_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG223_OUTCFG223_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG223_OUTCFG223_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG223_OUTCFG223_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG223_OUTCFG223_Enum;

/* ============================================  GPIO PINCFG223 IRPTEN223 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG223_IRPTEN223                                                  */
  GPIO_PINCFG223_IRPTEN223_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG223_IRPTEN223_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG223_IRPTEN223_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG223_IRPTEN223_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG223_IRPTEN223_Enum;

/* ============================================  GPIO PINCFG223 FNCSEL223 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG223_FNCSEL223                                                  */
  GPIO_PINCFG223_FNCSEL223_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG223_FNCSEL223_DISP_D14    = 1,     /*!< DISP_D14 : Display Data 14                                                */
  GPIO_PINCFG223_FNCSEL223_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG223_FNCSEL223_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG223_FNCSEL223_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG223_FNCSEL223_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG223_FNCSEL223_CT223       = 6,     /*!< CT223 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG223_FNCSEL223_NCE223      = 7,     /*!< NCE223 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG223_FNCSEL223_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG223_FNCSEL223_MNCE3_0     = 9,     /*!< MNCE3_0 : MSPI Master 3 nCE 0 Signal                                      */
  GPIO_PINCFG223_FNCSEL223_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG223_FNCSEL223_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG223_FNCSEL223_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG223_FNCSEL223_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG223_FNCSEL223_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG223_FNCSEL223_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG223_FNCSEL223_Enum;

