zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ======================================================  XTALHSTRIMS  ====================================================== */
/* ======================================================  XTALHSCTRL  ======================================================= */
/* =======================================================  BGTLPCTRL  ======================================================= */
/* ===================================================  MRAMCRYPTOPWRCTRL  =================================================== */
/* ====================================  MCUCTRL MRAMCRYPTOPWRCTRL CRYPTOCLKGATEN [9..9]  ==================================== */
typedef enum {                                  /*!< MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN                                  */
  MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_VALID = 1,/*!< VALID : Crypto clk gating is enabled                                 */
  MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_DEFAULT = 0,/*!< DEFAULT : Crypto clk gating is disabled at default.                */
} MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_Enum;

/* ==================================  MCUCTRL MRAMCRYPTOPWRCTRL CRYPTOPWRDOWREADY [8..8]  =================================== */
typedef enum {                                  /*!< MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY                               */
  MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_VALID = 1,/*!< VALID : Indicate Crypto is ready for power down                   */
  MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_DEFAULT = 0,/*!< DEFAULT : Indicate Crypto is not ready for power down.          */
} MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_Enum;

/* =======================================================  BODISABLE  ======================================================= */
/* ==========================================  MCUCTRL BODISABLE BODCLVREN [4..4]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODCLVREN                                               */
  MCUCTRL_BODISABLE_BODCLVREN_EN       = 1,     /*!< EN : Enable VDDC_LV Brown Out reset.                                      */
  MCUCTRL_BODISABLE_BODCLVREN_DIS      = 0,     /*!< DIS : Disable VDDC_LV Brown Out reset.                                    */
} MCUCTRL_BODISABLE_BODCLVREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODSREN [3..3]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODSREN                                                 */
  MCUCTRL_BODISABLE_BODSREN_EN         = 1,     /*!< EN : Enable VDDS Brown Out reset.                                         */
  MCUCTRL_BODISABLE_BODSREN_DIS        = 0,     /*!< DIS : Disable VDDS Brown Out reset.                                       */
} MCUCTRL_BODISABLE_BODSREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODFREN [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODFREN                                                 */
  MCUCTRL_BODISABLE_BODFREN_EN         = 1,     /*!< EN : Enable VDDF Brown Out reset.                                         */
  MCUCTRL_BODISABLE_BODFREN_DIS        = 0,     /*!< DIS : Disable VDDF Brown Out reset.                                       */
} MCUCTRL_BODISABLE_BODFREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODCREN [1..1]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODCREN                                                 */
  MCUCTRL_BODISABLE_BODCREN_EN         = 1,     /*!< EN : Enable VDDC Brown Out reset.                                         */
  MCUCTRL_BODISABLE_BODCREN_DIS        = 0,     /*!< DIS : Disable VDDC Brown Out reset.                                       */
} MCUCTRL_BODISABLE_BODCREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODLRDE [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODLRDE                                                 */
  MCUCTRL_BODISABLE_BODLRDE_EN         = 0,     /*!< EN : Enable Unregulated 1.8v brown out reset.                             */
  MCUCTRL_BODISABLE_BODLRDE_DIS        = 1,     /*!< DIS : Disable Unregulated 1.8v brown out reset.                           */
} MCUCTRL_BODISABLE_BODLRDE_Enum;

/* =======================================================  D2ASPARE  ======================================================== */
/* =========================================  MCUCTRL D2ASPARE INFO1ACCESS [31..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_INFO1ACCESS                                              */
  MCUCTRL_D2ASPARE_INFO1ACCESS_EN      = 1,     /*!< EN : Enables INFO1 access                                                 */
  MCUCTRL_D2ASPARE_INFO1ACCESS_DIS     = 0,     /*!< DIS : Disables INFO1 access                                               */
} MCUCTRL_D2ASPARE_INFO1ACCESS_Enum;

/* ==========================================  MCUCTRL D2ASPARE UART3PLL [25..25]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_UART3PLL                                                 */
  MCUCTRL_D2ASPARE_UART3PLL_EN         = 1,     /*!< EN : Enables system PLL to clock UART3; PCLK always on.                   */
  MCUCTRL_D2ASPARE_UART3PLL_DIS        = 0,     /*!< DIS : Disables system PLL as UART3 clock source                           */
} MCUCTRL_D2ASPARE_UART3PLL_Enum;

/* ==========================================  MCUCTRL D2ASPARE UART2PLL [24..24]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_UART2PLL                                                 */
  MCUCTRL_D2ASPARE_UART2PLL_EN         = 1,     /*!< EN : Enables system PLL to clock UART2; PCLK always on.                   */
  MCUCTRL_D2ASPARE_UART2PLL_DIS        = 0,     /*!< DIS : Disables system PLL as UART2 clock source                           */
} MCUCTRL_D2ASPARE_UART2PLL_Enum;

