zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =======================================  MCUCTRL AUDADCPWRCTRL AUDADCBPSEN [2..2]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN                                         */
  MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN_DIS = 0,    /*!< DIS : AUDADC power switch software power disable.                         */
  MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN_EN = 1,     /*!< EN : AUDADC power switch software power enable.                           */
} MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN_Enum;

/* =======================================  MCUCTRL AUDADCPWRCTRL AUDADCAPSEN [1..1]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN                                         */
  MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN_DIS = 0,    /*!< DIS : AUDADC power switch software power disable.                         */
  MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN_EN = 1,     /*!< EN : AUDADC power switch software power enable.                           */
} MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN_Enum;

/* =====================================  MCUCTRL AUDADCPWRCTRL AUDADCPWRCTRLSWE [0..0]  ===================================== */
typedef enum {                                  /*!< MCUCTRL_AUDADCPWRCTRL_AUDADCPWRCTRLSWE                                    */
  MCUCTRL_AUDADCPWRCTRL_AUDADCPWRCTRLSWE_OVERRIDE_DIS = 0,/*!< OVERRIDE_DIS : Audio ADC temperature sensor and bandgap Software
                                                     Override Disable.                                                         */
  MCUCTRL_AUDADCPWRCTRL_AUDADCPWRCTRLSWE_OVERRIDE_EN = 1,/*!< OVERRIDE_EN : Audio ADC temperature sensor and bandgap Software
                                                     Override Enable.                                                          */
} MCUCTRL_AUDADCPWRCTRL_AUDADCPWRCTRLSWE_Enum;

/* ========================================================  AUDIO1  ========================================================= */
/* =====================================================  PGAADCIFCTRL  ====================================================== */
/* =======================================================  PGACTRL1  ======================================================== */
/* =======================================================  PGACTRL2  ======================================================== */
/* =====================================================  AUDADCPWRDLY  ====================================================== */
/* =======================================================  SDIO0CTRL  ======================================================= */
/* =======================================  MCUCTRL SDIO0CTRL SDIO0XINCLKSEL [15..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL                                          */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                                */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_48MHz = 1,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                                */
  MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_HFRC_24MHz = 2,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                                */
} MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Enum;

/* =======================================================  SDIO1CTRL  ======================================================= */
/* =======================================  MCUCTRL SDIO1CTRL SDIO1XINCLKSEL [15..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL                                          */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                                */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_48MHz = 1,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                                */
  MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_HFRC_24MHz = 2,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                                */
} MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Enum;

/* ========================================================  PDMCTRL  ======================================================== */
/* ========================================================  DSIBIST  ======================================================== */
/* ==========================================  MCUCTRL DSIBIST DSIBISTMODE [2..3]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_DSIBIST_DSIBISTMODE                                               */
  MCUCTRL_DSIBIST_DSIBISTMODE_HSMODE   = 1,     /*!< HSMODE : HS mode                                                          */
  MCUCTRL_DSIBIST_DSIBISTMODE_LPMODE   = 2,     /*!< LPMODE : LP mode                                                          */
  MCUCTRL_DSIBIST_DSIBISTMODE_RXCLKESCMODE = 3, /*!< RXCLKESCMODE : RxClkEsc mode                                              */
} MCUCTRL_DSIBIST_DSIBISTMODE_Enum;

/* ======================================================  MMSMISCCTRL  ====================================================== */
/* ========================================  MCUCTRL MMSMISCCTRL DISPSRAMCHK [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_MMSMISCCTRL_DISPSRAMCHK                                           */
  MCUCTRL_MMSMISCCTRL_DISPSRAMCHK_DIS  = 0,     /*!< DIS : Disable sram power domain checking.                                 */
  MCUCTRL_MMSMISCCTRL_DISPSRAMCHK_EN   = 1,     /*!< EN : Enable sram power domain checking                                    */
} MCUCTRL_MMSMISCCTRL_DISPSRAMCHK_Enum;

/* =========================================  MCUCTRL MMSMISCCTRL GFXSRAMCHK [0..0]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_MMSMISCCTRL_GFXSRAMCHK                                            */
  MCUCTRL_MMSMISCCTRL_GFXSRAMCHK_DIS   = 0,     /*!< DIS : Disable sram power domain checking.                                 */
  MCUCTRL_MMSMISCCTRL_GFXSRAMCHK_EN    = 1,     /*!< EN : Enable sram power domain checking                                    */
} MCUCTRL_MMSMISCCTRL_GFXSRAMCHK_Enum;

/* ======================================================  FLASHWPROT4  ====================================================== */
/* ======================================================  FLASHWPROT5  ====================================================== */
/* ======================================================  FLASHWPROT6  ====================================================== */
/* ======================================================  FLASHWPROT7  ====================================================== */
/* ======================================================  FLASHRPROT4  ====================================================== */
/* ======================================================  FLASHRPROT5  ====================================================== */
/* ======================================================  FLASHRPROT6  ====================================================== */
/* ======================================================  FLASHRPROT7  ====================================================== */
/* ========================================================  PWRSW2  ========================================================= */
/* ========================================================  CPUCFG  ========================================================= */
/* ========================================================  PLLCTL0  ======================================================== */
/* ========================================  MCUCTRL PLLCTL0 SYSPLLVDDFPDNB [31..31]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB                                            */
  MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_ENABLE = 0,    /*!< ENABLE : VDDF power up                                                    */
  MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_DISABLE = 1,   /*!< DISABLE : VDDF disable                                                    */
} MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_Enum;

/* ========================================  MCUCTRL PLLCTL0 SYSPLLVDDHPDNB [30..30]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB                                            */
  MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_ENABLE = 0,    /*!< ENABLE : VDDH power up                                                    */
  MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_DISABLE = 1,   /*!< DISABLE : VDDH disable                                                    */
} MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_Enum;

/* ==========================================  MCUCTRL PLLCTL0 SYSPLLPDB [29..29]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLPDB                                                 */
  MCUCTRL_PLLCTL0_SYSPLLPDB_DISABLE    = 0,     /*!< DISABLE : PLL power down                                                  */
  MCUCTRL_PLLCTL0_SYSPLLPDB_ENABLE     = 1,     /*!< ENABLE : PLL enable                                                       */
} MCUCTRL_PLLCTL0_SYSPLLPDB_Enum;

/* ===========================================  MCUCTRL PLLCTL0 VCOSELECT [9..9]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_VCOSELECT                                                 */
  MCUCTRL_PLLCTL0_VCOSELECT_VCOLO      = 0,     /*!< VCOLO : VCO operates in the range 60MHz - 240MHz                          */
  MCUCTRL_PLLCTL0_VCOSELECT_VCOHI      = 1,     /*!< VCOHI : VCO operates in the range 240MHz - 960MHz                         */
} MCUCTRL_PLLCTL0_VCOSELECT_Enum;

/* =============================================  MCUCTRL PLLCTL0 BYPASS [8..8]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_BYPASS                                                    */
  MCUCTRL_PLLCTL0_BYPASS_NORMAL        = 0,     /*!< NORMAL : Normal operation                                                 */
  MCUCTRL_PLLCTL0_BYPASS_BYPASS        = 1,     /*!< BYPASS : FREF is bypassed to FOUTPOSTDIV                                  */
} MCUCTRL_PLLCTL0_BYPASS_Enum;

/* ============================================  MCUCTRL PLLCTL0 FREFSEL [5..5]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_FREFSEL                                                   */
  MCUCTRL_PLLCTL0_FREFSEL_XTAL_HS      = 0,     /*!< XTAL_HS : Select high frequency crystal oscillator output. (Not
                                                     available on the Apollo510B.)                                             */
  MCUCTRL_PLLCTL0_FREFSEL_EXTREFCLK    = 1,     /*!< EXTREFCLK : Select external reference clock via GPIO15's EXTREFCLK
                                                     mux setting. Note for Apollo510B, the EXTREFCLK, which
                                                     is a divide-by-4 of the BLE crystal frequency, must be
                                                     selected as the System PLL reference clock.                               */
} MCUCTRL_PLLCTL0_FREFSEL_Enum;

/* =============================================  MCUCTRL PLLCTL0 DACPD [4..4]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_DACPD                                                     */
  MCUCTRL_PLLCTL0_DACPD_ACTIVE         = 0,     /*!< ACTIVE : Noise canceling DAC is active                                    */
  MCUCTRL_PLLCTL0_DACPD_POWERDOWN      = 1,     /*!< POWERDOWN : Power down noise canceling DAC (test mode only)               */
} MCUCTRL_PLLCTL0_DACPD_Enum;

/* =============================================  MCUCTRL PLLCTL0 DSMPD [3..3]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_DSMPD                                                     */
  MCUCTRL_PLLCTL0_DSMPD_ACTIVE         = 0,     /*!< ACTIVE : DSM is active                                                    */
  MCUCTRL_PLLCTL0_DSMPD_POWERDOWN      = 1,     /*!< POWERDOWN : DSM is powered down                                           */
} MCUCTRL_PLLCTL0_DSMPD_Enum;

