zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =======================================================  PADOVEREN  ======================================================= */
/* ========================================================  PADOVER  ======================================================== */
/* ========================================================  DEV0AXI  ======================================================== */
/* ============================================  MSPI0 DEV0AXI READONLY0 [4..4]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV0AXI_READONLY0                                                   */
  MSPI0_DEV0AXI_READONLY0_READONLY     = 1,     /*!< READONLY : Indicates AXI aperture only supports read operations           */
  MSPI0_DEV0AXI_READONLY0_READWRITE    = 0,     /*!< READWRITE : Indicates AXI aperture supports read and write operations     */
} MSPI0_DEV0AXI_READONLY0_Enum;

/* ==============================================  MSPI0 DEV0AXI SIZE0 [0..3]  =============================================== */
typedef enum {                                  /*!< MSPI0_DEV0AXI_SIZE0                                                       */
  MSPI0_DEV0AXI_SIZE0_SIZE64K          = 0,     /*!< SIZE64K : 64KB Aperture                                                   */
  MSPI0_DEV0AXI_SIZE0_SIZE128K         = 1,     /*!< SIZE128K : 128KB Aperture                                                 */
  MSPI0_DEV0AXI_SIZE0_SIZE256K         = 2,     /*!< SIZE256K : 256KB Aperture                                                 */
  MSPI0_DEV0AXI_SIZE0_SIZE512K         = 3,     /*!< SIZE512K : 512KB Aperture                                                 */
  MSPI0_DEV0AXI_SIZE0_SIZE1M           = 4,     /*!< SIZE1M : 1MB Aperture                                                     */
  MSPI0_DEV0AXI_SIZE0_SIZE2M           = 5,     /*!< SIZE2M : 2MB Aperture                                                     */
  MSPI0_DEV0AXI_SIZE0_SIZE4M           = 6,     /*!< SIZE4M : 4MB Aperture                                                     */
  MSPI0_DEV0AXI_SIZE0_SIZE8M           = 7,     /*!< SIZE8M : 8MB Aperture                                                     */
  MSPI0_DEV0AXI_SIZE0_SIZE16M          = 8,     /*!< SIZE16M : 16MB Aperture                                                   */
  MSPI0_DEV0AXI_SIZE0_SIZE32M          = 9,     /*!< SIZE32M : 32MB Aperture                                                   */
  MSPI0_DEV0AXI_SIZE0_SIZE64M          = 10,    /*!< SIZE64M : 64MB Aperture                                                   */
  MSPI0_DEV0AXI_SIZE0_SIZE128M         = 11,    /*!< SIZE128M : 128MB Aperture                                                 */
  MSPI0_DEV0AXI_SIZE0_SIZE256M         = 12,    /*!< SIZE256M : 256MB Aperture                                                 */
  MSPI0_DEV0AXI_SIZE0_SIZE512M         = 13,    /*!< SIZE512M : 512MB Aperture                                                 */
} MSPI0_DEV0AXI_SIZE0_Enum;

/* ========================================================  DEV0CFG  ======================================================== */
/* =============================================  MSPI0 DEV0CFG TXNEG0 [24..24]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV0CFG_TXNEG0                                                      */
  MSPI0_DEV0CFG_TXNEG0_NORMAL          = 0,     /*!< NORMAL : TX launched from posedge internal clock                          */
  MSPI0_DEV0CFG_TXNEG0_NEGEDGE         = 1,     /*!< NEGEDGE : TX data launched from negedge of internal clock                 */
} MSPI0_DEV0CFG_TXNEG0_Enum;

/* =============================================  MSPI0 DEV0CFG RXNEG0 [23..23]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV0CFG_RXNEG0                                                      */
  MSPI0_DEV0CFG_RXNEG0_NORMAL          = 0,     /*!< NORMAL : RX data sampled on posedge of internal clock                     */
  MSPI0_DEV0CFG_RXNEG0_NEGEDGE         = 1,     /*!< NEGEDGE : RX data sampled on negedge of internal clock                    */
} MSPI0_DEV0CFG_RXNEG0_Enum;

/* =============================================  MSPI0 DEV0CFG RXCAP0 [22..22]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV0CFG_RXCAP0                                                      */
  MSPI0_DEV0CFG_RXCAP0_NORMAL          = 0,     /*!< NORMAL : RX Capture phase aligns with CPHA setting                        */
  MSPI0_DEV0CFG_RXCAP0_DELAY           = 1,     /*!< DELAY : RX Capture phase is delayed from CPHA setting by one
                                                     clock edge                                                                */
} MSPI0_DEV0CFG_RXCAP0_Enum;

/* ============================================  MSPI0 DEV0CFG CLKDIV0 [16..21]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV0CFG_CLKDIV0                                                     */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV1        = 1,     /*!< CLKDIV1 : Core Clock dividied by 1                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV2        = 2,     /*!< CLKDIV2 : Core Clock dividied by 2                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV3        = 3,     /*!< CLKDIV3 : Core Clock dividied by 3                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV4        = 4,     /*!< CLKDIV4 : Core Clock dividied by 4                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV6        = 6,     /*!< CLKDIV6 : Core Clock dividied by 6                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV8        = 8,     /*!< CLKDIV8 : Core Clock dividied by 8                                        */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV12       = 12,    /*!< CLKDIV12 : Core Clock dividied by 12                                      */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV16       = 16,    /*!< CLKDIV16 : Core Clock dividied by 16                                      */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV24       = 24,    /*!< CLKDIV24 : Core Clock dividied by 24                                      */
  MSPI0_DEV0CFG_CLKDIV0_CLKDIV32       = 32,    /*!< CLKDIV32 : Core Clock dividied by 32                                      */
} MSPI0_DEV0CFG_CLKDIV0_Enum;

