zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =============================================  PDM0 CORECFG1 PCMCHSET [0..1]  ============================================= */
typedef enum {                                  /*!< PDM0_CORECFG1_PCMCHSET                                                    */
  PDM0_CORECFG1_PCMCHSET_CHANDIS       = 0,     /*!< CHANDIS : Channel Disabled                                                */
  PDM0_CORECFG1_PCMCHSET_MONOL         = 1,     /*!< MONOL : MONO Left                                                         */
  PDM0_CORECFG1_PCMCHSET_MONOR         = 2,     /*!< MONOR : MONO right                                                        */
  PDM0_CORECFG1_PCMCHSET_STEREO        = 3,     /*!< STEREO : Stereo                                                           */
} PDM0_CORECFG1_PCMCHSET_Enum;

/* =======================================================  CORECTRL  ======================================================== */
/* ========================================================  FIFOCNT  ======================================================== */
/* =======================================================  FIFOREAD  ======================================================== */
/* =======================================================  FIFOFLUSH  ======================================================= */
/* ========================================================  FIFOTHR  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* =======================================================  DMATRIGEN  ======================================================= */
/* ======================================================  DMATRIGSTAT  ====================================================== */
/* ========================================================  DMACFG  ========================================================= */
/* ===============================================  PDM0 DMACFG DMAPRI [8..8]  =============================================== */
typedef enum {                                  /*!< PDM0_DMACFG_DMAPRI                                                        */
  PDM0_DMACFG_DMAPRI_LOW               = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  PDM0_DMACFG_DMAPRI_HIGH              = 1,     /*!< HIGH : High Priority (service immediately)                                */
} PDM0_DMACFG_DMAPRI_Enum;

/* ===============================================  PDM0 DMACFG DMADIR [2..2]  =============================================== */
typedef enum {                                  /*!< PDM0_DMACFG_DMADIR                                                        */
  PDM0_DMACFG_DMADIR_P2M               = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. THe PDM module
                                                     will only DMA to memory.                                                  */
  PDM0_DMACFG_DMADIR_M2P               = 1,     /*!< M2P : Memory to Peripheral transaction. Not available for PDM
                                                     module                                                                    */
} PDM0_DMACFG_DMADIR_Enum;

/* ===============================================  PDM0 DMACFG DMAEN [0..0]  ================================================ */
typedef enum {                                  /*!< PDM0_DMACFG_DMAEN                                                         */
  PDM0_DMACFG_DMAEN_DIS                = 0,     /*!< DIS : Disable DMA Function                                                */
  PDM0_DMACFG_DMAEN_EN                 = 1,     /*!< EN : Enable DMA Function                                                  */
} PDM0_DMACFG_DMAEN_Enum;

/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* ====================================================  DMATARGADDRNEXT  ==================================================== */
/* ====================================================  DMATOTCOUNTNEXT  ==================================================== */
/* =====================================================  DMAENNEXTCTRL  ===================================================== */
/* ======================================================  DMATOTCOUNT  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  MCUPERFREQ  ======================================================= */
/* =========================================  PWRCTRL MCUPERFREQ PWRSTMCUE [30..31]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_MCUPERFREQ_PWRSTMCUE                                              */
  PWRCTRL_MCUPERFREQ_PWRSTMCUE_RETENTION = 3,   /*!< RETENTION : Domain is in retention                                        */
  PWRCTRL_MCUPERFREQ_PWRSTMCUE_ON      = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_MCUPERFREQ_PWRSTMCUE_OFF     = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_MCUPERFREQ_PWRSTMCUE_Enum;

/* =========================================  PWRCTRL MCUPERFREQ PWRENMCUE [29..29]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_MCUPERFREQ_PWRENMCUE                                              */
  PWRCTRL_MCUPERFREQ_PWRENMCUE_EN      = 1,     /*!< EN : Enable                                                               */
  PWRCTRL_MCUPERFREQ_PWRENMCUE_DIS     = 0,     /*!< DIS : Disable                                                             */
} PWRCTRL_MCUPERFREQ_PWRENMCUE_Enum;

/* ========================================  PWRCTRL MCUPERFREQ MCUPERFSTATUS [3..4]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MCUPERFREQ_MCUPERFSTATUS                                          */
  PWRCTRL_MCUPERFREQ_MCUPERFSTATUS_LP  = 1,     /*!< LP : MCU is in LP mode (freq=96MHz)                                       */
  PWRCTRL_MCUPERFREQ_MCUPERFSTATUS_HP  = 2,     /*!< HP : MCU is in HP mode (freq=192MHz)                                      */
} PWRCTRL_MCUPERFREQ_MCUPERFSTATUS_Enum;

/* =========================================  PWRCTRL MCUPERFREQ MCUPERFREQ [0..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MCUPERFREQ_MCUPERFREQ                                             */
  PWRCTRL_MCUPERFREQ_MCUPERFREQ_LP     = 1,     /*!< LP : MCU to be run in LP mode (freq=96MHz)                                */
  PWRCTRL_MCUPERFREQ_MCUPERFREQ_HP     = 2,     /*!< HP : MCU to be run in HP mode (freq=192MHz)                               */
} PWRCTRL_MCUPERFREQ_MCUPERFREQ_Enum;

/* =======================================================  DEVPWREN  ======================================================== */
/* =========================================  PWRCTRL DEVPWREN PWRENIOSFD1 [29..29]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENIOSFD1                                              */
  PWRCTRL_DEVPWREN_PWRENIOSFD1_EN      = 1,     /*!< EN : Power up IO FD slave 1                                               */
  PWRCTRL_DEVPWREN_PWRENIOSFD1_DIS     = 0,     /*!< DIS : Power down IO FD slave 1                                            */
} PWRCTRL_DEVPWREN_PWRENIOSFD1_Enum;

/* =========================================  PWRCTRL DEVPWREN PWRENIOSFD0 [28..28]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENIOSFD0                                              */
  PWRCTRL_DEVPWREN_PWRENIOSFD0_EN      = 1,     /*!< EN : Power up IO FD slave 0                                               */
  PWRCTRL_DEVPWREN_PWRENIOSFD0_DIS     = 0,     /*!< DIS : Power down IO FD slave 0                                            */
} PWRCTRL_DEVPWREN_PWRENIOSFD0_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRENOTP [27..27]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENOTP                                                 */
  PWRCTRL_DEVPWREN_PWRENOTP_EN         = 1,     /*!< EN : Enable                                                               */
  PWRCTRL_DEVPWREN_PWRENOTP_DIS        = 0,     /*!< DIS : Disable                                                             */
} PWRCTRL_DEVPWREN_PWRENOTP_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRENDBG [26..26]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENDBG                                                 */
  PWRCTRL_DEVPWREN_PWRENDBG_EN         = 1,     /*!< EN : Enable                                                               */
  PWRCTRL_DEVPWREN_PWRENDBG_DIS        = 0,     /*!< DIS : Disable                                                             */
} PWRCTRL_DEVPWREN_PWRENDBG_Enum;

/* =========================================  PWRCTRL DEVPWREN PWRENUSBPHY [25..25]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENUSBPHY                                              */
  PWRCTRL_DEVPWREN_PWRENUSBPHY_EN      = 1,     /*!< EN : Power up USB PHY                                                     */
  PWRCTRL_DEVPWREN_PWRENUSBPHY_DIS     = 0,     /*!< DIS : Power down USB PHY                                                  */
} PWRCTRL_DEVPWREN_PWRENUSBPHY_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRENUSB [24..24]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENUSB                                                 */
  PWRCTRL_DEVPWREN_PWRENUSB_EN         = 1,     /*!< EN : Power up USB                                                         */
  PWRCTRL_DEVPWREN_PWRENUSB_DIS        = 0,     /*!< DIS : Power down USB                                                      */
} PWRCTRL_DEVPWREN_PWRENUSB_Enum;

/* =========================================  PWRCTRL DEVPWREN PWRENSDIO1 [23..23]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENSDIO1                                               */
  PWRCTRL_DEVPWREN_PWRENSDIO1_EN       = 1,     /*!< EN : Power up SDIO1                                                       */
  PWRCTRL_DEVPWREN_PWRENSDIO1_DIS      = 0,     /*!< DIS : Power down SDIO1                                                    */
} PWRCTRL_DEVPWREN_PWRENSDIO1_Enum;

/* =========================================  PWRCTRL DEVPWREN PWRENSDIO0 [22..22]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENSDIO0                                               */
  PWRCTRL_DEVPWREN_PWRENSDIO0_EN       = 1,     /*!< EN : Power up SDIO0                                                       */
  PWRCTRL_DEVPWREN_PWRENSDIO0_DIS      = 0,     /*!< DIS : Power down SDIO0                                                    */
} PWRCTRL_DEVPWREN_PWRENSDIO0_Enum;

/* =========================================  PWRCTRL DEVPWREN PWRENCRYPTO [21..21]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENCRYPTO                                              */
  PWRCTRL_DEVPWREN_PWRENCRYPTO_EN      = 1,     /*!< EN : Power up CRYPTO                                                      */
  PWRCTRL_DEVPWREN_PWRENCRYPTO_DIS     = 0,     /*!< DIS : Power down CRYPTO                                                   */
} PWRCTRL_DEVPWREN_PWRENCRYPTO_Enum;

/* ========================================  PWRCTRL DEVPWREN PWRENDISPPHY [20..20]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENDISPPHY                                             */
  PWRCTRL_DEVPWREN_PWRENDISPPHY_EN     = 1,     /*!< EN : Power up DISP PHY                                                    */
  PWRCTRL_DEVPWREN_PWRENDISPPHY_DIS    = 0,     /*!< DIS : Power down DISP PHY                                                 */
} PWRCTRL_DEVPWREN_PWRENDISPPHY_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRENDISP [19..19]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENDISP                                                */
  PWRCTRL_DEVPWREN_PWRENDISP_EN        = 1,     /*!< EN : Power up DISP                                                        */
  PWRCTRL_DEVPWREN_PWRENDISP_DIS       = 0,     /*!< DIS : Power down DISP                                                     */
} PWRCTRL_DEVPWREN_PWRENDISP_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRENGFX [18..18]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRENGFX                                                 */
  PWRCTRL_DEVPWREN_PWRENGFX_EN         = 1,     /*!< EN : Power up GFX                                                         */
  PWRCTRL_DEVPWREN_PWRENGFX_DIS        = 0,     /*!< DIS : Power down GFX                                                      */
} PWRCTRL_DEVPWREN_PWRENGFX_Enum;

