zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =========================================  PWRCTRL DEVPWRSTATUS PWRSTIOS0 [0..0]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWRSTATUS_PWRSTIOS0                                            */
  PWRCTRL_DEVPWRSTATUS_PWRSTIOS0_ON    = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_DEVPWRSTATUS_PWRSTIOS0_OFF   = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_DEVPWRSTATUS_PWRSTIOS0_Enum;

/* ======================================================  AUDSSPWREN  ======================================================= */
/* ========================================  PWRCTRL AUDSSPWREN PWRENAUDADC [10..10]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENAUDADC                                            */
  PWRCTRL_AUDSSPWREN_PWRENAUDADC_EN    = 1,     /*!< EN : Power up AUDADC                                                      */
  PWRCTRL_AUDSSPWREN_PWRENAUDADC_DIS   = 0,     /*!< DIS : Power down AUDADC                                                   */
} PWRCTRL_AUDSSPWREN_PWRENAUDADC_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENI2S1 [7..7]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENI2S1                                              */
  PWRCTRL_AUDSSPWREN_PWRENI2S1_EN      = 1,     /*!< EN : Power up I2S1                                                        */
  PWRCTRL_AUDSSPWREN_PWRENI2S1_DIS     = 0,     /*!< DIS : Power down I2S1                                                     */
} PWRCTRL_AUDSSPWREN_PWRENI2S1_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENI2S0 [6..6]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENI2S0                                              */
  PWRCTRL_AUDSSPWREN_PWRENI2S0_EN      = 1,     /*!< EN : Power up I2S0                                                        */
  PWRCTRL_AUDSSPWREN_PWRENI2S0_DIS     = 0,     /*!< DIS : Power down I2S0                                                     */
} PWRCTRL_AUDSSPWREN_PWRENI2S0_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENPDM0 [2..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENPDM0                                              */
  PWRCTRL_AUDSSPWREN_PWRENPDM0_EN      = 1,     /*!< EN : Power up PDM0                                                        */
  PWRCTRL_AUDSSPWREN_PWRENPDM0_DIS     = 0,     /*!< DIS : Power down PDM0                                                     */
} PWRCTRL_AUDSSPWREN_PWRENPDM0_Enum;

/* ====================================================  AUDSSPWRSTATUS  ===================================================== */
/* ======================================  PWRCTRL AUDSSPWRSTATUS PWRSTAUDADC [10..10]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC                                        */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_ON = 1,    /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_OFF = 0,   /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTI2S1 [7..7]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTI2S0 [6..6]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTPDM0 [2..2]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_Enum;

/* =======================================================  MEMPWREN  ======================================================== */
/* ===========================================  PWRCTRL MEMPWREN PWRENROM [5..5]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENROM                                                 */
  PWRCTRL_MEMPWREN_PWRENROM_EN         = 1,     /*!< EN : Power up ROM                                                         */
  PWRCTRL_MEMPWREN_PWRENROM_DIS        = 0,     /*!< DIS : Power down ROM                                                      */
} PWRCTRL_MEMPWREN_PWRENROM_Enum;

/* ===========================================  PWRCTRL MEMPWREN PWRENNVM1 [4..4]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENNVM1                                                */
  PWRCTRL_MEMPWREN_PWRENNVM1_EN        = 1,     /*!< EN : Power up NVM1. NVM1 can only be enabled if NVM0 is Enabled           */
  PWRCTRL_MEMPWREN_PWRENNVM1_DIS       = 0,     /*!< DIS : Power down only NVM1. Independently power down NVM1.                */
} PWRCTRL_MEMPWREN_PWRENNVM1_Enum;

/* ===========================================  PWRCTRL MEMPWREN PWRENNVM [3..3]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENNVM                                                 */
  PWRCTRL_MEMPWREN_PWRENNVM_EN         = 1,     /*!< EN : Power up NVM0. This bit must be set to power up NVM1.                */
  PWRCTRL_MEMPWREN_PWRENNVM_DIS        = 0,     /*!< DIS : Power down NVM0 and NVM1.                                           */
} PWRCTRL_MEMPWREN_PWRENNVM_Enum;

/* ===========================================  PWRCTRL MEMPWREN PWRENTCM [0..2]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENTCM                                                 */
  PWRCTRL_MEMPWREN_PWRENTCM_NONE       = 0,     /*!< NONE : Do not enable power to any TCMs                                    */
  PWRCTRL_MEMPWREN_PWRENTCM_ITCM32K_DTCM128K = 1,/*!< ITCM32K_DTCM128K : Power ON only 32k of ITCM and 128k of DTCM            */
  PWRCTRL_MEMPWREN_PWRENTCM_ITCM128K_DTCM256K = 3,/*!< ITCM128K_DTCM256K : Power ON only 128k of ITCM and 256k of DTCM         */
  PWRCTRL_MEMPWREN_PWRENTCM_ITCM256K_DTCM512K = 7,/*!< ITCM256K_DTCM512K : Power ON 256k of ITCM and 512k of DTCM              */
} PWRCTRL_MEMPWREN_PWRENTCM_Enum;

