zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =========================================  PWRCTRL CPUPWRCTRL PMUCLKSTATE [9..9]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_PMUCLKSTATE                                            */
  PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing               */
  PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_CLOCK_ON = 1,  /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Enum;

/* ========================================  PWRCTRL CPUPWRCTRL IWICCLKSTATE [7..7]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_IWICCLKSTATE                                           */
  PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_NORMAL_OPERATION = 0,/*!< NORMAL_OPERATION : Clock follows normal HW sequencing              */
  PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_CLOCK_ON = 1, /*!< CLOCK_ON : Clock stays enabled                                            */
} PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL CPUCLKOVREN [6..6]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_CPUCLKOVREN                                            */
  PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_OVERRIDE_OFF = 0,/*!< OVERRIDE_OFF : CPU Clocks follow normal HW sequencing                   */
  PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_OVERRIDE_ON = 1,/*!< OVERRIDE_ON : Clock state will be overriden by above bits                */
} PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Enum;

/* =========================================  PWRCTRL CPUPWRCTRL EPUPWRSTATE [4..5]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_EPUPWRSTATE                                            */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_UNUSED = 0,    /*!< UNUSED : This value is reserved                                           */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_EPU_RET = 1,   /*!< EPU_RET : EPU in retention                                                */
  PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_EPU_ON = 2,    /*!< EPU_ON : EPU is ON                                                        */
} PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Enum;

/* ========================================  PWRCTRL CPUPWRCTRL EPUMODEOVREN [3..3]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_EPUMODEOVREN                                           */
  PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_EPU_NORM = 0, /*!< EPU_NORM : EPU follows normal CPU transitions as per legacy
                                                     or P channel mode                                                         */
  PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_EPU_OVERRIDE = 1,/*!< EPU_OVERRIDE : Override EPU state to match EPUPWRSTATE                 */
} PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Enum;

/* ==========================================  PWRCTRL CPUPWRCTRL SLEEPMODE [2..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_CPUPWRCTRL_SLEEPMODE                                              */
  PWRCTRL_CPUPWRCTRL_SLEEPMODE_AMBIQ_SLEEP = 0, /*!< AMBIQ_SLEEP : PMU gates off CLKIN.                                        */
  PWRCTRL_CPUPWRCTRL_SLEEPMODE_ARM_SLEEP = 1,   /*!< ARM_SLEEP : PMU does not gate off CLKIN, uses M55 internal clock
                                                     gating                                                                    */
} PWRCTRL_CPUPWRCTRL_SLEEPMODE_Enum;

/* ===================================================  PWRCTRLMODESTATUS  =================================================== */
/* =====================================  PWRCTRL PWRCTRLMODESTATUS LEGACYMODEST [0..0]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST                                    */
  PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_LEGACY_MODE_ON = 1,/*!< LEGACY_MODE_ON : Power control works in legacy mode (As per
                                                     sleeping and sleepdeep signals from M55 Core)                             */
  PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_LEGACY_MODE_OFF = 0,/*!< LEGACY_MODE_OFF : Power control works according to P/Q channel
                                                     interface signals coming from PMU                                         */
} PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_Enum;

/* =====================================================  CPUPWRSTATUS  ====================================================== */
/* =======================================================  PWRACKOVR  ======================================================= */
/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI3 [25..25]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_Enum;

/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI2 [24..24]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Enum;

/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI1 [23..23]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI [22..22]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEROM [21..21]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Enum;

