zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ============================================  RSTGEN SIMOBODM DIGBOES [2..2]  ============================================= */
typedef enum {                                  /*!< RSTGEN_SIMOBODM_DIGBOES                                                   */
  RSTGEN_SIMOBODM_DIGBOES_BOM          = 0,     /*!< BOM : Mask the VDDS digital brownout detection into the interrupt
                                                     block.                                                                    */
  RSTGEN_SIMOBODM_DIGBOES_BOE          = 1,     /*!< BOE : Enable the VDDS digital brownout detection into the interrupt
                                                     block.                                                                    */
} RSTGEN_SIMOBODM_DIGBOES_Enum;

/* ============================================  RSTGEN SIMOBODM DIGBOEF [1..1]  ============================================= */
typedef enum {                                  /*!< RSTGEN_SIMOBODM_DIGBOEF                                                   */
  RSTGEN_SIMOBODM_DIGBOEF_BOM          = 0,     /*!< BOM : Mask the VDDF digital brownout detection into the interrupt
                                                     block.                                                                    */
  RSTGEN_SIMOBODM_DIGBOEF_BOE          = 1,     /*!< BOE : Enable the VDDF digital brownout detection into the interrupt
                                                     block.                                                                    */
} RSTGEN_SIMOBODM_DIGBOEF_Enum;

/* ============================================  RSTGEN SIMOBODM DIGBOEC [0..0]  ============================================= */
typedef enum {                                  /*!< RSTGEN_SIMOBODM_DIGBOEC                                                   */
  RSTGEN_SIMOBODM_DIGBOEC_BOA          = 0,     /*!< BOA : Enable brown out detection for VDDF using the analog method.        */
  RSTGEN_SIMOBODM_DIGBOEC_BOD          = 1,     /*!< BOD : Enable brown out detection for VDDF using the digital
                                                     method.                                                                   */
} RSTGEN_SIMOBODM_DIGBOEC_Enum;

/* ========================================================  SWRESET  ======================================================== */
/* ==========================================  RSTGEN SWRESET SWRSTSYSTICK [4..4]  =========================================== */
typedef enum {                                  /*!< RSTGEN_SWRESET_SWRSTSYSTICK                                               */
  RSTGEN_SWRESET_SWRSTSYSTICK_NORMALOP = 0,     /*!< NORMALOP : Normal operation                                               */
  RSTGEN_SWRESET_SWRSTSYSTICK_RESET    = 1,     /*!< RESET : Hold SysTick feature in reset                                     */
} RSTGEN_SWRESET_SWRSTSYSTICK_Enum;

/* ============================================  RSTGEN SWRESET SWRSTTPIU [3..3]  ============================================ */
typedef enum {                                  /*!< RSTGEN_SWRESET_SWRSTTPIU                                                  */
  RSTGEN_SWRESET_SWRSTTPIU_NORMALOP    = 0,     /*!< NORMALOP : Normal operation                                               */
  RSTGEN_SWRESET_SWRSTTPIU_RESET       = 1,     /*!< RESET : Hold TPIU feature in reset                                        */
} RSTGEN_SWRESET_SWRSTTPIU_Enum;

/* ============================================  RSTGEN SWRESET SWRSTIWIC [1..1]  ============================================ */
typedef enum {                                  /*!< RSTGEN_SWRESET_SWRSTIWIC                                                  */
  RSTGEN_SWRESET_SWRSTIWIC_NORMALOP    = 0,     /*!< NORMALOP : Normal operation                                               */
  RSTGEN_SWRESET_SWRSTIWIC_RESET       = 1,     /*!< RESET : Hold IWIC feature in reset                                        */
} RSTGEN_SWRESET_SWRSTIWIC_Enum;

/* ============================================  RSTGEN SWRESET SWRSTDBG [0..0]  ============================================= */
typedef enum {                                  /*!< RSTGEN_SWRESET_SWRSTDBG                                                   */
  RSTGEN_SWRESET_SWRSTDBG_NORMALOP     = 0,     /*!< NORMALOP : Normal operation                                               */
  RSTGEN_SWRESET_SWRSTDBG_RESET        = 1,     /*!< RESET : Hold DEBUG feature in reset                                       */
} RSTGEN_SWRESET_SWRSTDBG_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* =========================================================  STAT  ========================================================== */
/* ==========================================  RSTGEN STAT RCVYINITIATED [18..19]  =========================================== */
typedef enum {                                  /*!< RSTGEN_STAT_RCVYINITIATED                                                 */
  RSTGEN_STAT_RCVYINITIATED_OEM        = 3,     /*!< OEM : Recovery was initiated because OEM certification failed.            */
  RSTGEN_STAT_RCVYINITIATED_ICV        = 2,     /*!< ICV : Recovery was initiated because ICV certification failed.            */
  RSTGEN_STAT_RCVYINITIATED_GPIO       = 1,     /*!< GPIO : Recovery was initiated by GPIO.                                    */
  RSTGEN_STAT_RCVYINITIATED_APPREQ     = 0,     /*!< APPREQ : Recovery was requested by the application.                       */
} RSTGEN_STAT_RCVYINITIATED_Enum;



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  RTCCTL  ========================================================= */
/* ===============================================  RTC RTCCTL HR1224 [5..5]  ================================================ */
typedef enum {                                  /*!< RTC_RTCCTL_HR1224                                                         */
  RTC_RTCCTL_HR1224_24HR               = 0,     /*!< 24HR : Hours in 24 hour mode                                              */
  RTC_RTCCTL_HR1224_DISABLED           = 1,     /*!< DISABLED : Disable the 24 hour mode                                       */
} RTC_RTCCTL_HR1224_Enum;

/* ================================================  RTC RTCCTL RSTOP [4..4]  ================================================ */
typedef enum {                                  /*!< RTC_RTCCTL_RSTOP                                                          */
  RTC_RTCCTL_RSTOP_RUN                 = 0,     /*!< RUN : Allow the RTC input clock to run                                    */
  RTC_RTCCTL_RSTOP_STOP                = 1,     /*!< STOP : Stop the RTC input clock                                           */
} RTC_RTCCTL_RSTOP_Enum;

/* =================================================  RTC RTCCTL RPT [1..3]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_RPT                                                            */
  RTC_RTCCTL_RPT_DIS                   = 0,     /*!< DIS : Alarm interrupt disabled                                            */
  RTC_RTCCTL_RPT_YEAR                  = 1,     /*!< YEAR : Interrupt every year                                               */
  RTC_RTCCTL_RPT_MONTH                 = 2,     /*!< MONTH : Interrupt every month                                             */
  RTC_RTCCTL_RPT_WEEK                  = 3,     /*!< WEEK : Interrupt every week                                               */
  RTC_RTCCTL_RPT_DAY                   = 4,     /*!< DAY : Interrupt every day                                                 */
  RTC_RTCCTL_RPT_HR                    = 5,     /*!< HR : Interrupt every hour                                                 */
  RTC_RTCCTL_RPT_MIN                   = 6,     /*!< MIN : Interrupt every minute                                              */
  RTC_RTCCTL_RPT_SEC                   = 7,     /*!< SEC : Interrupt every second/10th/100th                                   */
} RTC_RTCCTL_RPT_Enum;

