zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =============================================  SDIO0 CLOCKCTRL CLKEN [0..0]  ============================================== */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_CLKEN                                                     */
  SDIO0_CLOCKCTRL_CLKEN_OSC            = 1,     /*!< OSC : Oscillate                                                           */
  SDIO0_CLOCKCTRL_CLKEN_STOP           = 0,     /*!< STOP : Stop                                                               */
} SDIO0_CLOCKCTRL_CLKEN_Enum;

/* ========================================================  INTSTAT  ======================================================== */
/* ===========================================  SDIO0 INTSTAT VNDERRSTAT [29..31]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_VNDERRSTAT                                                  */
  SDIO0_INTSTAT_VNDERRSTAT_READY       = 1,     /*!< READY : Ready                                                             */
  SDIO0_INTSTAT_VNDERRSTAT_NOTREADY    = 0,     /*!< NOTREADY : Not Ready                                                      */
} SDIO0_INTSTAT_VNDERRSTAT_Enum;

/* ===========================================  SDIO0 INTSTAT TGTRESPERR [28..28]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_TGTRESPERR                                                  */
  SDIO0_INTSTAT_TGTRESPERR_NOERROR     = 0,     /*!< NOERROR : no error                                                        */
  SDIO0_INTSTAT_TGTRESPERR_ERROR       = 1,     /*!< ERROR : error                                                             */
} SDIO0_INTSTAT_TGTRESPERR_Enum;

/* ===========================================  SDIO0 INTSTAT ADMAERROR [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSTAT_ADMAERROR                                                   */
  SDIO0_INTSTAT_ADMAERROR_ERROR        = 1,     /*!< ERROR : Error                                                             */
  SDIO0_INTSTAT_ADMAERROR_NOERROR      = 0,     /*!< NOERROR : No error                                                        */
} SDIO0_INTSTAT_ADMAERROR_Enum;

/* ==========================================  SDIO0 INTSTAT AUTOCMDERROR [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_AUTOCMDERROR                                                */
  SDIO0_INTSTAT_AUTOCMDERROR_NOERROR   = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_AUTOCMDERROR_ERROR     = 1,     /*!< ERROR : Error                                                             */
} SDIO0_INTSTAT_AUTOCMDERROR_Enum;

/* =======================================  SDIO0 INTSTAT CURRENTLIMITERROR [23..23]  ======================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_CURRENTLIMITERROR                                           */
  SDIO0_INTSTAT_CURRENTLIMITERROR_NOERROR = 0,  /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_CURRENTLIMITERROR_ERROR = 1,    /*!< ERROR : Power Fail                                                        */
} SDIO0_INTSTAT_CURRENTLIMITERROR_Enum;

/* ========================================  SDIO0 INTSTAT DATAENDBITERROR [22..22]  ========================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_DATAENDBITERROR                                             */
  SDIO0_INTSTAT_DATAENDBITERROR_NOERROR = 0,    /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_DATAENDBITERROR_ERROR  = 1,     /*!< ERROR : Error                                                             */
} SDIO0_INTSTAT_DATAENDBITERROR_Enum;

/* ==========================================  SDIO0 INTSTAT DATACRCERROR [21..21]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_DATACRCERROR                                                */
  SDIO0_INTSTAT_DATACRCERROR_NOERROR   = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_DATACRCERROR_ERROR     = 1,     /*!< ERROR : Error                                                             */
} SDIO0_INTSTAT_DATACRCERROR_Enum;

/* ========================================  SDIO0 INTSTAT DATATIMEOUTERROR [20..20]  ======================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_DATATIMEOUTERROR                                            */
  SDIO0_INTSTAT_DATATIMEOUTERROR_NOERROR = 0,   /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_DATATIMEOUTERROR_ERROR = 1,     /*!< ERROR : Timeout                                                           */
} SDIO0_INTSTAT_DATATIMEOUTERROR_Enum;

/* =======================================  SDIO0 INTSTAT COMMANDINDEXERROR [19..19]  ======================================== */
typedef enum {                                  /*!< SDIO0_INTSTAT_COMMANDINDEXERROR                                           */
  SDIO0_INTSTAT_COMMANDINDEXERROR_NOERROR = 0,  /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_COMMANDINDEXERROR_ERROR = 1,    /*!< ERROR : Error                                                             */
} SDIO0_INTSTAT_COMMANDINDEXERROR_Enum;

/* =======================================  SDIO0 INTSTAT COMMANDENDBITERROR [18..18]  ======================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_COMMANDENDBITERROR                                          */
  SDIO0_INTSTAT_COMMANDENDBITERROR_NOERROR = 0, /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_COMMANDENDBITERROR_ERROR = 1,   /*!< ERROR : Timeout                                                           */
} SDIO0_INTSTAT_COMMANDENDBITERROR_Enum;

/* ========================================  SDIO0 INTSTAT COMMANDCRCERROR [17..17]  ========================================= */
typedef enum {                                  /*!< SDIO0_INTSTAT_COMMANDCRCERROR                                             */
  SDIO0_INTSTAT_COMMANDCRCERROR_NOERROR = 0,    /*!< NOERROR : No Error                                                        */
  SDIO0_INTSTAT_COMMANDCRCERROR_ERROR  = 1,     /*!< ERROR : End Bit Error Generated                                           */
} SDIO0_INTSTAT_COMMANDCRCERROR_Enum;

