zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* =================================================  UART0 FR TXFE [7..7]  ================================================== */
typedef enum {                                  /*!< UART0_FR_TXFE                                                             */
  UART0_FR_TXFE_XMTFIFO_EMPTY          = 1,     /*!< XMTFIFO_EMPTY : Transmit fifo is empty.                                   */
  UART0_FR_TXFE_XMTFIFO_NOTEMPTY       = 0,     /*!< XMTFIFO_NOTEMPTY : Transmit fifo is not empty.                            */
} UART0_FR_TXFE_Enum;

/* =================================================  UART0 FR RXFF [6..6]  ================================================== */
typedef enum {                                  /*!< UART0_FR_RXFF                                                             */
  UART0_FR_RXFF_RCVFIFO_FULL           = 1,     /*!< RCVFIFO_FULL : Receive fifo is full.                                      */
  UART0_FR_RXFF_RCVFIFO_NOTFULL        = 0,     /*!< RCVFIFO_NOTFULL : Receive fifo is not full.                               */
} UART0_FR_RXFF_Enum;

/* =================================================  UART0 FR TXFF [5..5]  ================================================== */
typedef enum {                                  /*!< UART0_FR_TXFF                                                             */
  UART0_FR_TXFF_XMTFIFO_FULL           = 1,     /*!< XMTFIFO_FULL : Transmit fifo is full.                                     */
  UART0_FR_TXFF_XMTFIFO_NOTFULL        = 0,     /*!< XMTFIFO_NOTFULL : Transmit fifo is not full.                              */
} UART0_FR_TXFF_Enum;

/* =================================================  UART0 FR RXFE [4..4]  ================================================== */
typedef enum {                                  /*!< UART0_FR_RXFE                                                             */
  UART0_FR_RXFE_RCVFIFO_EMPTY          = 1,     /*!< RCVFIFO_EMPTY : Receive fifo is empty.                                    */
  UART0_FR_RXFE_RCVFIFO_NOTEMPTY       = 0,     /*!< RCVFIFO_NOTEMPTY : Receive fifo is not empty.                             */
} UART0_FR_RXFE_Enum;

/* =================================================  UART0 FR BUSY [3..3]  ================================================== */
typedef enum {                                  /*!< UART0_FR_BUSY                                                             */
  UART0_FR_BUSY_BUSY                   = 1,     /*!< BUSY : UART busy indicator.                                               */
  UART0_FR_BUSY_NOTBUSY                = 0,     /*!< NOTBUSY : UART not busy.                                                  */
} UART0_FR_BUSY_Enum;

/* ==================================================  UART0 FR DCD [2..2]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DCD                                                              */
  UART0_FR_DCD_DETECTED                = 1,     /*!< DETECTED : Data carrier detect detected.                                  */
  UART0_FR_DCD_DEFAULT                 = 0,     /*!< DEFAULT : Data carrier detect not detected/default.                       */
} UART0_FR_DCD_Enum;

/* ==================================================  UART0 FR DSR [1..1]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DSR                                                              */
  UART0_FR_DSR_READY                   = 1,     /*!< READY : Data set ready.                                                   */
  UART0_FR_DSR_NOTREADY                = 0,     /*!< NOTREADY : Data set not ready/default.                                    */
} UART0_FR_DSR_Enum;

/* ==================================================  UART0 FR CTS [0..0]  ================================================== */
typedef enum {                                  /*!< UART0_FR_CTS                                                              */
  UART0_FR_CTS_CLEARTOSEND             = 1,     /*!< CLEARTOSEND : Clear to send is indicated.                                 */
  UART0_FR_CTS_DEFAULT                 = 0,     /*!< DEFAULT : Clear to send default value.                                    */
} UART0_FR_CTS_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCRH  ========================================================== */
/* ==========================================================  CR  =========================================================== */
/* ================================================  UART0 CR CLKSEL [4..6]  ================================================= */
typedef enum {                                  /*!< UART0_CR_CLKSEL                                                           */
  UART0_CR_CLKSEL_OFF                  = 0,     /*!< OFF : No UART clock. This is the low power default                        */
  UART0_CR_CLKSEL_HFRC_24MHZ           = 1,     /*!< HFRC_24MHZ : 24 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_HFRC_12MHZ           = 2,     /*!< HFRC_12MHZ : 12 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_HFRC_6MHZ            = 3,     /*!< HFRC_6MHZ : 6 MHz sourced from the HFRC                                   */
  UART0_CR_CLKSEL_HFRC_3MHZ            = 4,     /*!< HFRC_3MHZ : 3 MHz sourced from the HFRC                                   */
  UART0_CR_CLKSEL_HFRC_48MHZ           = 5,     /*!< HFRC_48MHZ : 48 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_PLL_CLK              = 6,     /*!< PLL_CLK : Sourced from the PLL                                            */
} UART0_CR_CLKSEL_Enum;

/* =========================================================  IFLS  ========================================================== */
/* ==========================================================  IER  ========================================================== */
/* ==========================================================  IES  ========================================================== */
/* ==========================================================  MIS  ========================================================== */
/* ==========================================================  IEC  ========================================================== */
/* ==========================================================  DCR  ========================================================== */
/* ================================================  UART0 DCR DMAPRI [3..3]  ================================================ */
typedef enum {                                  /*!< UART0_DCR_DMAPRI                                                          */
  UART0_DCR_DMAPRI_LOW                 = 0,     /*!< LOW : Low Priority (service as best effort).                              */
  UART0_DCR_DMAPRI_HIGH                = 1,     /*!< HIGH : High Priority (service immediately).                               */
} UART0_DCR_DMAPRI_Enum;

/* =======================================================  TARGADDR  ======================================================== */
/* =========================================================  COUNT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  REG00  ========================================================= */
/* =========================================================  REG04  ========================================================= */
/* =========================================================  REG08  ========================================================= */
/* =========================================================  REG0C  ========================================================= */
/* =========================================================  REG10  ========================================================= */
/* =========================================================  REG14  ========================================================= */
/* ===============================================  USBPHY REG14 BF55 [5..5]  ================================================ */
typedef enum {                                  /*!< USBPHY_REG14_BF55                                                         */
  USBPHY_REG14_BF55_DIV40              = 0,     /*!< DIV40 : PLL feedback clock divided by 40.                                 */
  USBPHY_REG14_BF55_DIV20              = 1,     /*!< DIV20 : PLL feedback clock divided by 20.                                 */
} USBPHY_REG14_BF55_Enum;

