zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ============================================  USB CFG0 EP1InIntStat [17..17]  ============================================= */
typedef enum {                                  /*!< USB_CFG0_EP1InIntStat                                                     */
  USB_CFG0_EP1InIntStat_INACTIVE       = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG0_EP1InIntStat_ACTIVE         = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG0_EP1InIntStat_Enum;

/* ============================================  USB CFG0 EP0InIntStat [16..16]  ============================================= */
typedef enum {                                  /*!< USB_CFG0_EP0InIntStat                                                     */
  USB_CFG0_EP0InIntStat_INACTIVE       = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG0_EP0InIntStat_ACTIVE         = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG0_EP0InIntStat_Enum;

/* ==============================================  USB CFG0 ISOUpdate [15..15]  ============================================== */
typedef enum {                                  /*!< USB_CFG0_ISOUpdate                                                        */
  USB_CFG0_ISOUpdate_DONT_WAIT         = 0,     /*!< DONT_WAIT : Clear for USB Controller not to wait for SOF token
                                                     before sending packet.                                                    */
  USB_CFG0_ISOUpdate_WAIT              = 1,     /*!< WAIT : Set to have USB Controller wait for SOF token before
                                                     sending packet.                                                           */
} USB_CFG0_ISOUpdate_Enum;

/* =============================================  USB CFG0 AMSPECIFIC [14..14]  ============================================== */
typedef enum {                                  /*!< USB_CFG0_AMSPECIFIC                                                       */
  USB_CFG0_AMSPECIFIC_NOT_CONNECTED    = 0,     /*!< NOT_CONNECTED : Clear to disable/disconnect USB lines.                    */
  USB_CFG0_AMSPECIFIC_CONNECTED        = 1,     /*!< CONNECTED : Set to enable USB lines.                                      */
} USB_CFG0_AMSPECIFIC_Enum;

/* ===============================================  USB CFG0 HSEnab [13..13]  ================================================ */
typedef enum {                                  /*!< USB_CFG0_HSEnab                                                           */
  USB_CFG0_HSEnab_DIS_HS               = 0,     /*!< DIS_HS : Clear to disable High-speed mode (Full-speed mode only).         */
  USB_CFG0_HSEnab_EN_HS                = 1,     /*!< EN_HS : Set to enable High-speed mode.                                    */
} USB_CFG0_HSEnab_Enum;

/* ===============================================  USB CFG0 HSMode [12..12]  ================================================ */
typedef enum {                                  /*!< USB_CFG0_HSMode                                                           */
  USB_CFG0_HSMode_FS_MODE              = 0,     /*!< FS_MODE : Indicates USB Controller is in Full-speed mode only.            */
  USB_CFG0_HSMode_HS_MODE              = 1,     /*!< HS_MODE : Indicates USB Controller is in High-speed mode.                 */
} USB_CFG0_HSMode_Enum;

/* ================================================  USB CFG0 Reset [11..11]  ================================================ */
typedef enum {                                  /*!< USB_CFG0_Reset                                                            */
  USB_CFG0_Reset_NEG_RESET_COMPLETE    = 0,     /*!< NEG_RESET_COMPLETE : Indicates that HS negotiation has completed
                                                     successfully, or 2.1 ms of reset signaling has elapsed.                   */
  USB_CFG0_Reset_RESETTING             = 1,     /*!< RESETTING : Indicates that Reset signaling is detected and remains
                                                     high until the bus reverts to an idle state.                              */
} USB_CFG0_Reset_Enum;

/* ===============================================  USB CFG0 Resume [10..10]  ================================================ */
typedef enum {                                  /*!< USB_CFG0_Resume                                                           */
  USB_CFG0_Resume_END_RESUME           = 0,     /*!< END_RESUME : Cleared automatically 10-15 ms after being manually
                                                     set.                                                                      */
  USB_CFG0_Resume_RESUME               = 1,     /*!< RESUME : Set to force USB Controller to generate Resume signal
                                                     on the USB to cause remote wake-up from Suspend mode.                     */
} USB_CFG0_Resume_Enum;

/* ================================================  USB CFG0 Suspen [9..9]  ================================================= */
typedef enum {                                  /*!< USB_CFG0_Suspen                                                           */
  USB_CFG0_Suspen_RESUMED              = 0,     /*!< RESUMED : Indicates that Suspend Mode exited.                             */
  USB_CFG0_Suspen_SUSPENDED            = 1,     /*!< SUSPENDED : Indicates that Suspend Mode entered.                          */
} USB_CFG0_Suspen_Enum;

/* =================================================  USB CFG0 Enabl [8..8]  ================================================= */
typedef enum {                                  /*!< USB_CFG0_Enabl                                                            */
  USB_CFG0_Enabl_DISABLE_SUSPENDM      = 0,     /*!< DISABLE_SUSPENDM : Clear to disable SUSPENDM signal - UTM does
                                                     not go into its low-power mode.                                           */
  USB_CFG0_Enabl_ENABLE_SUSPENDM       = 1,     /*!< ENABLE_SUSPENDM : Set to enable the SUSPENDM signal to put the
                                                     UTM (and any other HW which uses the SUSPENDM signal) into
                                                     Suspend mode.                                                             */
} USB_CFG0_Enabl_Enum;

/* ================================================  USB CFG0 Update [7..7]  ================================================= */
typedef enum {                                  /*!< USB_CFG0_Update                                                           */
  USB_CFG0_Update_NEW_ADDR_SET         = 0,     /*!< NEW_ADDR_SET : Indicates that the new address has taken effect.           */
  USB_CFG0_Update_NEW_ADDR_WRITTEN     = 1,     /*!< NEW_ADDR_WRITTEN : Indicates that a new function address has
                                                     been written to the FuncAddr field.                                       */
} USB_CFG0_Update_Enum;

