zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ==============================================  USB CFG3 ENDPOINT [16..19]  =============================================== */
typedef enum {                                  /*!< USB_CFG3_ENDPOINT                                                         */
  USB_CFG3_ENDPOINT_ENDPOINT0          = 0,     /*!< ENDPOINT0 : Endpoint 0 selected.                                          */
  USB_CFG3_ENDPOINT_ENDPOINT1          = 1,     /*!< ENDPOINT1 : Endpoint 1 selected.                                          */
  USB_CFG3_ENDPOINT_ENDPOINT2          = 2,     /*!< ENDPOINT2 : Endpoint 2 selected.                                          */
  USB_CFG3_ENDPOINT_ENDPOINT3          = 3,     /*!< ENDPOINT3 : Endpoint 3 selected.                                          */
  USB_CFG3_ENDPOINT_ENDPOINT4          = 4,     /*!< ENDPOINT4 : Endpoint 4 selected.                                          */
  USB_CFG3_ENDPOINT_ENDPOINT5          = 5,     /*!< ENDPOINT5 : Endpoint 5 selected.                                          */
} USB_CFG3_ENDPOINT_Enum;

/* =========================================================  IDX0  ========================================================== */
/* ===============================================  USB IDX0 AutoSet [31..31]  =============================================== */
typedef enum {                                  /*!< USB_IDX0_AutoSet                                                          */
  USB_IDX0_AutoSet_NO_AUTOSET          = 0,     /*!< NO_AUTOSET : InPktRdy field is not automatically set when MAXPAYLOAD
                                                     data size is loaded into the IN FIFO.                                     */
  USB_IDX0_AutoSet_AUTOSET             = 1,     /*!< AUTOSET : Applicable InPktRdy field is automatically set when
                                                     MAXPAYLOAD data size is loaded into the IN FIFO. If a packet
                                                     of less than the maximum packet size is loaded, InPktRdy
                                                     will have to be set manually. Note: Should not be set for
                                                     high-bandwidth Isochronous endpoints.                                     */
} USB_IDX0_AutoSet_Enum;

/* =================================================  USB IDX0 ISO [30..30]  ================================================= */
typedef enum {                                  /*!< USB_IDX0_ISO                                                              */
  USB_IDX0_ISO_BULK_INT                = 0,     /*!< BULK_INT : Clear to enable the IN endpoint for Bulk/Interrupt
                                                     transfers.                                                                */
  USB_IDX0_ISO_ISO                     = 1,     /*!< ISO : Set to enable the IN endpoint for Isochronous transfers.            */
} USB_IDX0_ISO_Enum;

/* ================================================  USB IDX0 Mode [29..29]  ================================================= */
typedef enum {                                  /*!< USB_IDX0_Mode                                                             */
  USB_IDX0_Mode_OUT                    = 0,     /*!< OUT : Clear to enable the OUT direction for endpoint.                     */
  USB_IDX0_Mode_IN                     = 1,     /*!< IN : Set to enable the IN direction for endpoint.                         */
} USB_IDX0_Mode_Enum;

/* =============================================  USB IDX0 FrcDataTog [27..27]  ============================================== */
typedef enum {                                  /*!< USB_IDX0_FrcDataTog                                                       */
  USB_IDX0_FrcDataTog_NO_FORCE_TOGGLE  = 0,     /*!< NO_FORCE_TOGGLE : Keep cleared to not force data toggle.                  */
  USB_IDX0_FrcDataTog_FORCE_TOGGLE     = 1,     /*!< FORCE_TOGGLE : Set to force the endpoint's IN data toggle to
                                                     switch after each data packet is sent.                                    */
} USB_IDX0_FrcDataTog_Enum;

/* =============================================  USB IDX0 DPktBufDis [25..25]  ============================================== */
typedef enum {                                  /*!< USB_IDX0_DPktBufDis                                                       */
  USB_IDX0_DPktBufDis_EN_DPB           = 0,     /*!< EN_DPB : Clear to allow Double Packet Buffering.                          */
  USB_IDX0_DPktBufDis_DIS_DPB          = 1,     /*!< DIS_DPB : Set to disable Double Packet Buffering regardless
                                                     of the End Point FIFO size and MAXPAYLOAD size relationship.              */
} USB_IDX0_DPktBufDis_Enum;

/* =======================================  USB IDX0 IncompTxServiceSetupEnd [23..23]  ======================================= */
typedef enum {                                  /*!< USB_IDX0_IncompTxServiceSetupEnd                                          */
  USB_IDX0_IncompTxServiceSetupEnd_NOP = 0,     /*!< NOP : This value is a NOP.                                                */
  USB_IDX0_IncompTxServiceSetupEnd_CLR_SETUPEND = 1,/*!< CLR_SETUPEND : Set to clear the SetupEnd bit. This bit is cleared
                                                     automatically.                                                            */
} USB_IDX0_IncompTxServiceSetupEnd_Enum;

/* =========================================================  IDX1  ========================================================== */
/* ==============================================  USB IDX1 AutoClear [31..31]  ============================================== */
typedef enum {                                  /*!< USB_IDX1_AutoClear                                                        */
  USB_IDX1_AutoClear_NO_AUTOCLR        = 0,     /*!< NO_AUTOCLR : OutPktRdy field will not be automatically cleared
                                                     when a packet of MAXPAYLOAD data size is unloaded from
                                                     the OUT FIFO.                                                             */
  USB_IDX1_AutoClear_AUTOCLR           = 1,     /*!< AUTOCLR : OutPktRdy field will be automatically cleared when
                                                     a packet of MAXPAYLOAD data size is unloaded from the OUT
                                                     FIFO. When packets of less than the maximum packet size
                                                     are unloaded, OutPktRdy must be cleared manually. Note:
                                                     Should not be set for high bandwidth Isochronous endpoints.               */
} USB_IDX1_AutoClear_Enum;

/* =================================================  USB IDX1 ISO [30..30]  ================================================= */
typedef enum {                                  /*!< USB_IDX1_ISO                                                              */
  USB_IDX1_ISO_BULK_INT                = 0,     /*!< BULK_INT : Clear to enable the OUT endpoint for Bulk/Interrupt
                                                     transfers.                                                                */
  USB_IDX1_ISO_ISO                     = 1,     /*!< ISO : Set to enable the OUT endpoint for Isochronous transfers.           */
} USB_IDX1_ISO_Enum;

/* =============================================  USB IDX1 DPktBufDis [25..25]  ============================================== */
typedef enum {                                  /*!< USB_IDX1_DPktBufDis                                                       */
  USB_IDX1_DPktBufDis_EN_DPB           = 0,     /*!< EN_DPB : Clear to allow Double Packet Buffering.                          */
  USB_IDX1_DPktBufDis_DIS_DPB          = 1,     /*!< DIS_DPB : Set to disable Double Packet Buffering regardless
                                                     of the End Point FIFO size and MAXPAYLOAD size relationship.              */
} USB_IDX1_DPktBufDis_Enum;

