zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo510.h
/* ======================================================  OBSCLRSTAT  ======================================================= */
/* =====================================================  DPDMPULLDOWN  ====================================================== */
/* ======================================================  BCDETSTATUS  ====================================================== */
/* ======================================================  BCDETCRTL1  ======================================================= */
/* ===========================================  USB BCDETCRTL1 USBDCOMPREF [8..9]  =========================================== */
typedef enum {                                  /*!< USB_BCDETCRTL1_USBDCOMPREF                                                */
  USB_BCDETCRTL1_USBDCOMPREF_1P25V     = 3,     /*!< 1P25V : 1.25V                                                             */
  USB_BCDETCRTL1_USBDCOMPREF_2P35      = 2,     /*!< 2P35 : 2.35V                                                              */
  USB_BCDETCRTL1_USBDCOMPREF_3P10V     = 1,     /*!< 3P10V : 3.10V                                                             */
  USB_BCDETCRTL1_USBDCOMPREF_1P65      = 0,     /*!< 1P65 : 1.65V (VCCIO/2)                                                    */
} USB_BCDETCRTL1_USBDCOMPREF_Enum;

/* ======================================================  BCDETCRTL2  ======================================================= */
/* ========================================================  DMACTRL  ======================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* =======================================================  DMAINTEN  ======================================================== */
/* ======================================================  DMAINTSTAT  ======================================================= */
/* =======================================================  DMAINTCLR  ======================================================= */
/* =======================================================  DMAINTSET  ======================================================= */
/* =======================================================  ADMACTRL  ======================================================== */
/* ========================================================  ADMAEN  ========================================================= */
/* ========================================================  ADMADIR  ======================================================== */
/* ========================================================  ADMAPRI  ======================================================== */
/* =====================================================  ADMACMPINTEN  ====================================================== */
/* ====================================================  ADMACMPINTSTAT  ===================================================== */
/* =====================================================  ADMACMPINTCLR  ===================================================== */
/* =====================================================  ADMACMPINTSET  ===================================================== */
/* =====================================================  ADMAERRINTEN  ====================================================== */
/* ====================================================  ADMAERRINTSTAT  ===================================================== */
/* =====================================================  ADMAERRINTCLR  ===================================================== */
/* =====================================================  ADMAERRINTSET  ===================================================== */
/* =====================================================  ADMATOTCOUNT0  ===================================================== */
/* =====================================================  ADMATOTCOUNT1  ===================================================== */
/* =====================================================  ADMATOTCOUNT2  ===================================================== */
/* =====================================================  ADMATOTCOUNT3  ===================================================== */
/* =====================================================  ADMATOTCOUNT4  ===================================================== */
/* =====================================================  ADMATOTCOUNT5  ===================================================== */
/* =====================================================  ADMATOTCOUNT6  ===================================================== */
/* =====================================================  ADMATOTCOUNT7  ===================================================== */
/* =====================================================  ADMATOTCOUNT8  ===================================================== */
/* =====================================================  ADMATOTCOUNT9  ===================================================== */
/* =====================================================  ADMATARGADDR0  ===================================================== */
/* =====================================================  ADMATARGADDR1  ===================================================== */
/* =====================================================  ADMATARGADDR2  ===================================================== */
/* =====================================================  ADMATARGADDR3  ===================================================== */
/* =====================================================  ADMATARGADDR4  ===================================================== */
/* =====================================================  ADMATARGADDR5  ===================================================== */
/* =====================================================  ADMATARGADDR6  ===================================================== */
/* =====================================================  ADMATARGADDR7  ===================================================== */
/* =====================================================  ADMATARGADDR8  ===================================================== */
/* =====================================================  ADMATARGADDR9  ===================================================== */
/* ========================================================  ADMAEP0  ======================================================== */
/* ========================================================  ADMAEP1  ======================================================== */
/* ========================================================  ADMAEP2  ======================================================== */
/* ========================================================  ADMAEP3  ======================================================== */
/* ========================================================  ADMAEP4  ======================================================== */
/* ========================================================  ADMAEP5  ======================================================== */
/* ========================================================  ADMAEP6  ======================================================== */
/* ========================================================  ADMAEP7  ======================================================== */
/* ========================================================  ADMAEP8  ======================================================== */
/* ========================================================  ADMAEP9  ======================================================== */
/* =====================================================  ADMAREQSIZE0  ====================================================== */
/* =====================================================  ADMAREQSIZE1  ====================================================== */
/* =====================================================  ADMAREQSIZE2  ====================================================== */
/* =====================================================  ADMAREQSIZE3  ====================================================== */
/* =====================================================  ADMAREQSIZE4  ====================================================== */
/* =====================================================  ADMAREQSIZE5  ====================================================== */
/* =====================================================  ADMAREQSIZE6  ====================================================== */
/* =====================================================  ADMAREQSIZE7  ====================================================== */
/* =====================================================  ADMAREQSIZE8  ====================================================== */
/* =====================================================  ADMAREQSIZE9  ====================================================== */


/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ===============================================  VCOMP CFG LVLSEL [16..19]  =============================================== */
typedef enum {                                  /*!< VCOMP_CFG_LVLSEL                                                          */
  VCOMP_CFG_LVLSEL_0P58V               = 0,     /*!< 0P58V : Set Reference input to 0.58 Volts.                                */
  VCOMP_CFG_LVLSEL_0P77V               = 1,     /*!< 0P77V : Set Reference input to 0.77 Volts.                                */
  VCOMP_CFG_LVLSEL_0P97V               = 2,     /*!< 0P97V : Set Reference input to 0.97 Volts.                                */
  VCOMP_CFG_LVLSEL_1P16V               = 3,     /*!< 1P16V : Set Reference input to 1.16 Volts.                                */
  VCOMP_CFG_LVLSEL_1P35V               = 4,     /*!< 1P35V : Set Reference input to 1.35 Volts.                                */
  VCOMP_CFG_LVLSEL_1P55V               = 5,     /*!< 1P55V : Set Reference input to 1.55 Volts.                                */
  VCOMP_CFG_LVLSEL_1P74V               = 6,     /*!< 1P74V : Set Reference input to 1.74 Volts.                                */
  VCOMP_CFG_LVLSEL_1P93V               = 7,     /*!< 1P93V : Set Reference input to 1.93 Volts.                                */
  VCOMP_CFG_LVLSEL_2P13V               = 8,     /*!< 2P13V : Set Reference input to 2.13 Volts.                                */
} VCOMP_CFG_LVLSEL_Enum;

/* =================================================  VCOMP CFG NSEL [8..9]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_NSEL                                                            */
  VCOMP_CFG_NSEL_VREFEXT1              = 0,     /*!< VREFEXT1 : Use external reference 1 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT2              = 1,     /*!< VREFEXT2 : Use external reference 2 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT3              = 2,     /*!< VREFEXT3 : Use external reference 3 for reference input.                  */
  VCOMP_CFG_NSEL_DAC                   = 3,     /*!< DAC : Use DAC output selected by LVLSEL for reference input.              */
} VCOMP_CFG_NSEL_Enum;

/* =================================================  VCOMP CFG PSEL [0..1]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_PSEL                                                            */
  VCOMP_CFG_PSEL_VDDADJ                = 0,     /*!< VDDADJ : Use VDDADJ for the positive input.                               */
  VCOMP_CFG_PSEL_VTEMP                 = 1,     /*!< VTEMP : Use the temperature sensor output for the positive input.
                                                     Note: If this channel is selected for PSEL, the bandap
                                                     circuit required for temperature comparisons will automatically
                                                     turn on. The bandgap circuit requires 11us to stabalize.                  */
  VCOMP_CFG_PSEL_VEXT1                 = 2,     /*!< VEXT1 : Use external voltage 0 for positive input.                        */
  VCOMP_CFG_PSEL_VEXT2                 = 3,     /*!< VEXT2 : Use external voltage 1 for positive input.                        */
} VCOMP_CFG_PSEL_Enum;

/* =========================================================  STAT  ========================================================== */
/* ===============================================  VCOMP STAT PWDSTAT [1..1]  =============================================== */
typedef enum {                                  /*!< VCOMP_STAT_PWDSTAT                                                        */
  VCOMP_STAT_PWDSTAT_POWERED_DOWN      = 1,     /*!< POWERED_DOWN : The voltage comparator is powered down.                    */
  VCOMP_STAT_PWDSTAT_POWERED_UP        = 0,     /*!< POWERED_UP : The voltage comparator is powered up.                        */
} VCOMP_STAT_PWDSTAT_Enum;

